// AnimBlueprintGeneratedClass 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C
// Size: 0x4714 (Inherited: 0x2e0)
struct U1ST_CHA_RIG_AnimBP_C : UIcarusCharacterAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x2e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x310(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x338(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x420(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x450(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x538(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x568(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x618(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x660(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x808(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x830(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x858(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x8a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x8d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x8f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x920(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x948(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x970(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x998(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x9c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x9e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xa10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xa38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xa60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xa88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xab0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xad8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xb00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xb80(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xbb0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xc50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xcd0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xd50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xd80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xe00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xe30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xeb0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xee0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xf90(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xfc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xfe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1010(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1038(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1060(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x10e0(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x1110(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x11d8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x1228(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1278(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x12a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1328(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1358(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1408(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1438(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x14b8(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x14e8(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x15b0(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1600(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x16c8(0x50)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1718(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1738(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1758(0x108)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1860(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x18e0(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x1980(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x19d0(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x1a20(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1ac0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x1b40(0xa0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization_2; // 0x1be0(0x70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1c50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1c80(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1d00(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x1d80(0xa0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x1e20(0x70)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1e90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1ec0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1f40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1f70(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1ff0(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x20b0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2150(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x21d0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2200(0x28)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x2228(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x22d8(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x2308(0x118)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x2420(0x38)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x2458(0xd0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x2528(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x25d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2600(0x158)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2758(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2840(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x2900(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2930(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2958(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2980(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x29a8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x29d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2a00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2a80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2ab0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2b30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2b60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2be0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2c10(0xb0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x2cc0(0x38)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x2cf8(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2dc8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2e68(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x2f08(0x50)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2f58(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2f78(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x2f98(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x2fe0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3028(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x3070(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x30b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x31c0(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x32c8(0x50)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x3318(0x118)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x3430(0x190)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x35c0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3608(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x3650(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x3758(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x3778(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x3798(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x38a0(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x38e8(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x39f0(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3a18(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3a38(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3a58(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3a88(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3b28(0xe8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x3c10(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3c38(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3d90(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3db8(0xc0)
	struct ABP_IcarusPlayerCharacterSurvival_C* OwningBPCharacter; // 0x3e78(0x08)
	float CurrentVelocity; // 0x3e80(0x04)
	float EasedCurrentVelocity; // 0x3e84(0x04)
	struct FRangedWeaponData RangedWeaponData; // 0x3e88(0xd0)
	bool IsADS; // 0x3f58(0x01)
	char pad_3F59[0x3]; // 0x3f59(0x03)
	float ChargePower; // 0x3f5c(0x04)
	bool IsReloading; // 0x3f60(0x01)
	bool IsFiring; // 0x3f61(0x01)
	char pad_3F62[0x6]; // 0x3f62(0x06)
	struct TSoftObjectPtr<UBlendSpaceBase> LocomotionBS; // 0x3f68(0x28)
	enum class EAnimOverlayState OverlayState; // 0x3f90(0x01)
	bool IsCrouched; // 0x3f91(0x01)
	bool RequestedJump; // 0x3f92(0x01)
	bool IsGrounded; // 0x3f93(0x01)
	bool IsJumping; // 0x3f94(0x01)
	bool IsFalling; // 0x3f95(0x01)
	char pad_3F96[0x2]; // 0x3f96(0x02)
	float LocomotionCamBoneWeight; // 0x3f98(0x04)
	bool ShowHandsWhenUnequipped; // 0x3f9c(0x01)
	char pad_3F9D[0x3]; // 0x3f9d(0x03)
	struct FFocusableData CurrentFocusableData; // 0x3fa0(0x1f0)
	bool IsSprinting; // 0x4190(0x01)
	char pad_4191[0x3]; // 0x4191(0x03)
	float AimPlayRate; // 0x4194(0x04)
	struct FVector GripSocketLocation; // 0x4198(0x0c)
	float IKAlpha; // 0x41a4(0x04)
	float TargetRecoil; // 0x41a8(0x04)
	float CurrentRecoil; // 0x41ac(0x04)
	struct FFirearmAnimData FirearmData; // 0x41b0(0x130)
	struct TArray<struct UObject*> FocusableAnims; // 0x42e0(0x10)
	struct TArray<struct UObject*> BowDataAnims; // 0x42f0(0x10)
	bool HasFinishedLoadingFocusableAnims; // 0x4300(0x01)
	char pad_4301[0x3]; // 0x4301(0x03)
	float ThrowStrength; // 0x4304(0x04)
	struct UBP_ActionableBehaviour_Throwable_C* ThrowableRef; // 0x4308(0x08)
	bool IsDrawingThrowable; // 0x4310(0x01)
	bool Reeling; // 0x4311(0x01)
	bool IsCasting; // 0x4312(0x01)
	bool Casted; // 0x4313(0x01)
	char pad_4314[0xc]; // 0x4314(0x0c)
	struct FTransform MeshOffset; // 0x4320(0x30)
	struct FRotator WorldRotation; // 0x4350(0x0c)
	struct FRotator DeltaRotation; // 0x435c(0x0c)
	float ADSAlpha; // 0x4368(0x04)
	bool WantsToThrow; // 0x436c(0x01)
	char pad_436D[0x3]; // 0x436d(0x03)
	struct FTransform ItemAttachOffset; // 0x4370(0x30)
	float LandedTimeStamp; // 0x43a0(0x04)
	bool IsUnderwater; // 0x43a4(0x01)
	char pad_43A5[0x3]; // 0x43a5(0x03)
	float Direction; // 0x43a8(0x04)
	char pad_43AC[0x4]; // 0x43ac(0x04)
	struct FItemAnimationData CachedItemAnimations; // 0x43b0(0x360)
	float OverlayIdleBlend; // 0x4710(0x04)

	void VehicleLowerBody(struct FPoseLink LowerInPose, struct FPoseLink& VehicleLowerBody); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.VehicleLowerBody // (HasOutParms|BlueprintCallable) // @ game+0x1be0000
	void VehicleUpperBody(struct FPoseLink UpperInPose, struct FPoseLink& VehicleUpperBody); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.VehicleUpperBody // (HasOutParms|BlueprintCallable) // @ game+0x1be0000
	void AnimGraph(struct FPoseLink& AnimGraph); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	bool IsSwimming(); // Function 1ST_CHA_RIG_AnimBP.1ST_CHA_RIG_AnimBP_C.IsSwimming // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1be0000
