// BlueprintGeneratedClass BP_Building_Base.BP_Building_Base_C
// Size: 0xa1a (Inherited: 0x420)
struct ABP_Building_Base_C : ABuildingBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x420(0x08)
	struct UShelteredModifierComponent* ShelteredModifier; // 0x428(0x08)
	struct UAudioContextComponent* AudioContext; // 0x430(0x08)
	struct USceneComponent* SecondOutsideTestLocation; // 0x438(0x08)
	struct UDestructibleComponent* Stripped_DestructibleMesh; // 0x440(0x08)
	struct UDestructibleComponent* Main_DestructibleMesh; // 0x448(0x08)
	struct UStaticMeshComponent* Stripped_BuildingMesh; // 0x450(0x08)
	struct UStaticMeshComponent* Main_BuildingShadowMesh; // 0x458(0x08)
	struct URadialForceComponent* RadialForce; // 0x460(0x08)
	struct USceneComponent* FireEffects; // 0x468(0x08)
	struct UArrowComponent* PlacementArrow; // 0x470(0x08)
	struct USceneComponent* PlacementHelpers; // 0x478(0x08)
	struct UStaticMeshComponent* FoilageCuller; // 0x480(0x08)
	struct UArrowComponent* Arrow3; // 0x488(0x08)
	struct UArrowComponent* Arrow2; // 0x490(0x08)
	struct UArrowComponent* Arrow1; // 0x498(0x08)
	struct UTextRenderComponent* rotdebug; // 0x4a0(0x08)
	struct UArrowComponent* DebugArrows; // 0x4a8(0x08)
	struct UTextRenderComponent* Debug; // 0x4b0(0x08)
	struct UStaticMeshComponent* Main_BuildingMesh; // 0x4b8(0x08)
	struct UBoxComponent* Box11; // 0x4c0(0x08)
	struct UBoxComponent* Box01; // 0x4c8(0x08)
	struct UBoxComponent* Box10; // 0x4d0(0x08)
	struct UBoxComponent* Box00; // 0x4d8(0x08)
	struct USceneComponent* CollisionTesting; // 0x4e0(0x08)
	struct USceneComponent* Center; // 0x4e8(0x08)
	struct TArray<struct FVectorPair> BlockingLinesArray; // 0x4f0(0x10)
	float GridSize; // 0x500(0x04)
	struct FVector GridLocation; // 0x504(0x0c)
	struct ABP_Grid_Base_C* ParentGrid; // 0x510(0x08)
	float Health; // 0x518(0x04)
	float AnchoredStability; // 0x51c(0x04)
	bool Dirtied; // 0x520(0x01)
	char pad_521[0x7]; // 0x521(0x07)
	struct TArray<struct ABP_Building_Base_C*> CheckedBuildingsCache; // 0x528(0x10)
	struct UMaterialInterface* debugMatCache; // 0x538(0x08)
	struct UStaticMeshComponent* MeshCache; // 0x540(0x08)
	bool debugging; // 0x548(0x01)
	char pad_549[0x7]; // 0x549(0x07)
	struct TMap<struct ABP_Building_Base_C*, float> HardStabilityMap; // 0x550(0x50)
	float SoftStability; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct FTimerHandle CrackTimer; // 0x5a8(0x08)
	float CrackUpdateTime; // 0x5b0(0x04)
	struct FVectorSpringState ShakeSpring; // 0x5b4(0x18)
	struct FVector ShakeTarget; // 0x5cc(0x0c)
	float LastHardStabilityCheck; // 0x5d8(0x04)
	char pad_5DC[0x4]; // 0x5dc(0x04)
	struct TArray<struct ABP_Building_Base_C*> CachedAffectedBuildings; // 0x5e0(0x10)
	bool MagicAnchor; // 0x5f0(0x01)
	char pad_5F1[0x7]; // 0x5f1(0x07)
	struct FTimerHandle CollapseTimer; // 0x5f8(0x08)
	struct FRotator GridSpaceRotation; // 0x600(0x0c)
	struct FVector GridSpaceCenterLocation; // 0x60c(0x0c)
	bool CachedRotateCentersUpToHitNormal; // 0x618(0x01)
	char pad_619[0x7]; // 0x619(0x07)
	struct TArray<struct ABP_Building_Base_C*> RemoteAnchorStabilityBuilding; // 0x620(0x10)
	struct FVector MeshStartingRelitiveLocation; // 0x630(0x0c)
	bool BlockLikePlacement; // 0x63c(0x01)
	char pad_63D[0x3]; // 0x63d(0x03)
	float StraightTracePlacementRange; // 0x640(0x04)
	float ForwardThenDownTraceRange; // 0x644(0x04)
	struct UMaterialInstanceDynamic* DynamicCrackMatInst; // 0x648(0x08)
	struct UCurveFloat* CrackAmountCurve; // 0x650(0x08)
	struct FTimerHandle VeryUnstableEffectsTime; // 0x658(0x08)
	struct UDestructibleMesh* DestructibleMesh; // 0x660(0x08)
	struct FString debugAnchorStabs; // 0x668(0x10)
	float LastPushAnchorStability; // 0x678(0x04)
	char pad_67C[0x4]; // 0x67c(0x04)
	struct FTimerHandle DirtyTickTimer; // 0x680(0x08)
	struct UCurveFloat* DestructibleOcclusionCurve; // 0x688(0x08)
	bool TempStability; // 0x690(0x01)
	char pad_691[0x3]; // 0x691(0x03)
	float DebugUnclampedHardStability; // 0x694(0x04)
	bool Destroyed; // 0x698(0x01)
	char pad_699[0x7]; // 0x699(0x07)
	struct TArray<struct UBP_Weight_C*> Weights; // 0x6a0(0x10)
	float DesiredCrackLevel; // 0x6b0(0x04)
	float CurrentCrackLevel; // 0x6b4(0x04)
	struct UMaterialInterface* DefaultSlot0Material; // 0x6b8(0x08)
	struct TArray<struct UMaterialInterface*> DefaultMainMeshMaterials; // 0x6c0(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> InstancedMainMeshMaterials; // 0x6d0(0x10)
	float HitProcessingRadiusThreshold; // 0x6e0(0x04)
	bool ClientsideGhost; // 0x6e4(0x01)
	bool ShowPlacementHelpers; // 0x6e5(0x01)
	char pad_6E6[0x2]; // 0x6e6(0x02)
	struct FFMODEventInstance StressDamageAudioEventInstance; // 0x6e8(0x08)
	bool StabilityAudioEnabled; // 0x6f0(0x01)
	char pad_6F1[0x3]; // 0x6f1(0x03)
	struct FVector BuildingGridFootprint; // 0x6f4(0x0c)
	bool ClampHitNormalToUpOrDown; // 0x700(0x01)
	char pad_701[0x3]; // 0x701(0x03)
	struct FRotator CachedCenterWorldRotation; // 0x704(0x0c)
	bool OnFire; // 0x710(0x01)
	bool GhostBlockedPlacement; // 0x711(0x01)
	char pad_712[0x2]; // 0x712(0x02)
	float GhostActorViewDistance; // 0x714(0x04)
	struct FVector OutsideTestPushoutAmount; // 0x718(0x0c)
	bool ReceivingWindDamage; // 0x724(0x01)
	char pad_725[0x3]; // 0x725(0x03)
	struct FTimerHandle WindDamageTimer; // 0x728(0x08)
	struct FTimerHandle WindParticleSystemSlowTimer; // 0x730(0x08)
	float BaseDamageFromWind; // 0x738(0x04)
	char pad_73C[0x4]; // 0x73c(0x04)
	struct TArray<struct FDestructionPoints> DestructibleDamagedPoints; // 0x740(0x10)
	int32_t WindDamageProcessedIndex; // 0x750(0x04)
	bool FullyStripped; // 0x754(0x01)
	char pad_755[0x3]; // 0x755(0x03)
	struct UDestructibleMesh* StrippedDestructibleMesh; // 0x758(0x08)
	struct UStaticMesh* StrippedStaticMesh; // 0x760(0x08)
	float CollisionDamageImpulseScalar; // 0x768(0x04)
	bool Stripping; // 0x76c(0x01)
	char pad_76D[0x3]; // 0x76d(0x03)
	struct FBuildableAudioData AudioData; // 0x770(0x188)
	struct FFMODEventInstance WindDamageAudioEventInstance; // 0x8f8(0x08)
	struct FVector2D DamageSoundCooldownRange; // 0x900(0x08)
	struct FVector2D DestructibleDamageSoundCooldownRange; // 0x908(0x08)
	float DamageSoundCooldownEndTime; // 0x910(0x04)
	float DestructibleDamageSoundCooldownEndTime; // 0x914(0x04)
	struct UStaticMesh* Main_BuildingStaticMesh; // 0x918(0x08)
	bool ShouldOptionallyRotateCenterUptoInpactNormal; // 0x920(0x01)
	char pad_921[0x3]; // 0x921(0x03)
	struct FVector NewGridPlacementOffset; // 0x924(0x0c)
	struct UStaticMesh* Main_BuildingShadowGeoMesh; // 0x930(0x08)
	struct UBP_WeatherAudioComponent_BuildingWindDamage_C* WindDamageWeatherAudio; // 0x938(0x08)
	struct UNavArea* BuildingNavAreaClass; // 0x940(0x08)
	bool SupportedByGround; // 0x948(0x01)
	bool FirstStabilityCalced; // 0x949(0x01)
	char pad_94A[0x2]; // 0x94a(0x02)
	int32_t SoftHeightLimit; // 0x94c(0x04)
	int32_t DistanceToGround; // 0x950(0x04)
	char pad_954[0x4]; // 0x954(0x04)
	struct TArray<struct FWeightTransferRelationship> DirectWeightRelationships; // 0x958(0x10)
	struct TArray<struct FWeightTransferRelationship> IndirectWeightDistributed; // 0x968(0x10)
	struct TArray<struct FWeightTransferRelationship> IndirectWeightReceived; // 0x978(0x10)
	struct FTimerHandle WeightUnstableTimer; // 0x988(0x08)
	struct FTimerHandle WeightUnstableActiveDestruction; // 0x990(0x08)
	float CrackSizeDivisor; // 0x998(0x04)
	enum class EBuildingOpenableState OpenableState; // 0x99c(0x01)
	char pad_99D[0x3]; // 0x99d(0x03)
	struct FMulticastInlineDelegate OpenableStateChanged; // 0x9a0(0x10)
	bool ManualWindDamagePeriod; // 0x9b0(0x01)
	char pad_9B1[0x3]; // 0x9b1(0x03)
	float CurrentWindDamageTimerTime; // 0x9b4(0x04)
	struct UCurveFloat* StormToBuildingInteractionCurve; // 0x9b8(0x08)
	float BaseWindDamagePointRadius; // 0x9c0(0x04)
	float BaseWindDamagePointImpusle; // 0x9c4(0x04)
	bool RecentlyRepaired; // 0x9c8(0x01)
	bool IsAsyncResettingDM; // 0x9c9(0x01)
	char pad_9CA[0x6]; // 0x9ca(0x06)
	struct UCurveFloat* HealthToDestructionPointCount; // 0x9d0(0x08)
	struct UCurveFloat* HealthToDestructionImpulseStrength; // 0x9d8(0x08)
	int32_t EffectiveDestructionPointCount; // 0x9e0(0x04)
	bool UseDMmaterialMap; // 0x9e4(0x01)
	char pad_9E5[0x3]; // 0x9e5(0x03)
	struct TArray<int32_t> DestructibleMaterialSlotsMappedToMainMesh; // 0x9e8(0x10)
	struct UFMODEvent* FMODEvent_SnowCleared; // 0x9f8(0x08)
	bool ReceivingUnzip; // 0xa00(0x01)
	char pad_A01[0x7]; // 0xa01(0x07)
	struct FTimerHandle DelayedDirtyTimer; // 0xa08(0x08)
	int32_t FromDatabaseHealthPercentage; // 0xa10(0x04)
	float SnowConstant; // 0xa14(0x04)
	bool HasAreaLoadedOnce; // 0xa18(0x01)
	bool IsInCave; // 0xa19(0x01)

	float GetOcclusionValue(); // Function BP_Building_Base.BP_Building_Base_C.GetOcclusionValue // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1be0000
	void SetIsInCave(bool InCave); // Function BP_Building_Base.BP_Building_Base_C.SetIsInCave // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void TraceForCave(); // Function BP_Building_Base.BP_Building_Base_C.TraceForCave // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	bool IsBuildingDestroyed(); // Function BP_Building_Base.BP_Building_Base_C.IsBuildingDestroyed // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
	struct ABuildingGridBase* GetParentGrid(); // Function BP_Building_Base.BP_Building_Base_C.GetParentGrid // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
