// BlueprintGeneratedClass BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C
// Size: 0xb18 (Inherited: 0x8b8)
#include "Icarus_classes.h"
#include "Icarus_struct.h"
#include "Engine_classes.h"
#include "Engine_struct.h"
#include "IcarusGenerated_struct.h"
#include "../../UnrealEngineModLoader/UE4/Ue4.hpp"
struct ABP_IcarusPlayerControllerSurvival_C : AIcarusPlayerControllerSurvival {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x8b8(0x08)
	struct UBP_NetworkProxyComponentSurvival_C* BP_NetworkProxyComponent; // 0x8c0(0x08)
	struct UBP_HuntingManager_C* BP_HuntingManager; // 0x8c8(0x08)
	struct UBP_CriticalHitComponent_C* BP_CriticalHitComponent; // 0x8d0(0x08)
	struct UUMG_UserInterface_C* UserInterface; // 0x8d8(0x08)
	struct UInventory* EnvirosuitInventoryReference; // 0x8e0(0x08)
	struct UInventory* BackpackInventoryReference; // 0x8e8(0x08)
	struct UInventory* QuickbarInventoryReference; // 0x8f0(0x08)
	bool FocusedOnObject; // 0x8f8(0x01)
	char pad_8F9[0x7]; // 0x8f9(0x07)
	struct UInventory* EquipmentInventoryReference; // 0x900(0x08)
	int32_t CurrentSessionEndTime; // 0x908(0x04)
	char pad_90C[0x4]; // 0x90c(0x04)
	// struct FMulticastInlineDelegate ChatMessageArrived; // 0x910(0x10)
	// struct FMulticastInlineDelegate LocalMessageArrived; // 0x920(0x10)
	float CharacterProgressionUpdateDelay; // 0x930(0x04)
	char pad_934[0x4]; // 0x934(0x04)
	struct UInventory* UpgradeInventoryRef; // 0x938(0x08)
	struct UInventory* VisionInventoryRef; // 0x940(0x08)
	int32_t LastFocusedHotbarSlot; // 0x948(0x04)
	char pad_94C[0x4]; // 0x94c(0x04)
	struct ABP_SpectatorActor_C* SpectatorActor; // 0x950(0x08)
	float DBNOHoldLength; // 0x958(0x04)
	float DBNOHoldTimestamp; // 0x95c(0x04)
	struct FCharacterLoadout LastLoadout; // 0x960(0x138)
	// struct FVector LastCameraLocation; // 0xa98(0x0c)
	bool DebugCameraLocationChanges; // 0xaa4(0x01)
	char pad_AA5[0x3]; // 0xaa5(0x03)
	// struct FMulticastInlineDelegate OnRevived; // 0xaa8(0x10)
	float OutOfBoundsTimestamp; // 0xab8(0x04)
	float OutOfBoundsMaxTime; // 0xabc(0x04)
	struct FTimerHandle OutOfBoundsTimerHandle; // 0xac0(0x08)
	bool IsRunningUnStuckEQS; // 0xac8(0x01)
	char pad_AC9[0x7]; // 0xac9(0x07)
	struct FTimerHandle HeatmapBoundsTimer; // 0xad0(0x08)
	// struct FMulticastInlineDelegate ServerMessage; // 0xad8(0x10)
	struct FModifierStatesRowHandle SoloRespawnModifier; // 0xae8(0x18)
	float SoloRespawnBuffLength; // 0xb00(0x04)
	int32_t SoloRespawnBuffUID; // 0xb04(0x04)
	struct FTimerHandle InventoryFullMessageCooldown; // 0xb08(0x08)
	struct ABP_PhotoCamera_C* PhotoCamera; // 0xb10(0x08)

	void GetUserInterface(struct UUMG_UserInterface_Base_C*& UserInterface); // Function BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C.GetUserInterface // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const) // @ game+0x1be0000
	void ActivateHotbarSlot(int32_t NewSelection, bool bForce, bool bQuickCraft); // Function BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C.ActivateHotbarSlot // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	struct FIcarusPlayerChatMessage ProcessChatMessage(struct AIcarusPlayerState* FromPlayer, struct FString Message); // Function BP_IcarusPlayerControllerSurvival.BP_IcarusPlayerControllerSurvival_C.ProcessChatMessage // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
