// AnimBlueprintGeneratedClass CHA_3RD_MAL_01_AnimBP.CHA_3RD_MAL_01_AnimBP_C
// Size: 0xb080 (Inherited: 0x2e0)
struct UCHA_3RD_MAL_01_AnimBP_C : UIcarusCharacterAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2e0(0x08)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_4; // 0x2e8(0x38)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x320(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x348(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x4a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x4c8(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x4f0(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x5c0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x5e8(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x6b0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x770(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x798(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x7c0(0x158)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x918(0xd0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x9e8(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_24; // 0xa88(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0xad8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xb78(0x28)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_3; // 0xba0(0x38)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0xbd8(0x20)
	char pad_BF8[0x8]; // 0xbf8(0x08)
	struct FAnimNode_LookAt AnimGraphNode_LookAt; // 0xc00(0x1b0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0xdb0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0xe50(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xe70(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xfc8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xff0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x1018(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x10d8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1198(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x11c0(0x28)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig_3; // 0x11e8(0x368)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1550(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1578(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x15a0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x1660(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x17b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x17e0(0x28)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator_2; // 0x1808(0xf0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x18f8(0xd0)
	struct FAnimNode_Root AnimGraphNode_Root_6; // 0x19c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x19f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x1a20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x1a48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x1a70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x1a98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x1ac0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x1ae8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x1b10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x1b38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x1b60(0x28)
	struct FAnimNode_BankWarp AnimGraphNode_BankWarp_2; // 0x1b88(0xa0)
	struct FAnimNode_AccelerationWarp AnimGraphNode_AccelerationWarp_2; // 0x1c28(0x70)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0x1c98(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0x1cb8(0x20)
	char pad_1CD8[0x8]; // 0x1cd8(0x08)
	struct FAnimNode_StrideWarp AnimGraphNode_StrideWarp_6; // 0x1ce0(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1e70(0x80)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_13; // 0x1ef0(0x90)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x1f80(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x1fb0(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x1fd8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x1ff8(0x20)
	char pad_2018[0x8]; // 0x2018(0x08)
	struct FAnimNode_StrideWarp AnimGraphNode_StrideWarp_5; // 0x2020(0x190)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_23; // 0x21b0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_22; // 0x2200(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x2250(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x22f0(0xc0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x23b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x23d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x2400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x2428(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2450(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x24d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2500(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x2580(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x25b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x2630(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x2660(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x26e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x2710(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x27c0(0x30)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_12; // 0x27f0(0x90)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_11; // 0x2880(0x90)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_10; // 0x2910(0x90)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x29a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2a20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x2aa0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2b20(0x80)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x2ba0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x2bc0(0x20)
	struct FAnimNode_StrideWarp AnimGraphNode_StrideWarp_4; // 0x2be0(0x190)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_9; // 0x2d70(0x90)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x2e00(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x2eb0(0x30)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_8; // 0x2ee0(0x90)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2f70(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2ff0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x3070(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x30f0(0x80)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_7; // 0x3170(0x90)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_6; // 0x3200(0x90)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x3290(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x32b0(0x20)
	struct FAnimNode_StrideWarp AnimGraphNode_StrideWarp_3; // 0x32d0(0x190)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_5; // 0x3460(0x90)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x34f0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x35a0(0x30)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_4; // 0x35d0(0x90)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_3; // 0x3660(0x90)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp_2; // 0x36f0(0x90)
	struct FAnimNode_BankWarp AnimGraphNode_BankWarp; // 0x3780(0xa0)
	struct FAnimNode_AccelerationWarp AnimGraphNode_AccelerationWarp; // 0x3820(0x70)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x3890(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x38b0(0x20)
	struct FAnimNode_StrideWarp AnimGraphNode_StrideWarp_2; // 0x38d0(0x190)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x3a60(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x3ae0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3b60(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x3be0(0x80)
	struct FAnimNode_OrientationWarp AnimGraphNode_OrientationWarp; // 0x3c60(0x90)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3cf0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x3da0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x3dd0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x3e50(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3ef0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x3f70(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x4010(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x4090(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4110(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x41b0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x41d0(0x20)
	struct FAnimNode_StrideWarp AnimGraphNode_StrideWarp; // 0x41f0(0x190)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x4380(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x43b0(0xb0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_2; // 0x4460(0x38)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x4498(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x4580(0xa0)
	struct FAnimNode_SlopeWarp AnimGraphNode_SlopeWarp; // 0x4620(0x1b0)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x47d0(0xf8)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x48c8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x48e8(0x20)
	struct FAnimNode_Root AnimGraphNode_Root_5; // 0x4908(0x30)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5; // 0x4938(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x49e8(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x4a98(0xb0)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x4b48(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x4bf8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x4cb8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x4e10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x4e38(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x4e60(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x4f68(0x20)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig_2; // 0x4f88(0x368)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x52f0(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x5310(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x5358(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x5460(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x5480(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x5520(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x5540(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x5698(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x56c0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x56e0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x5700(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x5728(0xa0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x57c8(0x70)
	char pad_5838[0x8]; // 0x5838(0x08)
	struct FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x5840(0x440)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x5c80(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x5ca8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x5cc8(0x20)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_21; // 0x5ce8(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x5d38(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x5d68(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x5d88(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x5da8(0x108)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_20; // 0x5eb0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x5f00(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x5f30(0xb0)
	struct FAnimNode_ControlRig AnimGraphNode_ControlRig; // 0x5fe0(0x368)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x6348(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x6370(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x63b8(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x6510(0x158)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4; // 0x6668(0x118)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3; // 0x6780(0x118)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x6898(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x68c0(0xa0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x6960(0x38)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x6998(0xd0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19; // 0x6a68(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x6ab8(0x50)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x6b08(0x158)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x6c60(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x6ca8(0x48)
	struct FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x6cf0(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x6da0(0x108)
	struct FAnimNode_Root AnimGraphNode_Root_4; // 0x6ea8(0x30)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x6ed8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x6ef8(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x6f18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x6f40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x6f68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x6f90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x6fb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x6fe0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x7008(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x7030(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x7058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x7080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x70a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x70d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x70f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x7120(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x7148(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x7170(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x7198(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x71c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x71e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x7210(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x7238(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x7268(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x7308(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x7338(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x7368(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x73b8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x73e8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x7498(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x74c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x74f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x7518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x7540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x7568(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x7590(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x7678(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x7718(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x7800(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x7830(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x78f8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x7948(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x7998(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x7a38(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x7a88(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x7b28(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x7bc8(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x7c90(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x7ce0(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x7d30(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x7df8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x7e48(0x50)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x7e98(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x7f38(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x7fd8(0x50)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x8028(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x80f0(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x8140(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x8190(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x81c0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x82a8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x82d8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x8388(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x83b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x8438(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x8468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x8490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x84b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x84e0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x8508(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x85c8(0x48)
	struct FAnimNode_BlendSpaceEvaluator AnimGraphNode_BlendSpaceEvaluator; // 0x8610(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x8700(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x8730(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x8818(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x8848(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x88e8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x89b0(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x8a78(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x8ac8(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x8b18(0x50)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x8b68(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x8bb8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x8be8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x8cd0(0x30)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x8d00(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x8dc0(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x8e08(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x8e88(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x8eb8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x8f68(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x8f98(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x9080(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x9140(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x91c0(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x91f0(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x9240(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x9270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x9298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x92c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x92e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x9310(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x9338(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x9360(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9388(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x93b0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9498(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x94c8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x9590(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x9658(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x96f8(0x30)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x9728(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x9758(0x50)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x97a8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x97d8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x9888(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x98b8(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root_3; // 0x9968(0x30)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2; // 0x9998(0x118)
	struct FAnimNode_Root AnimGraphNode_Root_2; // 0x9ab0(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x9ae0(0x48)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x9b28(0x118)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x9c40(0x108)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x9d48(0x30)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x9d78(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x9d98(0x20)
	char pad_9DB8[0x8]; // 0x9db8(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x9dc0(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x9f50(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xa010(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xa168(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xa2c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xa2e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xa310(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xa338(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xa360(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xa400(0x158)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xa558(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xa578(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xa5a0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xa5c8(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xa688(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xa6a8(0xa0)
	bool __CustomProperty_AddArms_7667C348430AC508E2F6A29487FE43D7; // 0xa748(0x01)
	char pad_A749[0x3]; // 0xa749(0x03)
	float __CustomProperty_SpineBlend_7667C348430AC508E2F6A29487FE43D7; // 0xa74c(0x04)
	struct FTransform __CustomProperty_RelativeBackpackTransform_1619509E456A952A8EEDB39B8043559E; // 0xa750(0x30)
	float __CustomProperty_SpineBlend_965CFA8D48FCE926D6EC1FA6F6360D47; // 0xa780(0x04)
	float Speed; // 0xa784(0x04)
	float Direction; // 0xa788(0x04)
	char pad_A78C[0x4]; // 0xa78c(0x04)
	struct ABP_IcarusPlayerCharacterSurvival_C* CharacterRef; // 0xa790(0x08)
	bool IsCrouched; // 0xa798(0x01)
	bool IsJumping; // 0xa799(0x01)
	bool IsGrounded; // 0xa79a(0x01)
	bool RequestedJump; // 0xa79b(0x01)
	bool IsFalling; // 0xa79c(0x01)
	char pad_A79D[0x3]; // 0xa79d(0x03)
	float AimPitch; // 0xa7a0(0x04)
	float DrawStrength; // 0xa7a4(0x04)
	float AimYaw; // 0xa7a8(0x04)
	bool IsADS; // 0xa7ac(0x01)
	enum class EAnimOverlayState OverlayState; // 0xa7ad(0x01)
	bool IsReloading; // 0xa7ae(0x01)
	bool RecentlyFiredArrow; // 0xa7af(0x01)
	bool IsFiring; // 0xa7b0(0x01)
	bool ArrowKnocked; // 0xa7b1(0x01)
	char pad_A7B2[0x6]; // 0xa7b2(0x06)
	struct TSoftObjectPtr<UBlendSpace> ItemLocoBS_TP; // 0xa7b8(0x28)
	float SmoothSpeed; // 0xa7e0(0x04)
	bool IsThirdPerson; // 0xa7e4(0x01)
	char pad_A7E5[0x3]; // 0xa7e5(0x03)
	struct FVector CurrentVelocity; // 0xa7e8(0x0c)
	float DeltaSeconds; // 0xa7f4(0x04)
	struct FRotator PreviousRotation; // 0xa7f8(0x0c)
	float YawRotationRate; // 0xa804(0x04)
	struct UBP_ActionableBehaviour_Throwable_C* ThrowableRef; // 0xa808(0x08)
	float ThrowStrength; // 0xa810(0x04)
	bool IsSwimming; // 0xa814(0x01)
	char pad_A815[0x3]; // 0xa815(0x03)
	float CapsuleHalfHeight; // 0xa818(0x04)
	float UpperBodyLocoAdditiveStrength; // 0xa81c(0x04)
	struct FFocusableData CachedFocusedData; // 0xa820(0x1f0)
	struct TArray<struct UObject*> StoredFocusableAnims; // 0xaa10(0x10)
	struct FFirearm3PAnimData AnimData; // 0xaa20(0x158)
	bool HasAmmo; // 0xab78(0x01)
	bool FirearmFiring; // 0xab79(0x01)
	bool UsingLadder; // 0xab7a(0x01)
	char pad_AB7B[0x1]; // 0xab7b(0x01)
	struct FRotator LadderRotation; // 0xab7c(0x0c)
	bool IsCasting; // 0xab88(0x01)
	bool Casted; // 0xab89(0x01)
	bool Reeling; // 0xab8a(0x01)
	char pad_AB8B[0x1]; // 0xab8b(0x01)
	float LocomotionPlayRate; // 0xab8c(0x04)
	float RelativeDirection; // 0xab90(0x04)
	enum class CardinalDirection CardinalDirection; // 0xab94(0x01)
	char pad_AB95[0x3]; // 0xab95(0x03)
	float JogDirectionBlendTime; // 0xab98(0x04)
	float StrideScale; // 0xab9c(0x04)
	float StrideTwist; // 0xaba0(0x04)
	float AccelerationLean; // 0xaba4(0x04)
	float StrideBank; // 0xaba8(0x04)
	bool Accelerating; // 0xabac(0x01)
	char pad_ABAD[0x3]; // 0xabad(0x03)
	float CrouchWalkDirectionBlendTime; // 0xabb0(0x04)
	struct FRotator LastRotation; // 0xabb4(0x0c)
	float AccelLeanDelta; // 0xabc0(0x04)
	char pad_ABC4[0xc]; // 0xabc4(0x0c)
	struct FTransform PlayerLocationCache; // 0xabd0(0x30)
	float LadderPosition; // 0xac00(0x04)
	bool OldLadder; // 0xac04(0x01)
	bool SpearThrown; // 0xac05(0x01)
	char pad_AC06[0x2]; // 0xac06(0x02)
	struct FVector SlopeLocation; // 0xac08(0x0c)
	struct FVector SlopeNormal; // 0xac14(0x0c)
	bool UseOverlayIdle; // 0xac20(0x01)
	char pad_AC21[0x3]; // 0xac21(0x03)
	float AttackMontagePosition; // 0xac24(0x04)
	bool WantsToThrow; // 0xac28(0x01)
	char pad_AC29[0x3]; // 0xac29(0x03)
	float AutoPitchSlotWeight; // 0xac2c(0x04)
	bool EnableFullBodyActionMontage; // 0xac30(0x01)
	char pad_AC31[0x3]; // 0xac31(0x03)
	float HitReactionYaw; // 0xac34(0x04)
	float HitReactionWeight; // 0xac38(0x04)
	char pad_AC3C[0x4]; // 0xac3c(0x04)
	struct UAnimSequence* HitFAnimSequence; // 0xac40(0x08)
	struct UBlendSpaceBase* HitReactionAimOffset; // 0xac48(0x08)
	float HitReactionPosition; // 0xac50(0x04)
	char pad_AC54[0x4]; // 0xac54(0x04)
	struct UAnimSequence* CorpseCarryAnim; // 0xac58(0x08)
	struct FTransform ItemAttachOffset; // 0xac60(0x30)
	float LandedTimeStamp; // 0xac90(0x04)
	char pad_AC94[0x4]; // 0xac94(0x04)
	struct FItemAnimationData CachedItemAnimData; // 0xac98(0x360)
	float HideLegs; // 0xaff8(0x04)
	float SpineBendAlpha; // 0xaffc(0x04)
	struct UAnimSequenceBase* SpearCrouchAim; // 0xb000(0x08)
	struct UAnimSequenceBase* SpearCrouchAimDraw; // 0xb008(0x08)
	struct UAnimSequenceBase* SpearAim; // 0xb010(0x08)
	struct UAnimSequenceBase* SpearAimDraw; // 0xb018(0x08)
	bool Apply Automatic Spine Bend; // 0xb020(0x01)
	char pad_B021[0x3]; // 0xb021(0x03)
	struct FName AttachOffsetSocket; // 0xb024(0x08)
	struct FVector GripSocketLocation; // 0xb02c(0x0c)
	struct FRotator GripSocketRotation; // 0xb038(0x0c)
	float IKAlpha; // 0xb044(0x04)
	float IKAlpha_New; // 0xb048(0x04)
	bool ApplyLeftShoulderRotationWhileIdle; // 0xb04c(0x01)
	char pad_B04D[0x3]; // 0xb04d(0x03)
	struct FTransform BackpackAttachmentRelativeOffset; // 0xb050(0x30)

	void VehicleLowerBody(struct FPoseLink LowerInPose, struct FPoseLink& VehicleLowerBody); // Function CHA_3RD_MAL_01_AnimBP.CHA_3RD_MAL_01_AnimBP_C.VehicleLowerBody // (HasOutParms|BlueprintCallable) // @ game+0x1be0000
	void VehicleUpperBody(struct FPoseLink UpperInPose, struct FPoseLink& VehicleUpperBody); // Function CHA_3RD_MAL_01_AnimBP.CHA_3RD_MAL_01_AnimBP_C.VehicleUpperBody // (HasOutParms|BlueprintCallable) // @ game+0x1be0000
	void OverlayLayer(struct FPoseLink& OverlayLayer); // Function CHA_3RD_MAL_01_AnimBP.CHA_3RD_MAL_01_AnimBP_C.OverlayLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void BlendLayer(struct FPoseLink BaseLayer, struct FPoseLink OverlayLayer, struct FPoseLink& BlendLayer); // Function CHA_3RD_MAL_01_AnimBP.CHA_3RD_MAL_01_AnimBP_C.BlendLayer // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
