// Class Icarus.AccoladeImpl
// Size: 0x28 (Inherited: 0x28)
#include "Icarus_struct.h"
#include "Engine_classes.h"
#include "Engine_struct.h"
#include "IcarusGenerated_struct.h"
#include "../../UnrealEngineModLoader/UE4/Ue4.hpp"
#include "../../UnrealEngineModLoader/UE4/CoreUObject_structs.hpp"
#include "../../UnrealEngineModLoader/UnrealEngineModLoader/GameInfo/GameInfo.h"
#include "../../UnrealEngineModLoader/UnrealEngineModLoader/Memory/mem.h"
struct UAccoladeImpl : UE4::UObject {

	bool RunAccolade(struct UWorld* WorldContext, struct FAccoladesRowHandle Accolade, int32_t& OutProgress); // Function Icarus.AccoladeImpl.RunAccolade // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1608960
};

// Class Icarus.AccoladesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAccoladesLibrary : UE4::URowLibrary {

	struct FAccoladesRowHandle StructToRowHandle(struct FAccoladesEnum EnumValue); // Function Icarus.AccoladesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1608d50
	struct UE4::FName StructToName(struct FAccoladesEnum EnumValue); // Function Icarus.AccoladesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1608c10
	int32_t StructToInt(struct FAccoladesEnum EnumValue); // Function Icarus.AccoladesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1608ad0
	struct FAccoladesEnum RowHandleToStruct(struct FAccoladesRowHandle RowHandle); // Function Icarus.AccoladesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16087e0
	void RemoveRowFromAccoladesTable(struct UE4::FName Name); // Function Icarus.AccoladesLibrary.RemoveRowFromAccoladesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16086e0
	void RefreshConstants(); // Function Icarus.AccoladesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16086a0
	int32_t NumRows(); // Function Icarus.AccoladesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607dd0
	bool NotEqual_EnumName(struct FAccoladesEnum A, struct UE4::FName B); // Function Icarus.AccoladesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607bf0
	bool NotEqual_EnumEnum(struct FAccoladesEnum A, struct FAccoladesEnum B); // Function Icarus.AccoladesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607a10
	struct FAccoladesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AccoladesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607870
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AccoladesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1607750
	struct FAccoladesRowHandle MakeLiteralAccolades(struct FAccoladesRowHandle RowHandle); // Function Icarus.AccoladesLibrary.MakeLiteralAccolades // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607530
	struct FAccoladesRowHandle MakeAccoladesFromIndex(int32_t Index); // Function Icarus.AccoladesLibrary.MakeAccoladesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16072f0
	struct FAccoladesEnum MakeAccoladesEnum(struct FAccoladesEnum Enum); // Function Icarus.AccoladesLibrary.MakeAccoladesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607270
	struct FAccoladesRowHandle MakeAccolades(struct UE4::FName RowName); // Function Icarus.AccoladesLibrary.MakeAccolades // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16071d0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AccoladesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16070b0
	struct FAccoladesEnum IntToStruct(int32_t IntValue); // Function Icarus.AccoladesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1606df0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AccoladesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1606cd0
	void GetAccoladesStruct(struct FAccoladesRowHandle RowHandle, struct FAccoladeData& Accolades, enum class EValid& Paths); // Function Icarus.AccoladesLibrary.GetAccoladesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1606300
	bool EqualEqual_FAccoladesRowHandleFAccoladesRowHandle(struct FAccoladesRowHandle RowHandleA, struct FAccoladesRowHandle RowHandleB); // Function Icarus.AccoladesLibrary.EqualEqual_FAccoladesRowHandleFAccoladesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1605ec0
	bool EqualEqual_EnumEnum(struct FAccoladesEnum A, struct FAccoladesEnum B); // Function Icarus.AccoladesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1605ce0
	struct FAccoladesRowHandle CastToAccoladesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AccoladesLibrary.CastToAccoladesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16058f0
	void BreakAccoladesEnum(struct FAccoladesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AccoladesLibrary.BreakAccoladesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16055b0
	void AddRowToAccoladesTable(struct UE4::FName Name, struct FAccoladeData Data, struct FAccoladesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AccoladesLibrary.AddRowToAccoladesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16050d0
};

// Class Icarus.AccoladesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAccoladesTable : UIcarusDataTable {
};

// Class Icarus.AccoladeSubsystem
// Size: 0xb8 (Inherited: 0x30)
struct UAccoladeSubsystem : UWorldSubsystem {
	struct FMulticastInlineDelegate OnAccoladeCompleted; // 0x30(0x10)
	struct FMulticastInlineDelegate OnAccoladeUpdated; // 0x40(0x10)
	struct TArray<struct FAccoladeCompletedState> CompletedAccolades; // 0x50(0x10)
	char pad_60[0x58]; // 0x60(0x58)

	void PostPlayerTrackerInitialized(); // Function Icarus.AccoladeSubsystem.PostPlayerTrackerInitialized // (Final|Native|Public) // @ game+0x1608680
	void OnTrackerUpdated(struct FPlayerTrackersRowHandle Tracker, int32_t OldValue, int32_t NewValue); // Function Icarus.AccoladeSubsystem.OnTrackerUpdated // (Final|Native|Public) // @ game+0x1608390
	void OnTalentUpdated(struct AIcarusPlayerCharacter* Player); // Function Icarus.AccoladeSubsystem.OnTalentUpdated // (Final|Native|Public) // @ game+0x1608300
	bool IsAccoladeCompleted(struct FAccoladesRowHandle& AccoladeRow); // Function Icarus.AccoladeSubsystem.IsAccoladeCompleted // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1606f10
	struct TArray<struct FAccoladesRowHandle> GetSortedIncompleteAccolades(); // Function Icarus.AccoladeSubsystem.GetSortedIncompleteAccolades // (Final|Native|Public|BlueprintCallable) // @ game+0x1606ab0
	struct TArray<struct FAccoladeCompletedState> GetCompletedAccoladesWithProspectID(struct FString ProspectID); // Function Icarus.AccoladeSubsystem.GetCompletedAccoladesWithProspectID // (Final|Native|Public|BlueprintCallable) // @ game+0x1606840
	struct TArray<struct FAccoladeCompletedState> GetCompletedAccolades(); // Function Icarus.AccoladeSubsystem.GetCompletedAccolades // (Final|Native|Public|BlueprintCallable) // @ game+0x1606720
	bool GetAccoladeProgress(struct FAccoladesRowHandle& AccoladeRow, int32_t& CurrentValue, int32_t& MaxValue, struct FDateTime& TimeCompleted); // Function Icarus.AccoladeSubsystem.GetAccoladeProgress // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1606140
	bool DeleteAccoladeSave(struct FPlayerCharacterID& PlayerCharacterID); // Function Icarus.AccoladeSubsystem.DeleteAccoladeSave // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1605c20
	void CheckAgainstCompletedAccolades(); // Function Icarus.AccoladeSubsystem.CheckAgainstCompletedAccolades // (Final|Native|Public) // @ game+0x1605b30
};

// Class Icarus.AccountFlagsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAccountFlagsLibrary : URowLibrary {

	struct FAccountFlagsRowHandle StructToRowHandle(struct FAccountFlagsEnum EnumValue); // Function Icarus.AccountFlagsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1608e00
	struct UE4::FName StructToName(struct FAccountFlagsEnum EnumValue); // Function Icarus.AccountFlagsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1608cb0
	int32_t StructToInt(struct FAccountFlagsEnum EnumValue); // Function Icarus.AccountFlagsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1608b70
	struct FAccountFlagsEnum RowHandleToStruct(struct FAccountFlagsRowHandle RowHandle); // Function Icarus.AccountFlagsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16088a0
	void RemoveRowFromAccountFlagsTable(struct UE4::FName Name); // Function Icarus.AccountFlagsLibrary.RemoveRowFromAccountFlagsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1608760
	void RefreshConstants(); // Function Icarus.AccountFlagsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16086c0
	int32_t NumRows(); // Function Icarus.AccountFlagsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607e00
	bool NotEqual_EnumName(struct FAccountFlagsEnum A, struct UE4::FName B); // Function Icarus.AccountFlagsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607ce0
	bool NotEqual_EnumEnum(struct FAccountFlagsEnum A, struct FAccountFlagsEnum B); // Function Icarus.AccountFlagsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607b00
	struct FAccountFlagsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AccountFlagsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607900
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AccountFlagsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16077e0
	struct FAccountFlagsRowHandle MakeLiteralAccountFlags(struct FAccountFlagsRowHandle RowHandle); // Function Icarus.AccountFlagsLibrary.MakeLiteralAccountFlags // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607600
	struct FAccountFlagsRowHandle MakeAccountFlagsFromIndex(int32_t Index); // Function Icarus.AccountFlagsLibrary.MakeAccountFlagsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16074a0
	struct FAccountFlagsEnum MakeAccountFlagsEnum(struct FAccountFlagsEnum Enum); // Function Icarus.AccountFlagsLibrary.MakeAccountFlagsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607420
	struct FAccountFlagsRowHandle MakeAccountFlags(struct UE4::FName RowName); // Function Icarus.AccountFlagsLibrary.MakeAccountFlags // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1607380
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AccountFlagsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1607140
	struct FAccountFlagsEnum IntToStruct(int32_t IntValue); // Function Icarus.AccountFlagsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1606e80
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AccountFlagsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1606d60
	void GetAccountFlagsStruct(struct FAccountFlagsRowHandle RowHandle, struct FAccountFlag& AccountFlags, enum class EValid& Paths); // Function Icarus.AccountFlagsLibrary.GetAccountFlagsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1606480
	bool EqualEqual_FAccountFlagsRowHandleFAccountFlagsRowHandle(struct FAccountFlagsRowHandle RowHandleA, struct FAccountFlagsRowHandle RowHandleB); // Function Icarus.AccountFlagsLibrary.EqualEqual_FAccountFlagsRowHandleFAccountFlagsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1606000
	bool EqualEqual_EnumEnum(struct FAccountFlagsEnum A, struct FAccountFlagsEnum B); // Function Icarus.AccountFlagsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1605dd0
	struct FAccountFlagsRowHandle CastToAccountFlagsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AccountFlagsLibrary.CastToAccountFlagsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1605a10
	void BreakAccountFlagsEnum(struct FAccountFlagsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AccountFlagsLibrary.BreakAccountFlagsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1605710
	void AddRowToAccountFlagsTable(struct UE4::FName Name, struct FAccountFlag Data, struct FAccountFlagsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AccountFlagsLibrary.AddRowToAccountFlagsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1605290
};

// Class Icarus.AccountFlagsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAccountFlagsTable : UIcarusDataTable {
};

// Class Icarus.TraitBehaviour
// Size: 0xc0 (Inherited: 0xb0)
struct UTraitBehaviour : UActorComponent {
	struct UTraitBehaviours* OwningComponent; // 0xb0(0x08)
	bool bBehaviourDelegatesBound; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)

	void OnTraitAnimNotify(struct FAnimNotifyEvent& Notify, struct AActor* AnimInstancePawn); // Function Icarus.TraitBehaviour.OnTraitAnimNotify // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x187c200
	void OnRep_OwningComponent(); // Function Icarus.TraitBehaviour.OnRep_OwningComponent // (Native|Event|Protected|BlueprintEvent) // @ game+0x16450c0
};

// Class Icarus.ActionableBehaviour
// Size: 0x2d0 (Inherited: 0xc0)
struct UActionableBehaviour : UTraitBehaviour {
	struct TArray<enum class EActionableEventType> ActionEventTypes; // 0xc0(0x10)
	struct FActionsRowHandle ActionRowHandle; // 0xd0(0x18)
	struct TMap<enum class EActionableEventType, struct FStaminaActionCostsRowHandle> StaminaCosts; // 0xe8(0x50)
	struct TArray<struct FActionStaminaCostEventPairing> ReplicatedStaminaCosts; // 0x138(0x10)
	struct FMulticastInlineDelegate OnCooldownElapsed; // 0x148(0x10)
	struct FModifierStatesRowHandle ModifierRowHandle; // 0x158(0x18)
	char pad_170[0x50]; // 0x170(0x50)
	struct UCharacterState* OwnerActorState; // 0x1c0(0x08)
	struct AActor* OwnerActor; // 0x1c8(0x08)
	char pad_1D0[0xf8]; // 0x1d0(0xf8)
	struct UIcarusAnimInstance* AnimatingMeshAnimInstance; // 0x2c8(0x08)

	void PerformActionFromMenu(struct AActor* InvokingActor); // Function Icarus.ActionableBehaviour.PerformActionFromMenu // (Event|Public|BlueprintEvent) // @ game+0x1be0000
	void PerformAction(struct AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.PerformAction // (Native|Event|Public|BlueprintEvent) // @ game+0x1608570
	void OnUsedFromMenu(struct AActor* InvokingActor); // Function Icarus.ActionableBehaviour.OnUsedFromMenu // (Final|Native|Public) // @ game+0x16084e0
	void OnRep_ReplicatedStaminaCosts(); // Function Icarus.ActionableBehaviour.OnRep_ReplicatedStaminaCosts // (Final|Native|Public) // @ game+0x16082e0
	void OnActionNotify(struct UE4::FName NotifyName); // Function Icarus.ActionableBehaviour.OnActionNotify // (Final|Native|Private) // @ game+0x1608250
	void OnActionInsufficientStamina(enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.OnActionInsufficientStamina // (Native|Event|Public|BlueprintEvent) // @ game+0x16081d0
	void OnActionInsufficientDurability(enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.OnActionInsufficientDurability // (Native|Event|Public|BlueprintEvent) // @ game+0x1608150
	void OnActionHit(struct AActor* InvokingActor, struct UPrimitiveComponent* OverlappedComponent, struct FHitResult& SweepResult); // Function Icarus.ActionableBehaviour.OnActionHit // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1607fc0
	void OnActionAborted(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.OnActionAborted // (Native|Event|Public|BlueprintEvent) // @ game+0x1607f40
	void OnAction(struct AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.OnAction // (Final|Native|Public) // @ game+0x1607e30
	void NetMulti_OnActionInsufficientStamina(enum class EActionableTrigger ActionTrigger); // Function Icarus.ActionableBehaviour.NetMulti_OnActionInsufficientStamina // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1607990
	void Multicast_NotifyCurrentActionAborted(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.Multicast_NotifyCurrentActionAborted // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x16076d0
	bool IsActionAborted(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.IsActionAborted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1606fc0
	bool HasCooldownElapsed(enum class EActionableEventType ActionType); // Function Icarus.ActionableBehaviour.HasCooldownElapsed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1606c40
	struct FStaminaCost GetStaminaCostForEventType(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.GetStaminaCostForEventType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1606b30
	struct TArray<struct FRowHandle> GetGenericData(); // Function Icarus.ActionableBehaviour.GetGenericData // (Final|Native|Public|BlueprintCallable) // @ game+0x1606a30
	float GetCooldownSpeedMultiplier(); // Function Icarus.ActionableBehaviour.GetCooldownSpeedMultiplier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1606a00
	float GetCooldownDuration(); // Function Icarus.ActionableBehaviour.GetCooldownDuration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16069d0
	struct USkeletalMeshComponent* GetAnimatingMesh(); // Function Icarus.ActionableBehaviour.GetAnimatingMesh // (Native|Event|Public|BlueprintEvent) // @ game+0x16066f0
	bool GetActionData(struct FActionData& OutData); // Function Icarus.ActionableBehaviour.GetActionData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1606600
	struct UActionableComponent* GetActionableComponent(); // Function Icarus.ActionableBehaviour.GetActionableComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16066c0
	void CheckCurrentActionAborted(struct UActorState* ActorStateIn, int32_t UID); // Function Icarus.ActionableBehaviour.CheckCurrentActionAborted // (Final|Native|Private) // @ game+0x1605b50
	void CancelStaminaActionForEventType(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.CancelStaminaActionForEventType // (Final|Native|Public|BlueprintCallable) // @ game+0x1605870
	bool BP_ShouldApplyEndStaminaCost(enum class EActionableEventType EventType); // Function Icarus.ActionableBehaviour.BP_ShouldApplyEndStaminaCost // (Native|Event|Public|BlueprintEvent) // @ game+0x16054a0
	void BeginActionCooldown(enum class EActionableEventType ActionableEvent); // Function Icarus.ActionableBehaviour.BeginActionCooldown // (Final|Native|Public|BlueprintCallable) // @ game+0x1605530
	void ActionComplete(enum class EActionableEventType ActionType); // Function Icarus.ActionableBehaviour.ActionComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x1605050
	void AbortAction(enum class EActionableEventType EventType, bool bApplyEndActionStaminaCost); // Function Icarus.ActionableBehaviour.AbortAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1604f80
};

// Class Icarus.TraitComponent
// Size: 0xd0 (Inherited: 0xb0)
struct UTraitComponent : UActorComponent {
	struct FMulticastSparseDelegate DynamicDataUpdated; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	struct FRowHandle DataRowHandle; // 0xb4(0x18)
	char pad_CC[0x4]; // 0xcc(0x04)

	void OnRep_DataRowHandle(); // Function Icarus.TraitComponent.OnRep_DataRowHandle // (Final|Native|Protected) // @ game+0x187c380
	void OnDataSet(); // Function Icarus.TraitComponent.OnDataSet // (Native|Event|Protected|BlueprintEvent) // @ game+0x16450c0
	void OnAnimNotify(struct FAnimNotifyEvent& Notify, struct AActor* AnimInstancePawn); // Function Icarus.TraitComponent.OnAnimNotify // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x187c200
	struct UTraitComponent* GetTraitClassFromData(struct FRowHandle ItemDataRow); // Function Icarus.TraitComponent.GetTraitClassFromData // (Native|Public) // @ game+0x187aea0
	struct AIcarusItem* GetOwnerIcarusItem(); // Function Icarus.TraitComponent.GetOwnerIcarusItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x187abd0
	struct AIcarusActor* GetOwnerIcarusActor(); // Function Icarus.TraitComponent.GetOwnerIcarusActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x187aba0
};

// Class Icarus.TraitBehaviours
// Size: 0xe8 (Inherited: 0xd0)
struct UTraitBehaviours : UTraitComponent {
	struct FMulticastSparseDelegate OnTraitAnimNotify; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
	struct TArray<struct UTraitBehaviour*> OwnedBehaviours; // 0xd8(0x10)

	void RegisterBehaviour(struct UTraitBehaviour* Behaviour); // Function Icarus.TraitBehaviours.RegisterBehaviour // (Native|Event|Public|BlueprintEvent) // @ game+0x17fa690
	struct UTraitBehaviour* GetFirstBehaviourOfType(struct UTraitBehaviour* Class); // Function Icarus.TraitBehaviours.GetFirstBehaviourOfType // (Final|Native|Public|BlueprintCallable) // @ game+0x187ab00
	struct TArray<struct UTraitBehaviour*> GetBehaviours(); // Function Icarus.TraitBehaviours.GetBehaviours // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x187aa70
	void CreateBehaviours(); // Function Icarus.TraitBehaviours.CreateBehaviours // (Native|Event|Protected|BlueprintEvent) // @ game+0x1613bb0
	struct UTraitBehaviour* CreateBehaviour(struct UTraitBehaviour* BehaviourClass); // Function Icarus.TraitBehaviours.CreateBehaviour // (Final|Native|Protected|BlueprintCallable) // @ game+0x187a570
};

// Class Icarus.ActionableComponent
// Size: 0x158 (Inherited: 0xe8)
struct UActionableComponent : UTraitBehaviours {
	struct FMulticastSparseDelegate OnAction; // 0xe8(0x01)
	struct FMulticastSparseDelegate OnUsedFromMenu; // 0xe9(0x01)
	struct FMulticastSparseDelegate OnActionHit; // 0xea(0x01)
	struct FMulticastSparseDelegate OnAssociatedItemUpdated; // 0xeb(0x01)
	char pad_EC[0x54]; // 0xec(0x54)
	int32_t AssociatedItemInventoryId; // 0x140(0x04)
	int32_t AssociatedItemInventorySlot; // 0x144(0x04)
	int32_t DynamicState; // 0x148(0x04)
	int32_t GunCurrentMagSize; // 0x14c(0x04)
	int32_t CurrentAmmoType; // 0x150(0x04)
	char pad_154[0x4]; // 0x154(0x04)

	void UseFromMenu(struct AActor* InvokingActor); // Function Icarus.ActionableComponent.UseFromMenu // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x160f0d0
	void SetNewAssociatedItem(int32_t NewAssociatedItemInventoryId, int32_t NewAssocaitedItemSlot); // Function Icarus.ActionableComponent.SetNewAssociatedItem // (Final|Native|Public|BlueprintCallable) // @ game+0x160eb80
	void SetGunCurrentMagSize(int32_t NewGunCurrentMagSize); // Function Icarus.ActionableComponent.SetGunCurrentMagSize // (Final|Native|Public|BlueprintCallable) // @ game+0x160eaa0
	void SetDynamicState(int32_t NewDynamicState); // Function Icarus.ActionableComponent.SetDynamicState // (Final|Native|Public|BlueprintCallable) // @ game+0x160ea10
	void SetCurrentAmmoType(int32_t NewCurrentAmmoType); // Function Icarus.ActionableComponent.SetCurrentAmmoType // (Final|Native|Public|BlueprintCallable) // @ game+0x160e930
	void SetAssociatedItemInventorySlot(int32_t NewAssociatedItemInventorySlot); // Function Icarus.ActionableComponent.SetAssociatedItemInventorySlot // (Final|Native|Public|BlueprintCallable) // @ game+0x160e800
	void SetAssociatedItemInventoryId(int32_t NewAssociatedItemInventoryId); // Function Icarus.ActionableComponent.SetAssociatedItemInventoryId // (Final|Native|Public|BlueprintCallable) // @ game+0x160e6d0
	void Server_OwningClientActionableHitNamed(struct AActor* InvokingActor, struct AActor* OverlappedComponentOwner, struct UE4::FName OverlappedComponentName, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Server_OwningClientActionableHitNamed // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x160e540
	void Server_OwningClientActionableHit(struct AActor* InvokingActor, struct UPrimitiveComponent* OverlappedComponent, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Server_OwningClientActionableHit // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x160e3c0
	void OnRep_CurrentAmmoType(); // Function Icarus.ActionableComponent.OnRep_CurrentAmmoType // (Final|Native|Public) // @ game+0x160e0e0
	void OnHeldTimerExpired(struct AActor* InvokingActor, enum class EActionableEventType ActionType, bool bClientPrediction); // Function Icarus.ActionableComponent.OnHeldTimerExpired // (Final|Native|Public) // @ game+0x160dfc0
	void Multicast_ActionableHitNamed(struct AActor* InvokingActor, struct AActor* OverlappedComponentOwner, struct UE4::FName OverlappedComponentName, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Multicast_ActionableHitNamed // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x160d7d0
	void Multicast_ActionableHit(struct AActor* InvokingActor, struct UPrimitiveComponent* OverlappedComponent, struct FHitResult SweepResult); // Function Icarus.ActionableComponent.Multicast_ActionableHit // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x160d650
	struct UActionableBehaviour* GetBehaviourForActionType(enum class EActionableEventType& EventType); // Function Icarus.ActionableComponent.GetBehaviourForActionType // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x160cd50
	bool GetActionData(struct FActionsRowHandle ActionRowHandle, struct FActionData& OutData); // Function Icarus.ActionableComponent.GetActionData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x160c610
	bool GetActionableData(struct FActionableData& OutData); // Function Icarus.ActionableComponent.GetActionableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x160c7d0
	void Action(struct AActor* InvokingActor, enum class EActionableEventType ActionType, enum class EActionableTrigger ActionTrigger, bool bClientPrediction); // Function Icarus.ActionableComponent.Action // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x160b650
};

// Class Icarus.ActionableLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActionableLibrary : URowLibrary {

	struct FActionableRowHandle StructToRowHandle(struct FActionableEnum EnumValue); // Function Icarus.ActionableLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160ef70
	struct UE4::FName StructToName(struct FActionableEnum EnumValue); // Function Icarus.ActionableLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160ee30
	int32_t StructToInt(struct FActionableEnum EnumValue); // Function Icarus.ActionableLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160ecf0
	struct FActionableEnum RowHandleToStruct(struct FActionableRowHandle RowHandle); // Function Icarus.ActionableLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160e240
	void RemoveRowFromActionableTable(struct UE4::FName Name); // Function Icarus.ActionableLibrary.RemoveRowFromActionableTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x160e140
	void RefreshConstants(); // Function Icarus.ActionableLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x160e100
	int32_t NumRows(); // Function Icarus.ActionableLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160df60
	bool NotEqual_EnumName(struct FActionableEnum A, struct UE4::FName B); // Function Icarus.ActionableLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160dd80
	bool NotEqual_EnumEnum(struct FActionableEnum A, struct FActionableEnum B); // Function Icarus.ActionableLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160dba0
	struct FActionableEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.ActionableLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160da80
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.ActionableLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x160d960
	struct FActionableRowHandle MakeLiteralActionable(struct FActionableRowHandle RowHandle); // Function Icarus.ActionableLibrary.MakeLiteralActionable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d4b0
	struct FActionableRowHandle MakeActionableFromIndex(int32_t Index); // Function Icarus.ActionableLibrary.MakeActionableFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d270
	struct FActionableEnum MakeActionableEnum(struct FActionableEnum Enum); // Function Icarus.ActionableLibrary.MakeActionableEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d1f0
	struct FActionableRowHandle MakeActionable(struct UE4::FName RowName); // Function Icarus.ActionableLibrary.MakeActionable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d150
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.ActionableLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x160d030
	struct FActionableEnum IntToStruct(int32_t IntValue); // Function Icarus.ActionableLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160cf10
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.ActionableLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x160cdf0
	void GetActionableStruct(struct FActionableRowHandle RowHandle, struct FActionableData& Actionable, enum class EValid& Paths); // Function Icarus.ActionableLibrary.GetActionableStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x160c9c0
	bool EqualEqual_FActionableRowHandleFActionableRowHandle(struct FActionableRowHandle RowHandleA, struct FActionableRowHandle RowHandleB); // Function Icarus.ActionableLibrary.EqualEqual_FActionableRowHandleFActionableRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160c390
	bool EqualEqual_EnumEnum(struct FActionableEnum A, struct FActionableEnum B); // Function Icarus.ActionableLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160c1b0
	struct FActionableRowHandle CastToActionableRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.ActionableLibrary.CastToActionableRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x160bf70
	void BreakActionableEnum(struct FActionableEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.ActionableLibrary.BreakActionableEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x160bcb0
	void AddRowToActionableTable(struct UE4::FName Name, struct FActionableData Data, struct FActionableRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.ActionableLibrary.AddRowToActionableTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x160b7a0
};

// Class Icarus.ActionableTable
// Size: 0xb8 (Inherited: 0xb8)
struct UActionableTable : UIcarusDataTable {
};

// Class Icarus.ActionsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActionsLibrary : URowLibrary {

	struct FActionsRowHandle StructToRowHandle(struct FActionsEnum EnumValue); // Function Icarus.ActionsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160f020
	struct UE4::FName StructToName(struct FActionsEnum EnumValue); // Function Icarus.ActionsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160eed0
	int32_t StructToInt(struct FActionsEnum EnumValue); // Function Icarus.ActionsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160ed90
	struct FActionsEnum RowHandleToStruct(struct FActionsRowHandle RowHandle); // Function Icarus.ActionsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160e300
	void RemoveRowFromActionsTable(struct UE4::FName Name); // Function Icarus.ActionsLibrary.RemoveRowFromActionsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x160e1c0
	void RefreshConstants(); // Function Icarus.ActionsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x160e120
	int32_t NumRows(); // Function Icarus.ActionsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160df90
	bool NotEqual_EnumName(struct FActionsEnum A, struct UE4::FName B); // Function Icarus.ActionsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160de70
	bool NotEqual_EnumEnum(struct FActionsEnum A, struct FActionsEnum B); // Function Icarus.ActionsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160dc90
	struct FActionsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.ActionsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160db10
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.ActionsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x160d9f0
	struct FActionsRowHandle MakeLiteralActions(struct FActionsRowHandle RowHandle); // Function Icarus.ActionsLibrary.MakeLiteralActions // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d580
	struct FActionsRowHandle MakeActionsFromIndex(int32_t Index); // Function Icarus.ActionsLibrary.MakeActionsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d420
	struct FActionsEnum MakeActionsEnum(struct FActionsEnum Enum); // Function Icarus.ActionsLibrary.MakeActionsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d3a0
	struct FActionsRowHandle MakeActions(struct UE4::FName RowName); // Function Icarus.ActionsLibrary.MakeActions // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160d300
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.ActionsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x160d0c0
	struct FActionsEnum IntToStruct(int32_t IntValue); // Function Icarus.ActionsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160cfa0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.ActionsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x160ce80
	void GetActionsStruct(struct FActionsRowHandle RowHandle, struct FActionData& Actions, enum class EValid& Paths); // Function Icarus.ActionsLibrary.GetActionsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x160cbd0
	bool EqualEqual_FActionsRowHandleFActionsRowHandle(struct FActionsRowHandle RowHandleA, struct FActionsRowHandle RowHandleB); // Function Icarus.ActionsLibrary.EqualEqual_FActionsRowHandleFActionsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160c4d0
	bool EqualEqual_EnumEnum(struct FActionsEnum A, struct FActionsEnum B); // Function Icarus.ActionsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x160c2a0
	struct FActionsRowHandle CastToActionsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.ActionsLibrary.CastToActionsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x160c090
	void BreakActionsEnum(struct FActionsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.ActionsLibrary.BreakActionsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x160be10
	void AddRowToActionsTable(struct UE4::FName Name, struct FActionData Data, struct FActionsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.ActionsLibrary.AddRowToActionsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x160baf0
};

// Class Icarus.ActionsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UActionsTable : UIcarusDataTable {
};

// Class Icarus.ActorState
// Size: 0x228 (Inherited: 0xb0)
struct UActorState : UActorComponent {
	struct FIcarusDamagePacket LastDamagePacket; // 0xb0(0xc8)
	bool bKeepRecentDamageEvents; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	float RecentDamageLifetime; // 0x17c(0x04)
	struct TArray<struct FIcarusDamagePacket> RecentDamagePackets; // 0x180(0x10)
	char pad_190[0x10]; // 0x190(0x10)
	struct FMulticastInlineDelegate OnActorStateReady; // 0x1a0(0x10)
	struct FMulticastSparseDelegate OnActorDeath; // 0x1b0(0x01)
	struct FMulticastSparseDelegate OnAliveStateChanged; // 0x1b1(0x01)
	struct FMulticastSparseDelegate OnDamaged; // 0x1b2(0x01)
	struct FMulticastSparseDelegate OnHealthUpdated; // 0x1b3(0x01)
	struct FMulticastSparseDelegate OnShelterUpdated; // 0x1b4(0x01)
	struct FMulticastSparseDelegate BiomeUpdated; // 0x1b5(0x01)
	struct FMulticastSparseDelegate OnActorDamaged; // 0x1b6(0x01)
	char pad_1B7[0x1]; // 0x1b7(0x01)
	int32_t Health; // 0x1b8(0x04)
	int32_t MaxHealth; // 0x1bc(0x04)
	float Shelter; // 0x1c0(0x04)
	int32_t ExternalTemperature; // 0x1c4(0x04)
	int32_t ModifiedExternalTemperature; // 0x1c8(0x04)
	int32_t ModifiedInternalTemperature; // 0x1cc(0x04)
	struct FBiomesRowHandle CurrentBiome; // 0x1d0(0x18)
	enum class EAliveState CurrentAliveState; // 0x1e8(0x01)
	char pad_1E9[0x7]; // 0x1e9(0x07)
	struct UIcarusStatContainer* OwnerStatContainer; // 0x1f0(0x08)
	char pad_1F8[0xc]; // 0x1f8(0x0c)
	struct FBiomesRowHandle BiomeOverride; // 0x204(0x18)
	bool BlockBiomeUpdate; // 0x21c(0x01)
	char pad_21D[0x7]; // 0x21d(0x07)
	bool bHasHealthRegen; // 0x224(0x01)
	char pad_225[0x3]; // 0x225(0x03)

	void WeatherTimeTick(float Delta); // Function Icarus.ActorState.WeatherTimeTick // (Final|Native|Private) // @ game+0x1614350
	void TakeDamage(struct FIcarusDamagePacket DamagePacket); // Function Icarus.ActorState.TakeDamage // (Final|Native|Public) // @ game+0x16141a0
	void StatContainerUpdated(); // Function Icarus.ActorState.StatContainerUpdated // (Native|Public) // @ game+0x1613f90
	void SetShelter(float Amount); // Function Icarus.ActorState.SetShelter // (Final|Native|Public|BlueprintCallable) // @ game+0x1613f10
	void SetHealth(int32_t Amount); // Function Icarus.ActorState.SetHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1613e80
	void SetBlockBiomeUpdate(bool bLock); // Function Icarus.ActorState.SetBlockBiomeUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x1613df0
	void SetBiomeOverride(struct FBiomesRowHandle Biome); // Function Icarus.ActorState.SetBiomeOverride // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1613d40
	void SetBiome(struct FBiomesRowHandle Biome); // Function Icarus.ActorState.SetBiome // (Final|Native|Public) // @ game+0x1613c90
	void Respawn(); // Function Icarus.ActorState.Respawn // (Native|Public|BlueprintCallable) // @ game+0x1613bb0
	void RequestClientsideBiomeUpdate(); // Function Icarus.ActorState.RequestClientsideBiomeUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0x1613b90
	void RequestBiomeUpdate(); // Function Icarus.ActorState.RequestBiomeUpdate // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1613b90
	void RegenTick(float DeltaTime); // Function Icarus.ActorState.RegenTick // (Native|Public) // @ game+0x1613a80
	void RecalculateHealthRegenRate(); // Function Icarus.ActorState.RecalculateHealthRegenRate // (Final|Native|Protected) // @ game+0x1613a40
	void RecalculateCurrentHealth(); // Function Icarus.ActorState.RecalculateCurrentHealth // (Final|Native|Protected) // @ game+0x1613a20
	void OnRep_Health(); // Function Icarus.ActorState.OnRep_Health // (Final|Native|Protected) // @ game+0x1613a00
	void OnRep_CurrentBiome(); // Function Icarus.ActorState.OnRep_CurrentBiome // (Final|Native|Protected) // @ game+0x16139e0
	void OnRep_CurrentAliveState(); // Function Icarus.ActorState.OnRep_CurrentAliveState // (Final|Native|Protected) // @ game+0x16139c0
	void OnCurrentBiomeUpdated(struct FBiomesRowHandle& NewBiome); // Function Icarus.ActorState.OnCurrentBiomeUpdated // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1613910
	void Multicast_OnDamaged(int32_t InDamage, struct FDamageEvent DamageEvent, struct AController* Instigator, struct AActor* DamageCauser); // Function Icarus.ActorState.Multicast_OnDamaged // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1613480
	void Kill(); // Function Icarus.ActorState.Kill // (Final|Native|Public|BlueprintCallable) // @ game+0x16131e0
	bool IsAlive(); // Function Icarus.ActorState.IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1613120
	void InternalTick(float DeltaTime); // Function Icarus.ActorState.InternalTick // (Native|Protected) // @ game+0x1613090
	float GetTotalRecentDamage(float Duration); // Function Icarus.ActorState.GetTotalRecentDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1612ed0
	float GetShelter(); // Function Icarus.ActorState.GetShelter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1612ea0
	float GetRecentDamageCausedByController(struct AController* DamageInstigator, float Duration); // Function Icarus.ActorState.GetRecentDamageCausedByController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1612dd0
	float GetRecentDamageCausedByActor(struct AActor* DamageCauser, float Duration); // Function Icarus.ActorState.GetRecentDamageCausedByActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1612d00
	int32_t GetMaxHealth(); // Function Icarus.ActorState.GetMaxHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1612cd0
	int32_t GetHealth(); // Function Icarus.ActorState.GetHealth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1612ca0
	int32_t GetEnvironmentalTemperature(); // Function Icarus.ActorState.GetEnvironmentalTemperature // (Final|Native|Public) // @ game+0x1612c70
	struct FBoxSphereBounds GetBoundsForTemperatureEffect(); // Function Icarus.ActorState.GetBoundsForTemperatureEffect // (Native|Public|HasDefaults|Const) // @ game+0x1612c20
	int32_t ConsumeNextUID(); // Function Icarus.ActorState.ConsumeNextUID // (Final|Native|Public) // @ game+0x1612830
	bool CanRegenerateHealth(); // Function Icarus.ActorState.CanRegenerateHealth // (Native|Public|Const) // @ game+0x16126e0
	void AddHealth(int32_t Amount); // Function Icarus.ActorState.AddHealth // (Final|Native|Public|BlueprintCallable) // @ game+0x1612270
};

// Class Icarus.IcarusStateRecorderComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UIcarusStateRecorderComponent : UActorComponent {
	bool bBeginRecordingImmediately; // 0xb0(0x01)
	bool bRetainOnDestroy; // 0xb1(0x01)
	enum class EStateRecorderOwnerResolvePolicy OwnerResolvePolicy; // 0xb2(0x01)
	char pad_B3[0x1]; // 0xb3(0x01)
	struct UE4::FName ActorClassName; // 0xb4(0x08)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct FString ActorPathName; // 0xc0(0x10)
	bool bIsRecordingGameState; // 0xd0(0x01)
	bool bHasRecordedValidState; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)

	void OnResolvedOwnerEndPlay(struct AActor* ResolvedOwner, enum class EEndPlayReason EndPlayReason); // Function Icarus.IcarusStateRecorderComponent.OnResolvedOwnerEndPlay // (Final|Native|Public) // @ game+0x17705a0
	void EndRecording(); // Function Icarus.IcarusStateRecorderComponent.EndRecording // (Final|Native|Public|BlueprintCallable) // @ game+0x176fcb0
	void BeginRecording(); // Function Icarus.IcarusStateRecorderComponent.BeginRecording // (Final|Native|Public|BlueprintCallable) // @ game+0x176fc70
};

// Class Icarus.ActorStateRecorderComponent
// Size: 0x160 (Inherited: 0xd8)
struct UActorStateRecorderComponent : UIcarusStateRecorderComponent {
	bool bSaveModifiers; // 0xd8(0x01)
	char pad_D9[0x3]; // 0xd9(0x03)
	int32_t ActorStateRecorderVersion; // 0xdc(0x04)
	struct FTransform ActorTransform; // 0xe0(0x30)
	struct TArray<struct FInventorySaveData> SavedInventories; // 0x110(0x10)
	struct FFLODActorComponentSaveData FLODComponentData; // 0x120(0x1c)
	int32_t IcarusActorGUID; // 0x13c(0x04)
	struct UE4::FName ObjectFName; // 0x140(0x08)
	struct TArray<struct FModifierStateSaveData> Modifiers; // 0x148(0x10)
	char pad_158[0x8]; // 0x158(0x08)
};

// Class Icarus.AfflictionChanceLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAfflictionChanceLibrary : URowLibrary {

	struct FAfflictionChanceRowHandle StructToRowHandle(struct FAfflictionChanceEnum EnumValue); // Function Icarus.AfflictionChanceLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16140f0
	struct UE4::FName StructToName(struct FAfflictionChanceEnum EnumValue); // Function Icarus.AfflictionChanceLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1614050
	int32_t StructToInt(struct FAfflictionChanceEnum EnumValue); // Function Icarus.AfflictionChanceLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613fb0
	struct FAfflictionChanceEnum RowHandleToStruct(struct FAfflictionChanceRowHandle RowHandle); // Function Icarus.AfflictionChanceLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613bd0
	void RemoveRowFromAfflictionChanceTable(struct UE4::FName Name); // Function Icarus.AfflictionChanceLibrary.RemoveRowFromAfflictionChanceTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1613b10
	void RefreshConstants(); // Function Icarus.AfflictionChanceLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1613a60
	int32_t NumRows(); // Function Icarus.AfflictionChanceLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16138e0
	bool NotEqual_EnumName(struct FAfflictionChanceEnum A, struct UE4::FName B); // Function Icarus.AfflictionChanceLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16137f0
	bool NotEqual_EnumEnum(struct FAfflictionChanceEnum A, struct FAfflictionChanceEnum B); // Function Icarus.AfflictionChanceLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613700
	struct FAfflictionChanceEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AfflictionChanceLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613670
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AfflictionChanceLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16135e0
	struct FAfflictionChanceRowHandle MakeLiteralAfflictionChance(struct FAfflictionChanceRowHandle RowHandle); // Function Icarus.AfflictionChanceLibrary.MakeLiteralAfflictionChance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16133b0
	struct FAfflictionChanceRowHandle MakeAfflictionChanceFromIndex(int32_t Index); // Function Icarus.AfflictionChanceLibrary.MakeAfflictionChanceFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613320
	struct FAfflictionChanceEnum MakeAfflictionChanceEnum(struct FAfflictionChanceEnum Enum); // Function Icarus.AfflictionChanceLibrary.MakeAfflictionChanceEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16132a0
	struct FAfflictionChanceRowHandle MakeAfflictionChance(struct UE4::FName RowName); // Function Icarus.AfflictionChanceLibrary.MakeAfflictionChance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613200
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AfflictionChanceLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1613150
	struct FAfflictionChanceEnum IntToStruct(int32_t IntValue); // Function Icarus.AfflictionChanceLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1613000
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AfflictionChanceLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1612f70
	void GetAfflictionChanceStruct(struct FAfflictionChanceRowHandle RowHandle, struct FAfflictionChance& AfflictionChance, enum class EValid& Paths); // Function Icarus.AfflictionChanceLibrary.GetAfflictionChanceStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1612a90
	bool EqualEqual_FAfflictionChanceRowHandleFAfflictionChanceRowHandle(struct FAfflictionChanceRowHandle RowHandleA, struct FAfflictionChanceRowHandle RowHandleB); // Function Icarus.AfflictionChanceLibrary.EqualEqual_FAfflictionChanceRowHandleFAfflictionChanceRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1612950
	bool EqualEqual_EnumEnum(struct FAfflictionChanceEnum A, struct FAfflictionChanceEnum B); // Function Icarus.AfflictionChanceLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1612860
	struct FAfflictionChanceRowHandle CastToAfflictionChanceRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AfflictionChanceLibrary.CastToAfflictionChanceRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1612710
	void BreakAfflictionChanceEnum(struct FAfflictionChanceEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AfflictionChanceLibrary.BreakAfflictionChanceEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1612580
	void AddRowToAfflictionChanceTable(struct UE4::FName Name, struct FAfflictionChance Data, struct FAfflictionChanceRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AfflictionChanceLibrary.AddRowToAfflictionChanceTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1612300
};

// Class Icarus.AfflictionChanceTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAfflictionChanceTable : UIcarusDataTable {
};

// Class Icarus.AIAudioDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIAudioDataLibrary : URowLibrary {

	struct FAIAudioDataRowHandle StructToRowHandle(struct FAIAudioDataEnum EnumValue); // Function Icarus.AIAudioDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619b40
	struct UE4::FName StructToName(struct FAIAudioDataEnum EnumValue); // Function Icarus.AIAudioDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619960
	int32_t StructToInt(struct FAIAudioDataEnum EnumValue); // Function Icarus.AIAudioDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619780
	struct FAIAudioDataEnum RowHandleToStruct(struct FAIAudioDataRowHandle RowHandle); // Function Icarus.AIAudioDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619540
	void RemoveRowFromAIAudioDataTable(struct UE4::FName Name); // Function Icarus.AIAudioDataLibrary.RemoveRowFromAIAudioDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16193c0
	void RefreshConstants(); // Function Icarus.AIAudioDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1619360
	int32_t NumRows(); // Function Icarus.AIAudioDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16192d0
	bool NotEqual_EnumName(struct FAIAudioDataEnum A, struct UE4::FName B); // Function Icarus.AIAudioDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619000
	bool NotEqual_EnumEnum(struct FAIAudioDataEnum A, struct FAIAudioDataEnum B); // Function Icarus.AIAudioDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618d30
	struct FAIAudioDataEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AIAudioDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618b80
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AIAudioDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16189d0
	struct FAIAudioDataRowHandle MakeLiteralAIAudioData(struct FAIAudioDataRowHandle RowHandle); // Function Icarus.AIAudioDataLibrary.MakeLiteralAIAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618760
	struct FAIAudioDataRowHandle MakeAIAudioDataFromIndex(int32_t Index); // Function Icarus.AIAudioDataLibrary.MakeAIAudioDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618370
	struct FAIAudioDataEnum MakeAIAudioDataEnum(struct FAIAudioDataEnum Enum); // Function Icarus.AIAudioDataLibrary.MakeAIAudioDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16182f0
	struct FAIAudioDataRowHandle MakeAIAudioData(struct UE4::FName RowName); // Function Icarus.AIAudioDataLibrary.MakeAIAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618250
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AIAudioDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16180a0
	struct FAIAudioDataEnum IntToStruct(int32_t IntValue); // Function Icarus.AIAudioDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617ef0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AIAudioDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1617d40
	void GetAIAudioDataStruct(struct FAIAudioDataRowHandle RowHandle, struct FAIAudioData& AIAudioData, enum class EValid& Paths); // Function Icarus.AIAudioDataLibrary.GetAIAudioDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16177f0
	bool EqualEqual_FAIAudioDataRowHandleFAIAudioDataRowHandle(struct FAIAudioDataRowHandle RowHandleA, struct FAIAudioDataRowHandle RowHandleB); // Function Icarus.AIAudioDataLibrary.EqualEqual_FAIAudioDataRowHandleFAIAudioDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617430
	bool EqualEqual_EnumEnum(struct FAIAudioDataEnum A, struct FAIAudioDataEnum B); // Function Icarus.AIAudioDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617160
	struct FAIAudioDataRowHandle CastToAIAudioDataRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AIAudioDataLibrary.CastToAIAudioDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1616e00
	void BreakAIAudioDataEnum(struct FAIAudioDataEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AIAudioDataLibrary.BreakAIAudioDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16169e0
	void AddRowToAIAudioDataTable(struct UE4::FName Name, struct FAIAudioData Data, struct FAIAudioDataRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AIAudioDataLibrary.AddRowToAIAudioDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1616240
};

// Class Icarus.AIAudioDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIAudioDataTable : UIcarusDataTable {
};

// Class Icarus.AICreatureTypeLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAICreatureTypeLibrary : URowLibrary {

	struct FAICreatureTypeRowHandle StructToRowHandle(struct FAICreatureTypeEnum EnumValue); // Function Icarus.AICreatureTypeLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619bf0
	struct UE4::FName StructToName(struct FAICreatureTypeEnum EnumValue); // Function Icarus.AICreatureTypeLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619a00
	int32_t StructToInt(struct FAICreatureTypeEnum EnumValue); // Function Icarus.AICreatureTypeLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619820
	struct FAICreatureTypeEnum RowHandleToStruct(struct FAICreatureTypeRowHandle RowHandle); // Function Icarus.AICreatureTypeLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619600
	void RemoveRowFromAICreatureTypeTable(struct UE4::FName Name); // Function Icarus.AICreatureTypeLibrary.RemoveRowFromAICreatureTypeTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1619440
	void RefreshConstants(); // Function Icarus.AICreatureTypeLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1619380
	int32_t NumRows(); // Function Icarus.AICreatureTypeLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619300
	bool NotEqual_EnumName(struct FAICreatureTypeEnum A, struct UE4::FName B); // Function Icarus.AICreatureTypeLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16190f0
	bool NotEqual_EnumEnum(struct FAICreatureTypeEnum A, struct FAICreatureTypeEnum B); // Function Icarus.AICreatureTypeLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618e20
	struct FAICreatureTypeEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AICreatureTypeLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618c10
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AICreatureTypeLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1618a60
	struct FAICreatureTypeRowHandle MakeLiteralAICreatureType(struct FAICreatureTypeRowHandle RowHandle); // Function Icarus.AICreatureTypeLibrary.MakeLiteralAICreatureType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618830
	struct FAICreatureTypeRowHandle MakeAICreatureTypeFromIndex(int32_t Index); // Function Icarus.AICreatureTypeLibrary.MakeAICreatureTypeFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618520
	struct FAICreatureTypeEnum MakeAICreatureTypeEnum(struct FAICreatureTypeEnum Enum); // Function Icarus.AICreatureTypeLibrary.MakeAICreatureTypeEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16184a0
	struct FAICreatureTypeRowHandle MakeAICreatureType(struct UE4::FName RowName); // Function Icarus.AICreatureTypeLibrary.MakeAICreatureType // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618400
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AICreatureTypeLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1618130
	struct FAICreatureTypeEnum IntToStruct(int32_t IntValue); // Function Icarus.AICreatureTypeLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617f80
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AICreatureTypeLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1617dd0
	void GetAICreatureTypeStruct(struct FAICreatureTypeRowHandle RowHandle, struct FAICreatureType& AICreatureType, enum class EValid& Paths); // Function Icarus.AICreatureTypeLibrary.GetAICreatureTypeStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1617990
	bool EqualEqual_FAICreatureTypeRowHandleFAICreatureTypeRowHandle(struct FAICreatureTypeRowHandle RowHandleA, struct FAICreatureTypeRowHandle RowHandleB); // Function Icarus.AICreatureTypeLibrary.EqualEqual_FAICreatureTypeRowHandleFAICreatureTypeRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617570
	bool EqualEqual_EnumEnum(struct FAICreatureTypeEnum A, struct FAICreatureTypeEnum B); // Function Icarus.AICreatureTypeLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617250
	struct FAICreatureTypeRowHandle CastToAICreatureTypeRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AICreatureTypeLibrary.CastToAICreatureTypeRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1616f20
	void BreakAICreatureTypeEnum(struct FAICreatureTypeEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AICreatureTypeLibrary.BreakAICreatureTypeEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1616b40
	void AddRowToAICreatureTypeTable(struct UE4::FName Name, struct FAICreatureType Data, struct FAICreatureTypeRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AICreatureTypeLibrary.AddRowToAICreatureTypeTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1616420
};

// Class Icarus.AICreatureTypeTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAICreatureTypeTable : UIcarusDataTable {
};

// Class Icarus.AIDescriptorsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIDescriptorsLibrary : URowLibrary {

	struct FAIDescriptorsRowHandle StructToRowHandle(struct FAIDescriptorsEnum EnumValue); // Function Icarus.AIDescriptorsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619ca0
	struct UE4::FName StructToName(struct FAIDescriptorsEnum EnumValue); // Function Icarus.AIDescriptorsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619aa0
	int32_t StructToInt(struct FAIDescriptorsEnum EnumValue); // Function Icarus.AIDescriptorsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16198c0
	struct FAIDescriptorsEnum RowHandleToStruct(struct FAIDescriptorsRowHandle RowHandle); // Function Icarus.AIDescriptorsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16196c0
	void RemoveRowFromAIDescriptorsTable(struct UE4::FName Name); // Function Icarus.AIDescriptorsLibrary.RemoveRowFromAIDescriptorsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16194c0
	void RefreshConstants(); // Function Icarus.AIDescriptorsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16193a0
	int32_t NumRows(); // Function Icarus.AIDescriptorsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1619330
	bool NotEqual_EnumName(struct FAIDescriptorsEnum A, struct UE4::FName B); // Function Icarus.AIDescriptorsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16191e0
	bool NotEqual_EnumEnum(struct FAIDescriptorsEnum A, struct FAIDescriptorsEnum B); // Function Icarus.AIDescriptorsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618f10
	struct FAIDescriptorsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AIDescriptorsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618ca0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AIDescriptorsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1618af0
	struct FAIDescriptorsRowHandle MakeLiteralAIDescriptors(struct FAIDescriptorsRowHandle RowHandle); // Function Icarus.AIDescriptorsLibrary.MakeLiteralAIDescriptors // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618900
	struct FAIDescriptorsRowHandle MakeAIDescriptorsFromIndex(int32_t Index); // Function Icarus.AIDescriptorsLibrary.MakeAIDescriptorsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16186d0
	struct FAIDescriptorsEnum MakeAIDescriptorsEnum(struct FAIDescriptorsEnum Enum); // Function Icarus.AIDescriptorsLibrary.MakeAIDescriptorsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618650
	struct FAIDescriptorsRowHandle MakeAIDescriptors(struct UE4::FName RowName); // Function Icarus.AIDescriptorsLibrary.MakeAIDescriptors // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16185b0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AIDescriptorsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16181c0
	struct FAIDescriptorsEnum IntToStruct(int32_t IntValue); // Function Icarus.AIDescriptorsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1618010
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AIDescriptorsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1617e60
	void GetAIDescriptorsStruct(struct FAIDescriptorsRowHandle RowHandle, struct FAIDescriptor& AIDescriptors, enum class EValid& Paths); // Function Icarus.AIDescriptorsLibrary.GetAIDescriptorsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1617b80
	bool EqualEqual_FAIDescriptorsRowHandleFAIDescriptorsRowHandle(struct FAIDescriptorsRowHandle RowHandleA, struct FAIDescriptorsRowHandle RowHandleB); // Function Icarus.AIDescriptorsLibrary.EqualEqual_FAIDescriptorsRowHandleFAIDescriptorsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16176b0
	bool EqualEqual_EnumEnum(struct FAIDescriptorsEnum A, struct FAIDescriptorsEnum B); // Function Icarus.AIDescriptorsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1617340
	struct FAIDescriptorsRowHandle CastToAIDescriptorsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AIDescriptorsLibrary.CastToAIDescriptorsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1617040
	void BreakAIDescriptorsEnum(struct FAIDescriptorsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AIDescriptorsLibrary.BreakAIDescriptorsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1616ca0
	void AddRowToAIDescriptorsTable(struct UE4::FName Name, struct FAIDescriptor Data, struct FAIDescriptorsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AIDescriptorsLibrary.AddRowToAIDescriptorsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1616700
};

// Class Icarus.AIDescriptorsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIDescriptorsTable : UIcarusDataTable {
};

// Class Icarus.AIGrowthLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIGrowthLibrary : URowLibrary {

	struct FAIGrowthRowHandle StructToRowHandle(struct FAIGrowthEnum EnumValue); // Function Icarus.AIGrowthLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fee0
	struct UE4::FName StructToName(struct FAIGrowthEnum EnumValue); // Function Icarus.AIGrowthLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fd00
	int32_t StructToInt(struct FAIGrowthEnum EnumValue); // Function Icarus.AIGrowthLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fb20
	struct FAIGrowthEnum RowHandleToStruct(struct FAIGrowthRowHandle RowHandle); // Function Icarus.AIGrowthLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f8e0
	void RemoveRowFromAIGrowthTable(struct UE4::FName Name); // Function Icarus.AIGrowthLibrary.RemoveRowFromAIGrowthTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x161f760
	void RefreshConstants(); // Function Icarus.AIGrowthLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x161f700
	int32_t NumRows(); // Function Icarus.AIGrowthLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f670
	bool NotEqual_EnumName(struct FAIGrowthEnum A, struct UE4::FName B); // Function Icarus.AIGrowthLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f3a0
	bool NotEqual_EnumEnum(struct FAIGrowthEnum A, struct FAIGrowthEnum B); // Function Icarus.AIGrowthLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f0d0
	struct FAIGrowthEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AIGrowthLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161ef20
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AIGrowthLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x161ed70
	struct FAIGrowthRowHandle MakeLiteralAIGrowth(struct FAIGrowthRowHandle RowHandle); // Function Icarus.AIGrowthLibrary.MakeLiteralAIGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161eb00
	struct FAIGrowthRowHandle MakeAIGrowthFromIndex(int32_t Index); // Function Icarus.AIGrowthLibrary.MakeAIGrowthFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e710
	struct FAIGrowthEnum MakeAIGrowthEnum(struct FAIGrowthEnum Enum); // Function Icarus.AIGrowthLibrary.MakeAIGrowthEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e690
	struct FAIGrowthRowHandle MakeAIGrowth(struct UE4::FName RowName); // Function Icarus.AIGrowthLibrary.MakeAIGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e5f0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AIGrowthLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x161e440
	struct FAIGrowthEnum IntToStruct(int32_t IntValue); // Function Icarus.AIGrowthLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e290
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AIGrowthLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x161e0e0
	void GetAIGrowthStruct(struct FAIGrowthRowHandle RowHandle, struct FAIGrowth& AIGrowth, enum class EValid& Paths); // Function Icarus.AIGrowthLibrary.GetAIGrowthStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161db60
	bool EqualEqual_FAIGrowthRowHandleFAIGrowthRowHandle(struct FAIGrowthRowHandle RowHandleA, struct FAIGrowthRowHandle RowHandleB); // Function Icarus.AIGrowthLibrary.EqualEqual_FAIGrowthRowHandleFAIGrowthRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161d7a0
	bool EqualEqual_EnumEnum(struct FAIGrowthEnum A, struct FAIGrowthEnum B); // Function Icarus.AIGrowthLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161d4d0
	struct FAIGrowthRowHandle CastToAIGrowthRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AIGrowthLibrary.CastToAIGrowthRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161d170
	void BreakAIGrowthEnum(struct FAIGrowthEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AIGrowthLibrary.BreakAIGrowthEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x161cd50
	void AddRowToAIGrowthTable(struct UE4::FName Name, struct FAIGrowth Data, struct FAIGrowthRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AIGrowthLibrary.AddRowToAIGrowthTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161c490
};

// Class Icarus.AIGrowthTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIGrowthTable : UIcarusDataTable {
};

// Class Icarus.AIRelationshipsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIRelationshipsLibrary : URowLibrary {

	struct FAIRelationshipsRowHandle StructToRowHandle(struct FAIRelationshipsEnum EnumValue); // Function Icarus.AIRelationshipsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161ff90
	struct UE4::FName StructToName(struct FAIRelationshipsEnum EnumValue); // Function Icarus.AIRelationshipsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fda0
	int32_t StructToInt(struct FAIRelationshipsEnum EnumValue); // Function Icarus.AIRelationshipsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fbc0
	struct FAIRelationshipsEnum RowHandleToStruct(struct FAIRelationshipsRowHandle RowHandle); // Function Icarus.AIRelationshipsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f9a0
	void RemoveRowFromAIRelationshipsTable(struct UE4::FName Name); // Function Icarus.AIRelationshipsLibrary.RemoveRowFromAIRelationshipsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x161f7e0
	void RefreshConstants(); // Function Icarus.AIRelationshipsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x161f720
	int32_t NumRows(); // Function Icarus.AIRelationshipsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f6a0
	bool NotEqual_EnumName(struct FAIRelationshipsEnum A, struct UE4::FName B); // Function Icarus.AIRelationshipsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f490
	bool NotEqual_EnumEnum(struct FAIRelationshipsEnum A, struct FAIRelationshipsEnum B); // Function Icarus.AIRelationshipsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f1c0
	struct FAIRelationshipsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AIRelationshipsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161efb0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AIRelationshipsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x161ee00
	struct FAIRelationshipsRowHandle MakeLiteralAIRelationships(struct FAIRelationshipsRowHandle RowHandle); // Function Icarus.AIRelationshipsLibrary.MakeLiteralAIRelationships // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161ebd0
	struct FAIRelationshipsRowHandle MakeAIRelationshipsFromIndex(int32_t Index); // Function Icarus.AIRelationshipsLibrary.MakeAIRelationshipsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e8c0
	struct FAIRelationshipsEnum MakeAIRelationshipsEnum(struct FAIRelationshipsEnum Enum); // Function Icarus.AIRelationshipsLibrary.MakeAIRelationshipsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e840
	struct FAIRelationshipsRowHandle MakeAIRelationships(struct UE4::FName RowName); // Function Icarus.AIRelationshipsLibrary.MakeAIRelationships // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e7a0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AIRelationshipsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x161e4d0
	struct FAIRelationshipsEnum IntToStruct(int32_t IntValue); // Function Icarus.AIRelationshipsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e320
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AIRelationshipsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x161e170
	void GetAIRelationshipsStruct(struct FAIRelationshipsRowHandle RowHandle, struct FAIRelationshipData& AIRelationships, enum class EValid& Paths); // Function Icarus.AIRelationshipsLibrary.GetAIRelationshipsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161dd80
	bool EqualEqual_FAIRelationshipsRowHandleFAIRelationshipsRowHandle(struct FAIRelationshipsRowHandle RowHandleA, struct FAIRelationshipsRowHandle RowHandleB); // Function Icarus.AIRelationshipsLibrary.EqualEqual_FAIRelationshipsRowHandleFAIRelationshipsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161d8e0
	bool EqualEqual_EnumEnum(struct FAIRelationshipsEnum A, struct FAIRelationshipsEnum B); // Function Icarus.AIRelationshipsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161d5c0
	struct FAIRelationshipsRowHandle CastToAIRelationshipsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AIRelationshipsLibrary.CastToAIRelationshipsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161d290
	void BreakAIRelationshipsEnum(struct FAIRelationshipsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AIRelationshipsLibrary.BreakAIRelationshipsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x161ceb0
	void AddRowToAIRelationshipsTable(struct UE4::FName Name, struct FAIRelationshipData Data, struct FAIRelationshipsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AIRelationshipsLibrary.AddRowToAIRelationshipsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161c830
};

// Class Icarus.AIRelationshipsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAIRelationshipsTable : UIcarusDataTable {
};

// Class Icarus.AISetupLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISetupLibrary : URowLibrary {

	struct FAISetupRowHandle StructToRowHandle(struct FAISetupEnum EnumValue); // Function Icarus.AISetupLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1620040
	struct UE4::FName StructToName(struct FAISetupEnum EnumValue); // Function Icarus.AISetupLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fe40
	int32_t StructToInt(struct FAISetupEnum EnumValue); // Function Icarus.AISetupLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fc60
	struct FAISetupEnum RowHandleToStruct(struct FAISetupRowHandle RowHandle); // Function Icarus.AISetupLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161fa60
	void RemoveRowFromAISetupTable(struct UE4::FName Name); // Function Icarus.AISetupLibrary.RemoveRowFromAISetupTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x161f860
	void RefreshConstants(); // Function Icarus.AISetupLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x161f740
	int32_t NumRows(); // Function Icarus.AISetupLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f6d0
	bool NotEqual_EnumName(struct FAISetupEnum A, struct UE4::FName B); // Function Icarus.AISetupLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f580
	bool NotEqual_EnumEnum(struct FAISetupEnum A, struct FAISetupEnum B); // Function Icarus.AISetupLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f2b0
	struct FAISetupEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AISetupLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161f040
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AISetupLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x161ee90
	struct FAISetupRowHandle MakeLiteralAISetup(struct FAISetupRowHandle RowHandle); // Function Icarus.AISetupLibrary.MakeLiteralAISetup // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161eca0
	struct FAISetupRowHandle MakeAISetupFromIndex(int32_t Index); // Function Icarus.AISetupLibrary.MakeAISetupFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161ea70
	struct FAISetupEnum MakeAISetupEnum(struct FAISetupEnum Enum); // Function Icarus.AISetupLibrary.MakeAISetupEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e9f0
	struct FAISetupRowHandle MakeAISetup(struct UE4::FName RowName); // Function Icarus.AISetupLibrary.MakeAISetup // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e950
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AISetupLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x161e560
	struct FAISetupEnum IntToStruct(int32_t IntValue); // Function Icarus.AISetupLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161e3b0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AISetupLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x161e200
	void GetAISetupStruct(struct FAISetupRowHandle RowHandle, struct FAISetup& AISetup, enum class EValid& Paths); // Function Icarus.AISetupLibrary.GetAISetupStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161df40
	bool EqualEqual_FAISetupRowHandleFAISetupRowHandle(struct FAISetupRowHandle RowHandleA, struct FAISetupRowHandle RowHandleB); // Function Icarus.AISetupLibrary.EqualEqual_FAISetupRowHandleFAISetupRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161da20
	bool EqualEqual_EnumEnum(struct FAISetupEnum A, struct FAISetupEnum B); // Function Icarus.AISetupLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x161d6b0
	struct FAISetupRowHandle CastToAISetupRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AISetupLibrary.CastToAISetupRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161d3b0
	void BreakAISetupEnum(struct FAISetupEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AISetupLibrary.BreakAISetupEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x161d010
	void AddRowToAISetupTable(struct UE4::FName Name, struct FAISetup Data, struct FAISetupRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AISetupLibrary.AddRowToAISetupTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x161cb70
};

// Class Icarus.AISetupTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISetupTable : UIcarusDataTable {
};

// Class Icarus.AISpawnBehaviour
// Size: 0xc0 (Inherited: 0x28)
struct UAISpawnBehaviour : UObject {
	struct FAutonomousSpawnData SpawnData; // 0x28(0x60)
	struct FAutonomousSpawnsRowHandle SpawnsRowHandle; // 0x88(0x18)
	struct FMulticastInlineDelegate SpawnComplete; // 0xa0(0x10)
	struct TArray<struct AActor*> SpawnedAI; // 0xb0(0x10)

	bool TrySpawnAI(struct UObject* WorldContextObject); // Function Icarus.AISpawnBehaviour.TrySpawnAI // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16260b0
	void TryCleanupIrrelevantAI(); // Function Icarus.AISpawnBehaviour.TryCleanupIrrelevantAI // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1626090
	bool SpawnAI(struct UObject* WorldContextObject, struct FTransform& SpawnTransform, struct AActor*& SpawnedAI, int32_t Level); // Function Icarus.AISpawnBehaviour.SpawnAI // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1625ac0
	void OnSpawnedActorDeath(struct UActorState* ActorState); // Function Icarus.AISpawnBehaviour.OnSpawnedActorDeath // (Final|Native|Protected) // @ game+0x1625740
	void InitialiseSpawnBehaviour(struct FAutonomousSpawnsRowHandle& InSpawnData); // Function Icarus.AISpawnBehaviour.InitialiseSpawnBehaviour // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1624570
	void CleanupAI(struct AActor* AI); // Function Icarus.AISpawnBehaviour.CleanupAI // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x16238a0
};

// Class Icarus.AISpawnConfigLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISpawnConfigLibrary : URowLibrary {

	struct FAISpawnConfigRowHandle StructToRowHandle(struct FAISpawnConfigEnum EnumValue); // Function Icarus.AISpawnConfigLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625f30
	struct UE4::FName StructToName(struct FAISpawnConfigEnum EnumValue); // Function Icarus.AISpawnConfigLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625df0
	int32_t StructToInt(struct FAISpawnConfigEnum EnumValue); // Function Icarus.AISpawnConfigLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625cb0
	struct FAISpawnConfigEnum RowHandleToStruct(struct FAISpawnConfigRowHandle RowHandle); // Function Icarus.AISpawnConfigLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625940
	void RemoveRowFromAISpawnConfigTable(struct UE4::FName Name); // Function Icarus.AISpawnConfigLibrary.RemoveRowFromAISpawnConfigTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1625840
	void RefreshConstants(); // Function Icarus.AISpawnConfigLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1625800
	int32_t NumRows(); // Function Icarus.AISpawnConfigLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625580
	bool NotEqual_EnumName(struct FAISpawnConfigEnum A, struct UE4::FName B); // Function Icarus.AISpawnConfigLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16253a0
	bool NotEqual_EnumEnum(struct FAISpawnConfigEnum A, struct FAISpawnConfigEnum B); // Function Icarus.AISpawnConfigLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16251c0
	struct FAISpawnConfigEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AISpawnConfigLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16250a0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AISpawnConfigLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1624f80
	struct FAISpawnConfigRowHandle MakeLiteralAISpawnConfig(struct FAISpawnConfigRowHandle RowHandle); // Function Icarus.AISpawnConfigLibrary.MakeLiteralAISpawnConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624de0
	struct FAISpawnConfigRowHandle MakeAISpawnConfigFromIndex(int32_t Index); // Function Icarus.AISpawnConfigLibrary.MakeAISpawnConfigFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624ba0
	struct FAISpawnConfigEnum MakeAISpawnConfigEnum(struct FAISpawnConfigEnum Enum); // Function Icarus.AISpawnConfigLibrary.MakeAISpawnConfigEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624b20
	struct FAISpawnConfigRowHandle MakeAISpawnConfig(struct UE4::FName RowName); // Function Icarus.AISpawnConfigLibrary.MakeAISpawnConfig // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624a80
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AISpawnConfigLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1624960
	struct FAISpawnConfigEnum IntToStruct(int32_t IntValue); // Function Icarus.AISpawnConfigLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624740
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AISpawnConfigLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1624620
	void GetAISpawnConfigStruct(struct FAISpawnConfigRowHandle RowHandle, struct FAISpawnConfigData& AISpawnConfig, enum class EValid& Paths); // Function Icarus.AISpawnConfigLibrary.GetAISpawnConfigStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1623df0
	bool EqualEqual_FAISpawnConfigRowHandleFAISpawnConfigRowHandle(struct FAISpawnConfigRowHandle RowHandleA, struct FAISpawnConfigRowHandle RowHandleB); // Function Icarus.AISpawnConfigLibrary.EqualEqual_FAISpawnConfigRowHandleFAISpawnConfigRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1623b30
	bool EqualEqual_EnumEnum(struct FAISpawnConfigEnum A, struct FAISpawnConfigEnum B); // Function Icarus.AISpawnConfigLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1623950
	struct FAISpawnConfigRowHandle CastToAISpawnConfigRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AISpawnConfigLibrary.CastToAISpawnConfigRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1623660
	void BreakAISpawnConfigEnum(struct FAISpawnConfigEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AISpawnConfigLibrary.BreakAISpawnConfigEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16233a0
	void AddRowToAISpawnConfigTable(struct UE4::FName Name, struct FAISpawnConfigData Data, struct FAISpawnConfigRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AISpawnConfigLibrary.AddRowToAISpawnConfigTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1622e50
};

// Class Icarus.AISpawnConfigTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISpawnConfigTable : UIcarusDataTable {
};

// Class Icarus.AISpawner
// Size: 0x450 (Inherited: 0x220)
struct AAISpawner : AActor {
	struct TArray<struct FTileSpawnData> WorldSpawnData; // 0x220(0x10)
	struct UEnvQuery* Template; // 0x230(0x08)
	int32_t NumberOfCachedSpawnPoints; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct FMulticastInlineDelegate GenerationComplete; // 0x240(0x10)
	int32_t SelectedTile; // 0x250(0x04)
	struct FAISpawnConfigRowHandle SpawnConfig; // 0x254(0x18)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct TArray<struct UIcarusAISpawnFilter*> SpawnRules; // 0x270(0x10)
	struct UIcarusStatContainer* StatContainer; // 0x280(0x08)
	struct FWorldData WorldData; // 0x288(0x148)
	struct TMap<struct FAISetupRowHandle, float> LastAISetupSpawnTime; // 0x3d0(0x50)
	char pad_420[0x10]; // 0x420(0x10)
	struct TArray<struct UAISpawnBehaviour*> ActiveAutonomousSpawners; // 0x430(0x10)
	struct AIcarusEQSTestingPawn* TestingPawn; // 0x440(0x08)
	char pad_448[0x8]; // 0x448(0x08)

	void WorldStatsSet(); // Function Icarus.AISpawner.WorldStatsSet // (Final|Native|Private) // @ game+0x1626150
	void VisualiseTilePosition(); // Function Icarus.AISpawner.VisualiseTilePosition // (Final|Native|Public|BlueprintCallable) // @ game+0x1626130
	void SpawnPointGenerationComplete(); // Function Icarus.AISpawner.SpawnPointGenerationComplete // (Native|Event|Public|BlueprintEvent) // @ game+0x1625c90
	void SetupNPC(struct AIcarusNPCGOAPCharacter* SpawnedNPC); // Function Icarus.AISpawner.SetupNPC // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x88b940
	void SetDebugSpawnBlockers(bool bEnabled); // Function Icarus.AISpawner.SetDebugSpawnBlockers // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	bool PerformNextTileEQS(); // Function Icarus.AISpawner.PerformNextTileEQS // (Final|Native|Private) // @ game+0x16257d0
	void OnProspectDataSet(); // Function Icarus.AISpawner.OnProspectDataSet // (Native|Event|Protected|BlueprintEvent) // @ game+0x1625720
	void OnNPCKilled(struct UActorState* ActorState); // Function Icarus.AISpawner.OnNPCKilled // (Native|Event|Protected|BlueprintEvent) // @ game+0x1625690
	void OnEQSQueryCompleted(struct TArray<struct FVector>& EQSResults); // Function Icarus.AISpawner.OnEQSQueryCompleted // (Final|Native|Private|HasOutParms) // @ game+0x16255e0
	bool IsSpawnPointValid(struct FVector& InLocation, struct FAISetupEnum& InAISetup); // Function Icarus.AISpawner.IsSpawnPointValid // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1624860
	void InitialiseBehavioursForSpawnConfig(struct FAISpawnConfigData& SpawnConfig); // Function Icarus.AISpawner.InitialiseBehavioursForSpawnConfig // (Final|Native|Protected|HasOutParms) // @ game+0x1624430
	int32_t GetTotalNumNPCsUndergoingLatentDeath(); // Function Icarus.AISpawner.GetTotalNumNPCsUndergoingLatentDeath // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1624410
	int32_t GetNumLatentDeathsForAISetup(struct FAISetupRowHandle AISetup); // Function Icarus.AISpawner.GetNumLatentDeathsForAISetup // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624350
	float GetLastAISetupSpawnTime(struct FAISetupRowHandle AISetup); // Function Icarus.AISpawner.GetLastAISetupSpawnTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1624290
	float GetLastAISetupDeathTime(struct FAISetupRowHandle AISetup); // Function Icarus.AISpawner.GetLastAISetupDeathTime // (Final|Native|Public|BlueprintCallable) // @ game+0x16241d0
	bool GetDebugSpawnBlockers(); // Function Icarus.AISpawner.GetDebugSpawnBlockers // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
	void GenerateSingleTileSpawnPoints(); // Function Icarus.AISpawner.GenerateSingleTileSpawnPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x1623dd0
	void GenerateCachedSpawnPoints(); // Function Icarus.AISpawner.GenerateCachedSpawnPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x1623db0
	void ClearLatentNPCDeaths(); // Function Icarus.AISpawner.ClearLatentNPCDeaths // (Final|Native|Private) // @ game+0x1623930
};

// Class Icarus.AISpawnRulesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISpawnRulesLibrary : URowLibrary {

	struct FAISpawnRulesRowHandle StructToRowHandle(struct FAISpawnRulesEnum EnumValue); // Function Icarus.AISpawnRulesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625fe0
	struct UE4::FName StructToName(struct FAISpawnRulesEnum EnumValue); // Function Icarus.AISpawnRulesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625e90
	int32_t StructToInt(struct FAISpawnRulesEnum EnumValue); // Function Icarus.AISpawnRulesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625d50
	struct FAISpawnRulesEnum RowHandleToStruct(struct FAISpawnRulesRowHandle RowHandle); // Function Icarus.AISpawnRulesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625a00
	void RemoveRowFromAISpawnRulesTable(struct UE4::FName Name); // Function Icarus.AISpawnRulesLibrary.RemoveRowFromAISpawnRulesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16258c0
	void RefreshConstants(); // Function Icarus.AISpawnRulesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1625820
	int32_t NumRows(); // Function Icarus.AISpawnRulesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16255b0
	bool NotEqual_EnumName(struct FAISpawnRulesEnum A, struct UE4::FName B); // Function Icarus.AISpawnRulesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625490
	bool NotEqual_EnumEnum(struct FAISpawnRulesEnum A, struct FAISpawnRulesEnum B); // Function Icarus.AISpawnRulesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16252b0
	struct FAISpawnRulesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AISpawnRulesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1625130
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AISpawnRulesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1625010
	struct FAISpawnRulesRowHandle MakeLiteralAISpawnRules(struct FAISpawnRulesRowHandle RowHandle); // Function Icarus.AISpawnRulesLibrary.MakeLiteralAISpawnRules // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624eb0
	struct FAISpawnRulesRowHandle MakeAISpawnRulesFromIndex(int32_t Index); // Function Icarus.AISpawnRulesLibrary.MakeAISpawnRulesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624d50
	struct FAISpawnRulesEnum MakeAISpawnRulesEnum(struct FAISpawnRulesEnum Enum); // Function Icarus.AISpawnRulesLibrary.MakeAISpawnRulesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624cd0
	struct FAISpawnRulesRowHandle MakeAISpawnRules(struct UE4::FName RowName); // Function Icarus.AISpawnRulesLibrary.MakeAISpawnRules // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1624c30
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AISpawnRulesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16249f0
	struct FAISpawnRulesEnum IntToStruct(int32_t IntValue); // Function Icarus.AISpawnRulesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16247d0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AISpawnRulesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x16246b0
	void GetAISpawnRulesStruct(struct FAISpawnRulesRowHandle RowHandle, struct FAISpawnRuleData& AISpawnRules, enum class EValid& Paths); // Function Icarus.AISpawnRulesLibrary.GetAISpawnRulesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1623fe0
	bool EqualEqual_FAISpawnRulesRowHandleFAISpawnRulesRowHandle(struct FAISpawnRulesRowHandle RowHandleA, struct FAISpawnRulesRowHandle RowHandleB); // Function Icarus.AISpawnRulesLibrary.EqualEqual_FAISpawnRulesRowHandleFAISpawnRulesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1623c70
	bool EqualEqual_EnumEnum(struct FAISpawnRulesEnum A, struct FAISpawnRulesEnum B); // Function Icarus.AISpawnRulesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1623a40
	struct FAISpawnRulesRowHandle CastToAISpawnRulesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AISpawnRulesLibrary.CastToAISpawnRulesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1623780
	void BreakAISpawnRulesEnum(struct FAISpawnRulesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AISpawnRulesLibrary.BreakAISpawnRulesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1623500
	void AddRowToAISpawnRulesTable(struct UE4::FName Name, struct FAISpawnRuleData Data, struct FAISpawnRulesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AISpawnRulesLibrary.AddRowToAISpawnRulesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1623090
};

// Class Icarus.AISpawnRulesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISpawnRulesTable : UIcarusDataTable {
};

// Class Icarus.AISpawnZonesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAISpawnZonesLibrary : URowLibrary {

	struct FAISpawnZonesRowHandle StructToRowHandle(struct FAISpawnZonesEnum EnumValue); // Function Icarus.AISpawnZonesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162bb80
	struct UE4::FName StructToName(struct FAISpawnZonesEnum EnumValue); // Function Icarus.AISpawnZonesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162ba40
	int32_t StructToInt(struct FAISpawnZonesEnum EnumValue); // Function Icarus.AISpawnZonesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b900
	struct FAISpawnZonesEnum RowHandleToStruct(struct FAISpawnZonesRowHandle RowHandle); // Function Icarus.AISpawnZonesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b700
	void RemoveRowFromAISpawnZonesTable(struct UE4::FName Name); // Function Icarus.AISpawnZonesLibrary.RemoveRowFromAISpawnZonesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x162b600
	void RefreshConstants(); // Function Icarus.AISpawnZonesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x162b5c0
	int32_t NumRows(); // Function Icarus.AISpawnZonesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b4e0
	bool NotEqual_EnumName(struct FAISpawnZonesEnum A, struct UE4::FName B); // Function Icarus.AISpawnZonesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b300
	bool NotEqual_EnumEnum(struct FAISpawnZonesEnum A, struct FAISpawnZonesEnum B); // Function Icarus.AISpawnZonesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b120
	struct FAISpawnZonesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AISpawnZonesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b000
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AISpawnZonesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x162aee0
	struct FAISpawnZonesRowHandle MakeLiteralAISpawnZones(struct FAISpawnZonesRowHandle RowHandle); // Function Icarus.AISpawnZonesLibrary.MakeLiteralAISpawnZones // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162ad40
	struct FAISpawnZonesRowHandle MakeAISpawnZonesFromIndex(int32_t Index); // Function Icarus.AISpawnZonesLibrary.MakeAISpawnZonesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162ab00
	struct FAISpawnZonesEnum MakeAISpawnZonesEnum(struct FAISpawnZonesEnum Enum); // Function Icarus.AISpawnZonesLibrary.MakeAISpawnZonesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162aa80
	struct FAISpawnZonesRowHandle MakeAISpawnZones(struct UE4::FName RowName); // Function Icarus.AISpawnZonesLibrary.MakeAISpawnZones // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162a9e0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AISpawnZonesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x162a8c0
	struct FAISpawnZonesEnum IntToStruct(int32_t IntValue); // Function Icarus.AISpawnZonesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162a4d0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AISpawnZonesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x162a3b0
	void GetAISpawnZonesStruct(struct FAISpawnZonesRowHandle RowHandle, struct FAISpawnZones& AISpawnZones, enum class EValid& Paths); // Function Icarus.AISpawnZonesLibrary.GetAISpawnZonesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1629db0
	bool EqualEqual_FAISpawnZonesRowHandleFAISpawnZonesRowHandle(struct FAISpawnZonesRowHandle RowHandleA, struct FAISpawnZonesRowHandle RowHandleB); // Function Icarus.AISpawnZonesLibrary.EqualEqual_FAISpawnZonesRowHandleFAISpawnZonesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1629b30
	bool EqualEqual_EnumEnum(struct FAISpawnZonesEnum A, struct FAISpawnZonesEnum B); // Function Icarus.AISpawnZonesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1629950
	struct FAISpawnZonesRowHandle CastToAISpawnZonesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AISpawnZonesLibrary.CastToAISpawnZonesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1629710
	void BreakAISpawnZonesEnum(struct FAISpawnZonesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AISpawnZonesLibrary.BreakAISpawnZonesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1629450
	void AddRowToAISpawnZonesTable(struct UE4::FName Name, struct FAISpawnZones Data, struct FAISpawnZonesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AISpawnZonesLibrary.AddRowToAISpawnZonesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1628dd0
};

// Class Icarus.AISpawnZonesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAISpawnZonesTable : UIcarusDataTable {
};

// Class Icarus.AITargetable
// Size: 0x28 (Inherited: 0x28)
struct UAITargetable : UInterface {

	bool IsHidden(); // Function Icarus.AITargetable.IsHidden // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a720
	bool IsCriticalHitDisabled(); // Function Icarus.AITargetable.IsCriticalHitDisabled // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a6f0
	bool IsActorAlive(); // Function Icarus.AITargetable.IsActorAlive // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a5f0
	struct FVector GetTargetLocation(); // Function Icarus.AITargetable.GetTargetLocation // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a2e0
	int32_t GetTargetAlertness(); // Function Icarus.AITargetable.GetTargetAlertness // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a2b0
	struct FAIRelationshipsRowHandle GetRelationshipData(); // Function Icarus.AITargetable.GetRelationshipData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a270
	struct TArray<struct FCriticalHitLocation> GetCriticalHitBones(); // Function Icarus.AITargetable.GetCriticalHitBones // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x162a1f0
};

// Class Icarus.AITargetableFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAITargetableFunctionLibrary : UBlueprintFunctionLibrary {

	void IsHostileTowards(struct AActor* SelfTargetable, struct AActor* OtherActorTargetable, enum class ERelationshipType& OutRelationshipSwitch, enum class ERelationshipType& OutRelationshipType); // Function Icarus.AITargetableFunctionLibrary.IsHostileTowards // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162a750
	bool IsActorTargetable(struct AActor* Actor, bool bOnlyAliveActors); // Function Icarus.AITargetableFunctionLibrary.IsActorTargetable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x162a620
	enum class EStealthAttackType GetTargetStealth(struct AActor* TargetableActor); // Function Icarus.AITargetableFunctionLibrary.GetTargetStealth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162a320
};

// Class Icarus.VocalisationComponent
// Size: 0x110 (Inherited: 0xb0)
struct UVocalisationComponent : UActorComponent {
	struct UFMODAudioComponent* AudioComponent; // 0xb0(0x08)
	char pad_B8[0x58]; // 0xb8(0x58)

	enum class EVocalisationPlayResult TryPlayVocalisation(struct FVocalisationsRowHandle Vocalisation); // Function Icarus.VocalisationComponent.TryPlayVocalisation // (Final|Native|Public|BlueprintCallable) // @ game+0x1899820
	void OnEventStopped(); // Function Icarus.VocalisationComponent.OnEventStopped // (Final|Native|Protected) // @ game+0x1899160
	void Initialise(struct USceneComponent* TargetComponent, struct UE4::FName TargetSocket); // Function Icarus.VocalisationComponent.Initialise // (Native|Public|BlueprintCallable) // @ game+0x1898070
	float GetVocalisationLength(struct FVocalisationsRowHandle Vocalisation); // Function Icarus.VocalisationComponent.GetVocalisationLength // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1897c90
	float GetCurrentVocalisationLength(); // Function Icarus.VocalisationComponent.GetCurrentVocalisationLength // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x18979c0
};

// Class Icarus.AIVocalisationComponent
// Size: 0x120 (Inherited: 0x110)
struct UAIVocalisationComponent : UVocalisationComponent {
	char pad_110[0x10]; // 0x110(0x10)

	void SetAIState(enum class EAIAudioState State); // Function Icarus.AIVocalisationComponent.SetAIState // (Final|Native|Public|BlueprintCallable) // @ game+0x162b880
	void PlayAIVocalisation(enum class EAIVocalisationType Type); // Function Icarus.AIVocalisationComponent.PlayAIVocalisation // (Final|Native|Public|BlueprintCallable) // @ game+0x162b540
};

// Class Icarus.AmmoTypesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAmmoTypesLibrary : URowLibrary {

	struct FAmmoTypesRowHandle StructToRowHandle(struct FAmmoTypesEnum EnumValue); // Function Icarus.AmmoTypesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162bc30
	struct UE4::FName StructToName(struct FAmmoTypesEnum EnumValue); // Function Icarus.AmmoTypesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162bae0
	int32_t StructToInt(struct FAmmoTypesEnum EnumValue); // Function Icarus.AmmoTypesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b9a0
	struct FAmmoTypesEnum RowHandleToStruct(struct FAmmoTypesRowHandle RowHandle); // Function Icarus.AmmoTypesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b7c0
	void RemoveRowFromAmmoTypesTable(struct UE4::FName Name); // Function Icarus.AmmoTypesLibrary.RemoveRowFromAmmoTypesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x162b680
	void RefreshConstants(); // Function Icarus.AmmoTypesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x162b5e0
	int32_t NumRows(); // Function Icarus.AmmoTypesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b510
	bool NotEqual_EnumName(struct FAmmoTypesEnum A, struct UE4::FName B); // Function Icarus.AmmoTypesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b3f0
	bool NotEqual_EnumEnum(struct FAmmoTypesEnum A, struct FAmmoTypesEnum B); // Function Icarus.AmmoTypesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b210
	struct FAmmoTypesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AmmoTypesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162b090
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AmmoTypesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x162af70
	struct FAmmoTypesRowHandle MakeLiteralAmmoTypes(struct FAmmoTypesRowHandle RowHandle); // Function Icarus.AmmoTypesLibrary.MakeLiteralAmmoTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162ae10
	struct FAmmoTypesRowHandle MakeAmmoTypesFromIndex(int32_t Index); // Function Icarus.AmmoTypesLibrary.MakeAmmoTypesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162acb0
	struct FAmmoTypesEnum MakeAmmoTypesEnum(struct FAmmoTypesEnum Enum); // Function Icarus.AmmoTypesLibrary.MakeAmmoTypesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162ac30
	struct FAmmoTypesRowHandle MakeAmmoTypes(struct UE4::FName RowName); // Function Icarus.AmmoTypesLibrary.MakeAmmoTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162ab90
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AmmoTypesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x162a950
	struct FAmmoTypesEnum IntToStruct(int32_t IntValue); // Function Icarus.AmmoTypesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162a560
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AmmoTypesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x162a440
	void GetAmmoTypesStruct(struct FAmmoTypesRowHandle RowHandle, struct FAmmoTypeData& AmmoTypes, enum class EValid& Paths); // Function Icarus.AmmoTypesLibrary.GetAmmoTypesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1629fe0
	bool EqualEqual_FAmmoTypesRowHandleFAmmoTypesRowHandle(struct FAmmoTypesRowHandle RowHandleA, struct FAmmoTypesRowHandle RowHandleB); // Function Icarus.AmmoTypesLibrary.EqualEqual_FAmmoTypesRowHandleFAmmoTypesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1629c70
	bool EqualEqual_EnumEnum(struct FAmmoTypesEnum A, struct FAmmoTypesEnum B); // Function Icarus.AmmoTypesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1629a40
	struct FAmmoTypesRowHandle CastToAmmoTypesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AmmoTypesLibrary.CastToAmmoTypesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1629830
	void BreakAmmoTypesEnum(struct FAmmoTypesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AmmoTypesLibrary.BreakAmmoTypesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16295b0
	void AddRowToAmmoTypesTable(struct UE4::FName Name, struct FAmmoTypeData Data, struct FAmmoTypesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AmmoTypesLibrary.AddRowToAmmoTypesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1629150
};

// Class Icarus.AmmoTypesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAmmoTypesTable : UIcarusDataTable {
};

// Class Icarus.AnimNotify_IcarusPlaySound
// Size: 0x58 (Inherited: 0x38)
struct UAnimNotify_IcarusPlaySound : UAnimNotify {
	struct UFMODEvent* FMODEvent; // 0x38(0x08)
	bool bFollow; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct UE4::FName AttachSocket; // 0x44(0x08)
	bool bUseListenerRotation; // 0x4c(0x01)
	bool bUseOcclusion; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	struct UE4::FName OcclusionTrace; // 0x50(0x08)
};

// Class Icarus.AnimNotify_PlaySoundPlayer
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotify_PlaySoundPlayer : UAnimNotify {
	struct UFMODEvent* FMODEvent; // 0x38(0x08)
	bool bUseItemAnimData; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct UE4::FName ItemAnimName; // 0x44(0x08)
	int32_t ItemAnimIndex; // 0x4c(0x04)

	struct UFMODEvent* GetFMODEvent(struct AIcarusPlayerCharacter* PlayerCharacter); // Function Icarus.AnimNotify_PlaySoundPlayer.GetFMODEvent // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x162ffb0
};

// Class Icarus.AnimNotifyState_IcarusPlaySoundContinuous
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_IcarusPlaySoundContinuous : UAnimNotifyState {
	struct UFMODEvent* FMODEvent; // 0x30(0x08)
	struct UE4::FName AttachSocket; // 0x38(0x08)
	bool bUseListenerRotation; // 0x40(0x01)
	bool bUseOcclusion; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	struct UE4::FName OcclusionTrace; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UFMODAudioComponent* AudioComponent; // 0x50(0x08)
};

// Class Icarus.ArmourComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UArmourComponent : UTraitComponent {

	bool GetArmourData(struct FArmourData& OutData); // Function Icarus.ArmourComponent.GetArmourData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x162f8c0
};

// Class Icarus.ArmourLibrary
// Size: 0x28 (Inherited: 0x28)
struct UArmourLibrary : URowLibrary {

	struct FArmourRowHandle StructToRowHandle(struct FArmourEnum EnumValue); // Function Icarus.ArmourLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631e50
	struct UE4::FName StructToName(struct FArmourEnum EnumValue); // Function Icarus.ArmourLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631c70
	int32_t StructToInt(struct FArmourEnum EnumValue); // Function Icarus.ArmourLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631a90
	struct FArmourEnum RowHandleToStruct(struct FArmourRowHandle RowHandle); // Function Icarus.ArmourLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631850
	void RemoveRowFromArmourTable(struct UE4::FName Name); // Function Icarus.ArmourLibrary.RemoveRowFromArmourTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16317d0
	void RefreshConstants(); // Function Icarus.ArmourLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1631670
	int32_t NumRows(); // Function Icarus.ArmourLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16315e0
	bool NotEqual_EnumName(struct FArmourEnum A, struct UE4::FName B); // Function Icarus.ArmourLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631310
	bool NotEqual_EnumEnum(struct FArmourEnum A, struct FArmourEnum B); // Function Icarus.ArmourLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631040
	struct FArmourEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.ArmourLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630e90
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.ArmourLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1630ce0
	struct FArmourRowHandle MakeLiteralArmour(struct FArmourRowHandle RowHandle); // Function Icarus.ArmourLibrary.MakeLiteralArmour // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630a70
	struct FArmourRowHandle MakeArmourFromIndex(int32_t Index); // Function Icarus.ArmourLibrary.MakeArmourFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630680
	struct FArmourEnum MakeArmourEnum(struct FArmourEnum Enum); // Function Icarus.ArmourLibrary.MakeArmourEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630600
	struct FArmourRowHandle MakeArmour(struct UE4::FName RowName); // Function Icarus.ArmourLibrary.MakeArmour // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630560
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.ArmourLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16303b0
	struct FArmourEnum IntToStruct(int32_t IntValue); // Function Icarus.ArmourLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630200
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.ArmourLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1630050
	void GetArmourStruct(struct FArmourRowHandle RowHandle, struct FArmourData& Armour, enum class EValid& Paths); // Function Icarus.ArmourLibrary.GetArmourStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162fe10
	bool EqualEqual_FArmourRowHandleFArmourRowHandle(struct FArmourRowHandle RowHandleA, struct FArmourRowHandle RowHandleB); // Function Icarus.ArmourLibrary.EqualEqual_FArmourRowHandleFArmourRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162f500
	bool EqualEqual_EnumEnum(struct FArmourEnum A, struct FArmourEnum B); // Function Icarus.ArmourLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162f230
	struct FArmourRowHandle CastToArmourRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.ArmourLibrary.CastToArmourRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162eed0
	void BreakArmourEnum(struct FArmourEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.ArmourLibrary.BreakArmourEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x162eab0
	void AddRowToArmourTable(struct UE4::FName Name, struct FArmourData Data, struct FArmourRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.ArmourLibrary.AddRowToArmourTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162e8d0
};

// Class Icarus.ArmourSetBonusLibrary
// Size: 0x28 (Inherited: 0x28)
struct UArmourSetBonusLibrary : URowLibrary {

	struct FArmourSetBonusRowHandle StructToRowHandle(struct FArmourSetBonusEnum EnumValue); // Function Icarus.ArmourSetBonusLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631f00
	struct UE4::FName StructToName(struct FArmourSetBonusEnum EnumValue); // Function Icarus.ArmourSetBonusLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631d10
	int32_t StructToInt(struct FArmourSetBonusEnum EnumValue); // Function Icarus.ArmourSetBonusLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631b30
	struct FArmourSetBonusEnum RowHandleToStruct(struct FArmourSetBonusRowHandle RowHandle); // Function Icarus.ArmourSetBonusLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631910
	void RemoveRowFromArmourSetBonusTable(struct UE4::FName Name); // Function Icarus.ArmourSetBonusLibrary.RemoveRowFromArmourSetBonusTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16316d0
	void RefreshConstants(); // Function Icarus.ArmourSetBonusLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1631690
	int32_t NumRows(); // Function Icarus.ArmourSetBonusLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631610
	bool NotEqual_EnumName(struct FArmourSetBonusEnum A, struct UE4::FName B); // Function Icarus.ArmourSetBonusLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631400
	bool NotEqual_EnumEnum(struct FArmourSetBonusEnum A, struct FArmourSetBonusEnum B); // Function Icarus.ArmourSetBonusLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631130
	struct FArmourSetBonusEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.ArmourSetBonusLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630f20
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.ArmourSetBonusLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1630d70
	struct FArmourSetBonusRowHandle MakeLiteralArmourSetBonus(struct FArmourSetBonusRowHandle RowHandle); // Function Icarus.ArmourSetBonusLibrary.MakeLiteralArmourSetBonus // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630b40
	struct FArmourSetBonusRowHandle MakeArmourSetBonusFromIndex(int32_t Index); // Function Icarus.ArmourSetBonusLibrary.MakeArmourSetBonusFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630830
	struct FArmourSetBonusEnum MakeArmourSetBonusEnum(struct FArmourSetBonusEnum Enum); // Function Icarus.ArmourSetBonusLibrary.MakeArmourSetBonusEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16307b0
	struct FArmourSetBonusRowHandle MakeArmourSetBonus(struct UE4::FName RowName); // Function Icarus.ArmourSetBonusLibrary.MakeArmourSetBonus // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630710
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.ArmourSetBonusLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1630440
	struct FArmourSetBonusEnum IntToStruct(int32_t IntValue); // Function Icarus.ArmourSetBonusLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630290
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.ArmourSetBonusLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x16300e0
	void GetArmourSetBonusStruct(struct FArmourSetBonusRowHandle RowHandle, struct FArmourSetBonus& ArmourSetBonus, enum class EValid& Paths); // Function Icarus.ArmourSetBonusLibrary.GetArmourSetBonusStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162fa30
	bool EqualEqual_FArmourSetBonusRowHandleFArmourSetBonusRowHandle(struct FArmourSetBonusRowHandle RowHandleA, struct FArmourSetBonusRowHandle RowHandleB); // Function Icarus.ArmourSetBonusLibrary.EqualEqual_FArmourSetBonusRowHandleFArmourSetBonusRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162f640
	bool EqualEqual_EnumEnum(struct FArmourSetBonusEnum A, struct FArmourSetBonusEnum B); // Function Icarus.ArmourSetBonusLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162f320
	struct FArmourSetBonusRowHandle CastToArmourSetBonusRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.ArmourSetBonusLibrary.CastToArmourSetBonusRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162eff0
	void BreakArmourSetBonusEnum(struct FArmourSetBonusEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.ArmourSetBonusLibrary.BreakArmourSetBonusEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x162ec10
	void AddRowToArmourSetBonusTable(struct UE4::FName Name, struct FArmourSetBonus Data, struct FArmourSetBonusRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.ArmourSetBonusLibrary.AddRowToArmourSetBonusTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162e310
};

// Class Icarus.ArmourSetBonusTable
// Size: 0xb8 (Inherited: 0xb8)
struct UArmourSetBonusTable : UIcarusDataTable {
};

// Class Icarus.ArmourSetsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UArmourSetsLibrary : URowLibrary {

	struct FArmourSetsRowHandle StructToRowHandle(struct FArmourSetsEnum EnumValue); // Function Icarus.ArmourSetsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631fb0
	struct UE4::FName StructToName(struct FArmourSetsEnum EnumValue); // Function Icarus.ArmourSetsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631db0
	int32_t StructToInt(struct FArmourSetsEnum EnumValue); // Function Icarus.ArmourSetsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631bd0
	struct FArmourSetsEnum RowHandleToStruct(struct FArmourSetsRowHandle RowHandle); // Function Icarus.ArmourSetsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16319d0
	void RemoveRowFromArmourSetsTable(struct UE4::FName Name); // Function Icarus.ArmourSetsLibrary.RemoveRowFromArmourSetsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1631750
	void RefreshConstants(); // Function Icarus.ArmourSetsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16316b0
	int32_t NumRows(); // Function Icarus.ArmourSetsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631640
	bool NotEqual_EnumName(struct FArmourSetsEnum A, struct UE4::FName B); // Function Icarus.ArmourSetsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16314f0
	bool NotEqual_EnumEnum(struct FArmourSetsEnum A, struct FArmourSetsEnum B); // Function Icarus.ArmourSetsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1631220
	struct FArmourSetsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.ArmourSetsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630fb0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.ArmourSetsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1630e00
	struct FArmourSetsRowHandle MakeLiteralArmourSets(struct FArmourSetsRowHandle RowHandle); // Function Icarus.ArmourSetsLibrary.MakeLiteralArmourSets // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630c10
	struct FArmourSetsRowHandle MakeArmourSetsFromIndex(int32_t Index); // Function Icarus.ArmourSetsLibrary.MakeArmourSetsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16309e0
	struct FArmourSetsEnum MakeArmourSetsEnum(struct FArmourSetsEnum Enum); // Function Icarus.ArmourSetsLibrary.MakeArmourSetsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630960
	struct FArmourSetsRowHandle MakeArmourSets(struct UE4::FName RowName); // Function Icarus.ArmourSetsLibrary.MakeArmourSets // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16308c0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.ArmourSetsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16304d0
	struct FArmourSetsEnum IntToStruct(int32_t IntValue); // Function Icarus.ArmourSetsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1630320
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.ArmourSetsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1630170
	void GetArmourSetsStruct(struct FArmourSetsRowHandle RowHandle, struct FArmourSet& ArmourSets, enum class EValid& Paths); // Function Icarus.ArmourSetsLibrary.GetArmourSetsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162fc80
	bool EqualEqual_FArmourSetsRowHandleFArmourSetsRowHandle(struct FArmourSetsRowHandle RowHandleA, struct FArmourSetsRowHandle RowHandleB); // Function Icarus.ArmourSetsLibrary.EqualEqual_FArmourSetsRowHandleFArmourSetsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162f780
	bool EqualEqual_EnumEnum(struct FArmourSetsEnum A, struct FArmourSetsEnum B); // Function Icarus.ArmourSetsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x162f410
	struct FArmourSetsRowHandle CastToArmourSetsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.ArmourSetsLibrary.CastToArmourSetsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162f110
	void BreakArmourSetsEnum(struct FArmourSetsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.ArmourSetsLibrary.BreakArmourSetsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x162ed70
	void AddRowToArmourSetsTable(struct UE4::FName Name, struct FArmourSet Data, struct FArmourSetsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.ArmourSetsLibrary.AddRowToArmourSetsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x162e660
};

// Class Icarus.ArmourSetsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UArmourSetsTable : UIcarusDataTable {
};

// Class Icarus.ArmourTable
// Size: 0xb8 (Inherited: 0xb8)
struct UArmourTable : UIcarusDataTable {
};

// Class Icarus.AssetReferencesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAssetReferencesLibrary : URowLibrary {

	struct FAssetReferencesRowHandle StructToRowHandle(struct FAssetReferencesEnum EnumValue); // Function Icarus.AssetReferencesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1637e90
	struct UE4::FName StructToName(struct FAssetReferencesEnum EnumValue); // Function Icarus.AssetReferencesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1637df0
	int32_t StructToInt(struct FAssetReferencesEnum EnumValue); // Function Icarus.AssetReferencesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1637d50
	struct FAssetReferencesEnum RowHandleToStruct(struct FAssetReferencesRowHandle RowHandle); // Function Icarus.AssetReferencesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1637af0
	void RemoveRowFromAssetReferencesTable(struct UE4::FName Name); // Function Icarus.AssetReferencesLibrary.RemoveRowFromAssetReferencesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1637a70
	void RefreshConstants(); // Function Icarus.AssetReferencesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1637860
	int32_t NumRows(); // Function Icarus.AssetReferencesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16374b0
	bool NotEqual_EnumName(struct FAssetReferencesEnum A, struct UE4::FName B); // Function Icarus.AssetReferencesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16373c0
	bool NotEqual_EnumEnum(struct FAssetReferencesEnum A, struct FAssetReferencesEnum B); // Function Icarus.AssetReferencesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16372d0
	struct FAssetReferencesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AssetReferencesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1637240
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AssetReferencesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16371b0
	struct FAssetReferencesRowHandle MakeLiteralAssetReferences(struct FAssetReferencesRowHandle RowHandle); // Function Icarus.AssetReferencesLibrary.MakeLiteralAssetReferences // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16370e0
	struct FAssetReferencesRowHandle MakeAssetReferencesFromIndex(int32_t Index); // Function Icarus.AssetReferencesLibrary.MakeAssetReferencesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1637050
	struct FAssetReferencesEnum MakeAssetReferencesEnum(struct FAssetReferencesEnum Enum); // Function Icarus.AssetReferencesLibrary.MakeAssetReferencesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1636fd0
	struct FAssetReferencesRowHandle MakeAssetReferences(struct UE4::FName RowName); // Function Icarus.AssetReferencesLibrary.MakeAssetReferences // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1636f30
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AssetReferencesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1636ea0
	struct FAssetReferencesEnum IntToStruct(int32_t IntValue); // Function Icarus.AssetReferencesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1636e10
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AssetReferencesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1636d80
	void GetAssetReferencesStruct(struct FAssetReferencesRowHandle RowHandle, struct FAssetReferenceData& AssetReferences, enum class EValid& Paths); // Function Icarus.AssetReferencesLibrary.GetAssetReferencesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16367e0
	bool EqualEqual_FAssetReferencesRowHandleFAssetReferencesRowHandle(struct FAssetReferencesRowHandle RowHandleA, struct FAssetReferencesRowHandle RowHandleB); // Function Icarus.AssetReferencesLibrary.EqualEqual_FAssetReferencesRowHandleFAssetReferencesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16366a0
	bool EqualEqual_EnumEnum(struct FAssetReferencesEnum A, struct FAssetReferencesEnum B); // Function Icarus.AssetReferencesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16365b0
	struct FAssetReferencesRowHandle CastToAssetReferencesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AssetReferencesLibrary.CastToAssetReferencesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1636490
	void BreakAssetReferencesEnum(struct FAssetReferencesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AssetReferencesLibrary.BreakAssetReferencesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1636330
	void AddRowToAssetReferencesTable(struct UE4::FName Name, struct FAssetReferenceData Data, struct FAssetReferencesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AssetReferencesLibrary.AddRowToAssetReferencesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1636140
};

// Class Icarus.AssetReferencesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAssetReferencesTable : UIcarusDataTable {
};

// Class Icarus.AtmosphereController
// Size: 0x220 (Inherited: 0x220)
struct AAtmosphereController : AInfo {
};

// Class Icarus.AudioContextComponent
// Size: 0x160 (Inherited: 0xb0)
struct UAudioContextComponent : UActorComponent {
	float MaxUpdateDistance; // 0xb0(0x04)
	float OcclusionShelterContextThreshold; // 0xb4(0x04)
	struct FMulticastInlineDelegate OnEnteredCave; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnExitedCave; // 0xc8(0x10)
	char pad_D8[0x1]; // 0xd8(0x01)
	enum class EAudioShelterState ShelterState; // 0xd9(0x01)
	char pad_DA[0x16]; // 0xda(0x16)
	struct UAudioOcclusionComponent* OcclusionComponent; // 0xf0(0x08)
	struct TArray<struct FAudioContextSubscriber> Subscribers; // 0xf8(0x10)
	struct TMap<struct AActor*, struct FAudioContextCaveColliderSet> CaveOverlaps; // 0x108(0x50)
	char pad_158[0x8]; // 0x158(0x08)

	void UnsubscribeAudioComponentFromUpdates(struct UFMODAudioComponent* AudioComponent); // Function Icarus.AudioContextComponent.UnsubscribeAudioComponentFromUpdates // (Final|Native|Public|BlueprintCallable) // @ game+0x16381c0
	void SubscribeAudioComponentToUpdates(struct UFMODAudioComponent* AudioComponent, bool bUsesOcclusionParameter, struct UE4::FName OcclusionTraceName, bool bUsesWaterImmersionParameter); // Function Icarus.AudioContextComponent.SubscribeAudioComponentToUpdates // (Final|Native|Public|BlueprintCallable) // @ game+0x1637f40
	void SetCaveOverlapOnceByLocation(struct FVector Location); // Function Icarus.AudioContextComponent.SetCaveOverlapOnceByLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1637c30
	void RemoveCaveOverlap(struct AActor* Cave, struct UPrimitiveComponent* Collider); // Function Icarus.AudioContextComponent.RemoveCaveOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x16379a0
	enum class EAudioShelterState GetShelterState(); // Function Icarus.AudioContextComponent.GetShelterState // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1636c70
	enum class EOcclusionShelterContextFMODParam GetOcclusionShelterContextFMODParam(float OcclusionValue); // Function Icarus.AudioContextComponent.GetOcclusionShelterContextFMODParam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1636bb0
	float GetListenerCaveSpaceCorrelation(); // Function Icarus.AudioContextComponent.GetListenerCaveSpaceCorrelation // (Final|Native|Public|BlueprintCallable) // @ game+0x1636b80
	float GetCurrentWaterImmersion(); // Function Icarus.AudioContextComponent.GetCurrentWaterImmersion // (Native|Public|BlueprintCallable) // @ game+0x1636b40
	float GetCurrentOcclusion(struct UE4::FName TracePointName); // Function Icarus.AudioContextComponent.GetCurrentOcclusion // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1636aa0
	enum class ECaveContextFMODParam GetCaveContextFMODParam(); // Function Icarus.AudioContextComponent.GetCaveContextFMODParam // (Final|Native|Public|BlueprintCallable) // @ game+0x1636a70
	void AddCaveOverlap(struct AActor* Cave, struct UPrimitiveComponent* Collider); // Function Icarus.AudioContextComponent.AddCaveOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x1636070
};

// Class Icarus.AudioContextCreatureComponent
// Size: 0x168 (Inherited: 0x160)
struct UAudioContextCreatureComponent : UAudioContextComponent {
	struct UCreatureAudioComponent* CreatureAudio; // 0x160(0x08)
};

// Class Icarus.AudioContextPlayerComponent
// Size: 0x170 (Inherited: 0x160)
struct UAudioContextPlayerComponent : UAudioContextComponent {
	float ShelterStateLowThreshold; // 0x160(0x04)
	float ShelterStateHighThreshold; // 0x164(0x04)
	struct UPlayerMovementAudioComponent* PlayerMovementAudioComponent; // 0x168(0x08)

	void ServerSetNewShelter(enum class EAudioShelterState NewShelterState); // Function Icarus.AudioContextPlayerComponent.ServerSetNewShelter // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1637bb0
	void OnShelterUpdated(float NewShelter); // Function Icarus.AudioContextPlayerComponent.OnShelterUpdated // (Final|Native|Private) // @ game+0x16377e0
};

// Class Icarus.AudioOccluderInterface
// Size: 0x28 (Inherited: 0x28)
struct UAudioOccluderInterface : UInterface {

	float GetOcclusionValue(); // Function Icarus.AudioOccluderInterface.GetOcclusionValue // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1636c40
};

// Class Icarus.AudioOcclusionComponent
// Size: 0x270 (Inherited: 0x200)
struct UAudioOcclusionComponent : USceneComponent {
	bool bDebug; // 0x1f8(0x01)
	char pad_201[0x6f]; // 0x201(0x6f)

	struct TArray<struct FAudioOcclusionTracePoint> GetTracePoints(struct FVector& ListenerLocation); // Function Icarus.AudioOcclusionComponent.GetTracePoints // (Native|Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1636ca0
};

// Class Icarus.AudioOcclusionSocketTraceComponent
// Size: 0x280 (Inherited: 0x270)
struct UAudioOcclusionSocketTraceComponent : UAudioOcclusionComponent {
	struct TArray<struct FAudioOcclusionSocketTracePoint> TracePointDefinitions; // 0x268(0x10)

	void SetTracePointTargets(struct USceneComponent* TargetComponent); // Function Icarus.AudioOcclusionSocketTraceComponent.SetTracePointTargets // (Final|Native|Protected|BlueprintCallable) // @ game+0x1637cc0
};

// Class Icarus.AudioOcclusionCharacterComponent
// Size: 0x280 (Inherited: 0x280)
struct UAudioOcclusionCharacterComponent : UAudioOcclusionSocketTraceComponent {
};

// Class Icarus.AudioOcclusionDropshipComponent
// Size: 0x270 (Inherited: 0x270)
struct UAudioOcclusionDropshipComponent : UAudioOcclusionComponent {
};

// Class Icarus.AudioSettingsSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UAudioSettingsSubsystem : UGameInstanceSubsystem {

	void OnSFXVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnSFXVolumeChanged // (Final|Native|Public) // @ game+0x1637760
	void OnMusicVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnMusicVolumeChanged // (Final|Native|Public) // @ game+0x16376e0
	void OnMasterVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnMasterVolumeChanged // (Final|Native|Public) // @ game+0x1637660
	void OnDialogueVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnDialogueVolumeChanged // (Final|Native|Public) // @ game+0x16375e0
	void OnCharacterVoiceVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnCharacterVoiceVolumeChanged // (Final|Native|Public) // @ game+0x1637560
	void OnAmbientVolumeChanged(float Volume); // Function Icarus.AudioSettingsSubsystem.OnAmbientVolumeChanged // (Final|Native|Public) // @ game+0x16374e0
};

// Class Icarus.AudioSplineComponent
// Size: 0x570 (Inherited: 0x540)
struct UAudioSplineComponent : USplineComponent {
	struct UFMODEvent* Event; // 0x538(0x08)
	float UpdateFrequencyInListenerRange; // 0x540(0x04)
	float UpdateFrequencyOutsideListenerRange; // 0x544(0x04)
	float InterpSpeed; // 0x548(0x04)
	struct UFMODAudioComponent* AudioComponent; // 0x550(0x08)
	char pad_55C[0x14]; // 0x55c(0x14)
};

// Class Icarus.AuraManagerComponent
// Size: 0x230 (Inherited: 0xb0)
struct UAuraManagerComponent : UActorComponent {
	struct TSet<struct AActor*> AllPlayers; // 0xb0(0x50)
	struct TSet<struct AActor*> AllNPCs; // 0x100(0x50)
	struct TMap<struct AActor*, struct FAuraInstances> AuraInstances; // 0x150(0x50)
	struct FGameplayTagQuery PlayerTagQuery; // 0x1a0(0x48)
	struct FGameplayTagQuery NPCTagQuery; // 0x1e8(0x48)

	void UnregisterModifiableObject(struct AActor* Modifiable); // Function Icarus.AuraManagerComponent.UnregisterModifiableObject // (Final|Native|Public|BlueprintCallable) // @ game+0x1638130
	void TickModifier(struct UModifierStateComponent* ModifierComp); // Function Icarus.AuraManagerComponent.TickModifier // (Final|Native|Public|BlueprintCallable) // @ game+0x16380a0
	void RemoveAura(struct UModifierStateComponent* ModifierComp); // Function Icarus.AuraManagerComponent.RemoveAura // (Final|Native|Public|BlueprintCallable) // @ game+0x1637910
	void RegisterModifiableObject(struct AActor* Modifiable); // Function Icarus.AuraManagerComponent.RegisterModifiableObject // (Final|Native|Public|BlueprintCallable) // @ game+0x1637880
	struct TArray<struct FFindAuraResult> GetAurasAtLocation(struct FVector Location); // Function Icarus.AuraManagerComponent.GetAurasAtLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1636980
	void AddAura(struct UModifierStateComponent* ModifierComp); // Function Icarus.AuraManagerComponent.AddAura // (Final|Native|Public|BlueprintCallable) // @ game+0x1635fe0
};

// Class Icarus.AutonomousSpawnsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAutonomousSpawnsLibrary : URowLibrary {

	struct FAutonomousSpawnsRowHandle StructToRowHandle(struct FAutonomousSpawnsEnum EnumValue); // Function Icarus.AutonomousSpawnsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1644ab0
	struct UE4::FName StructToName(struct FAutonomousSpawnsEnum EnumValue); // Function Icarus.AutonomousSpawnsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1644a10
	int32_t StructToInt(struct FAutonomousSpawnsEnum EnumValue); // Function Icarus.AutonomousSpawnsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1644970
	struct FAutonomousSpawnsEnum RowHandleToStruct(struct FAutonomousSpawnsRowHandle RowHandle); // Function Icarus.AutonomousSpawnsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16448b0
	void RemoveRowFromAutonomousSpawnsTable(struct UE4::FName Name); // Function Icarus.AutonomousSpawnsLibrary.RemoveRowFromAutonomousSpawnsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16433a0
	void RefreshConstants(); // Function Icarus.AutonomousSpawnsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16432f0
	int32_t NumRows(); // Function Icarus.AutonomousSpawnsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d820
	bool NotEqual_EnumName(struct FAutonomousSpawnsEnum A, struct UE4::FName B); // Function Icarus.AutonomousSpawnsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d730
	bool NotEqual_EnumEnum(struct FAutonomousSpawnsEnum A, struct FAutonomousSpawnsEnum B); // Function Icarus.AutonomousSpawnsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d640
	struct FAutonomousSpawnsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.AutonomousSpawnsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d5b0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.AutonomousSpawnsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x163d520
	struct FAutonomousSpawnsRowHandle MakeLiteralAutonomousSpawns(struct FAutonomousSpawnsRowHandle RowHandle); // Function Icarus.AutonomousSpawnsLibrary.MakeLiteralAutonomousSpawns // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d450
	struct FAutonomousSpawnsRowHandle MakeAutonomousSpawnsFromIndex(int32_t Index); // Function Icarus.AutonomousSpawnsLibrary.MakeAutonomousSpawnsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d3c0
	struct FAutonomousSpawnsEnum MakeAutonomousSpawnsEnum(struct FAutonomousSpawnsEnum Enum); // Function Icarus.AutonomousSpawnsLibrary.MakeAutonomousSpawnsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d340
	struct FAutonomousSpawnsRowHandle MakeAutonomousSpawns(struct UE4::FName RowName); // Function Icarus.AutonomousSpawnsLibrary.MakeAutonomousSpawns // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d2a0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.AutonomousSpawnsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x163d100
	struct FAutonomousSpawnsEnum IntToStruct(int32_t IntValue); // Function Icarus.AutonomousSpawnsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163d070
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.AutonomousSpawnsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x163cfe0
	void GetAutonomousSpawnsStruct(struct FAutonomousSpawnsRowHandle RowHandle, struct FAutonomousSpawnData& AutonomousSpawns, enum class EValid& Paths); // Function Icarus.AutonomousSpawnsLibrary.GetAutonomousSpawnsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x163cc60
	bool EqualEqual_FAutonomousSpawnsRowHandleFAutonomousSpawnsRowHandle(struct FAutonomousSpawnsRowHandle RowHandleA, struct FAutonomousSpawnsRowHandle RowHandleB); // Function Icarus.AutonomousSpawnsLibrary.EqualEqual_FAutonomousSpawnsRowHandleFAutonomousSpawnsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cb20
	bool EqualEqual_EnumEnum(struct FAutonomousSpawnsEnum A, struct FAutonomousSpawnsEnum B); // Function Icarus.AutonomousSpawnsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x163ca30
	struct FAutonomousSpawnsRowHandle CastToAutonomousSpawnsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.AutonomousSpawnsLibrary.CastToAutonomousSpawnsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x163c910
	void BreakAutonomousSpawnsEnum(struct FAutonomousSpawnsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.AutonomousSpawnsLibrary.BreakAutonomousSpawnsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x163c6b0
	void AddRowToAutonomousSpawnsTable(struct UE4::FName Name, struct FAutonomousSpawnData Data, struct FAutonomousSpawnsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.AutonomousSpawnsLibrary.AddRowToAutonomousSpawnsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x163c430
};

// Class Icarus.AutonomousSpawnsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UAutonomousSpawnsTable : UIcarusDataTable {
};

// Class Icarus.BackendProxyComponent
// Size: 0x4c0 (Inherited: 0xb0)
struct UBackendProxyComponent : UActorComponent {
	struct FMulticastSparseDelegate MetaResourcesUpdated; // 0xb0(0x01)
	struct FMulticastSparseDelegate MetaInventoryUpdated; // 0xb1(0x01)
	struct FMulticastSparseDelegate MetaInventorySlotUpdated; // 0xb2(0x01)
	struct FMulticastSparseDelegate WorkshopPurchaseResult; // 0xb3(0x01)
	struct FMulticastSparseDelegate DropshipsUpdated; // 0xb4(0x01)
	struct FMulticastSparseDelegate DropshipCreationResult; // 0xb5(0x01)
	struct FMulticastSparseDelegate DropshipModificationResult; // 0xb6(0x01)
	struct FMulticastSparseDelegate DropshipDeletionResult; // 0xb7(0x01)
	struct FMulticastSparseDelegate PreparedLoadoutUpdated; // 0xb8(0x01)
	struct FMulticastSparseDelegate CharacterLoadoutUpdated; // 0xb9(0x01)
	struct FMulticastSparseDelegate LoadoutInventoryUpdated; // 0xba(0x01)
	struct FMulticastSparseDelegate LoadoutInventorySlotUpdated; // 0xbb(0x01)
	struct FMulticastSparseDelegate LoadoutPackaged; // 0xbc(0x01)
	struct FMulticastSparseDelegate CreditsUpdated; // 0xbd(0x01)
	struct FMulticastSparseDelegate ProspectsUpdated; // 0xbe(0x01)
	struct FMulticastSparseDelegate ClaimedProspectResult; // 0xbf(0x01)
	struct FMulticastSparseDelegate SettleProspectResult; // 0xc0(0x01)
	struct FMulticastSparseDelegate NotificationsUpdated; // 0xc1(0x01)
	struct FMulticastSparseDelegate TalentUnlocked; // 0xc2(0x01)
	struct FMulticastSparseDelegate TrackedStatisticsUpdateResult; // 0xc3(0x01)
	struct FMulticastSparseDelegate FactionMissionUpdateResult; // 0xc4(0x01)
	struct FMulticastSparseDelegate BackToHabResult; // 0xc5(0x01)
	char pad_C6[0x52]; // 0xc6(0x52)
	struct FMulticastSparseDelegate GetCharacterProfileResult; // 0x118(0x01)
	struct FMulticastSparseDelegate GetUserProfileResult; // 0x119(0x01)
	struct FMulticastSparseDelegate PackageLoadoutResult; // 0x11a(0x01)
	struct FMulticastSparseDelegate WorkshopResearchResult; // 0x11b(0x01)
	struct FMulticastSparseDelegate WorkshopReplicationResult; // 0x11c(0x01)
	struct FMulticastSparseDelegate GetCharacterLoadoutResult; // 0x11d(0x01)
	struct FMulticastSparseDelegate UpdateCharacterProgressResult; // 0x11e(0x01)
	struct FMulticastSparseDelegate UpdateCharacterProspectLocationResult; // 0x11f(0x01)
	struct FMulticastSparseDelegate SyncCharacterTalentsResult; // 0x120(0x01)
	struct FMulticastSparseDelegate SyncAccountTalentsResult; // 0x121(0x01)
	struct FMulticastSparseDelegate ExchangeCurrencyResult; // 0x122(0x01)
	char pad_123[0x5]; // 0x123(0x05)
	struct UGetMetaResourceCallbackProxyGen* MetaResourcesCallback; // 0x128(0x08)
	struct UGetMetaInventoryCallbackProxyGen* MetaInventoryCallback; // 0x130(0x08)
	struct UGetLoadoutInventoryCallbackProxyGen* LoadoutInventoryCallback; // 0x138(0x08)
	struct UMoveMetaInventoryItemCallbackProxyGen* ShiftMetaItemCallbackProxy; // 0x140(0x08)
	struct URemoveMetaItemCallbackProxyGen* RemoveMetaItemCallbackProxy; // 0x148(0x08)
	struct UGetDropshipsCallbackProxyGen* GetDropshipsCallbackProxy; // 0x150(0x08)
	struct UCreateDropshipCallbackProxyGen* CreateDropshipsCallbackProxy; // 0x158(0x08)
	struct UModifyDropshipCallbackProxyGen* ModifyDropshipsCallbackProxy; // 0x160(0x08)
	struct UDeleteDropshipCallbackProxyGen* DeleteDropshipsCallbackProxy; // 0x168(0x08)
	struct USelectDropshipCallbackProxyGen* SelectDropshipCallbackProxy; // 0x170(0x08)
	struct URemoveSelectedDropshipCallbackProxyGen* RemoveSelectedDropshipCallbackProxy; // 0x178(0x08)
	struct USelectEnvirosuitCallbackProxyGen* SelectEnvirosuitCallbackProxy; // 0x180(0x08)
	struct URemoveEnvirosuitCallbackProxyGen* RemoveEnvirosuitCallbackProxy; // 0x188(0x08)
	struct UPackageLoadoutCallbackProxyGen* PackageLoadoutCallbackProxy; // 0x190(0x08)
	struct UUnpackageLoadoutCallbackProxyGen* UnpackageLoadoutCallbackProxy; // 0x198(0x08)
	struct UGetCharacterLoadoutCallbackProxyGen* CharacterLoadoutCallbackProxy; // 0x1a0(0x08)
	struct UGetPreparedLoadoutCallbackProxyGen* PreparedLoadoutCallbackProxy; // 0x1a8(0x08)
	struct UGetCreditsCallbackProxyGen* GetCreditsCallbackProxy; // 0x1b0(0x08)
	struct UGetAllProspectsCallbackProxyGen* GetAllProspectsCallbackProxy; // 0x1b8(0x08)
	struct UClaimProspectCallbackProxyGen* ClaimProspectCallbackProxy; // 0x1c0(0x08)
	struct USettleProspectCallbackProxyGen* SettleProspectCallbackProxy; // 0x1c8(0x08)
	struct UGetNotificationsCallbackProxyGen* GetNotificationsCallbackProxy; // 0x1d0(0x08)
	struct UClaimNotificationAttachmentsCallbackProxyGen* ClaimNotificationAttachmentsCallbackProxy; // 0x1d8(0x08)
	struct UDeleteNotificationCallbackProxyGen* DeleteNotificationCallbackProxy; // 0x1e0(0x08)
	struct UReadNotificationCallbackProxyGen* ReadNotificationCallbackProxy; // 0x1e8(0x08)
	struct UUpdateCharacterProgressCallbackProxyGen* UpdateCharacterProgressProxy; // 0x1f0(0x08)
	struct UUpdateCharacterProspectLocationCallbackProxyGen* UpdateCharacterProspectLocationProxy; // 0x1f8(0x08)
	struct UUpdateTrackedStatsCallbackProxyGen* UpdateTrackedStatsCallbackProxy; // 0x200(0x08)
	struct UUpdateFactionMissionProgressCallbackProxyGen* UpdateFactionMissionProgressCallbackProxy; // 0x208(0x08)
	struct USyncCharacterTalentsCallbackProxyGen* SyncCharacterTalentsCallbackProxy; // 0x210(0x08)
	struct USyncAccountTalentsCallbackProxyGen* SyncAccountTalentsCallbackProxy; // 0x218(0x08)
	struct UGetCharacterProfileCallbackProxyGen* GetCharacterProfileCallbackProxy; // 0x220(0x08)
	struct UGetUserProfileCallbackProxyGen* GetUserProfileCallbackProxy; // 0x228(0x08)
	struct UBackToHabCallbackProxyGen* BackToHabCallbackProxy; // 0x230(0x08)
	struct UUnlockWorkshopItemCallbackProxyGen* UnlockWorkshopItemCallbackProxy; // 0x238(0x08)
	struct UReplicateWorkshopItemCallbackProxyGen* ReplicateWorkshopItemCallbackProxy; // 0x240(0x08)
	struct UExchangeCurrencyCallbackProxyGen* ExchangeCurrencyCallbackProxy; // 0x248(0x08)
	struct UTalentRefundCallbackProxyGen* TalentRefundCallbackProxy; // 0x250(0x08)
	struct TMap<enum class ERateLimitedRequests, int32_t> RequestTimers; // 0x258(0x50)
	float CurrentTime; // 0x2a8(0x04)
	char pad_2AC[0x4]; // 0x2ac(0x04)
	struct TArray<struct FMetaResource> MetaResources; // 0x2b0(0x10)
	int32_t Credits; // 0x2c0(0x04)
	char pad_2C4[0x4]; // 0x2c4(0x04)
	struct TArray<struct FMetaItem> MetaInventory; // 0x2c8(0x10)
	struct TArray<struct FMetaItem> LoadoutInventory; // 0x2d8(0x10)
	struct TArray<struct FDropship> Dropships; // 0x2e8(0x10)
	int32_t PreparedDropship; // 0x2f8(0x04)
	int32_t PreparedDropshipID; // 0x2fc(0x04)
	struct FMetaItem PreparedEnvirosuit; // 0x300(0x40)
	struct FCharacterLoadout CharacterLoadout; // 0x340(0x138)
	bool PreparedLoadout; // 0x478(0x01)
	char pad_479[0x7]; // 0x479(0x07)
	struct TArray<struct FProspectInfo> Prospects; // 0x480(0x10)
	struct TArray<struct FNotification> Notifications; // 0x490(0x10)
	struct FPendingInventorySwap PendingInventorySwap; // 0x4a0(0x20)

	void UpdateSelectedDropship(); // Function Icarus.BackendProxyComponent.UpdateSelectedDropship // (Final|Native|Public) // @ game+0x16454a0
	void TriggerWorkshopPurchaseResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerWorkshopPurchaseResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1645410
	void TriggerTalentUnlocked(struct FTalentsRowHandle Talent, int32_t Rank, bool Success); // Function Icarus.BackendProxyComponent.TriggerTalentUnlocked // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x16452a0
	void TriggerProspectSettleResult(bool Success, struct FProspectInfo ProspectInfo); // Function Icarus.BackendProxyComponent.TriggerProspectSettleResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x16450e0
	void TriggerLoadoutPackage(); // Function Icarus.BackendProxyComponent.TriggerLoadoutPackage // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x16450c0
	void TriggerDropshipModificationResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerDropshipModificationResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1645030
	void TriggerDropshipDeletionResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerDropshipDeletionResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1644fa0
	void TriggerDropshipCreationResult(bool Success); // Function Icarus.BackendProxyComponent.TriggerDropshipCreationResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1644f10
	void TriggerClaimProspectResult(bool Success, struct FProspectInfo ProspectInfo); // Function Icarus.BackendProxyComponent.TriggerClaimProspectResult // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x1644b60
	void RetrieveCharacterLoadout(); // Function Icarus.BackendProxyComponent.RetrieveCharacterLoadout // (Final|Native|Public|BlueprintCallable) // @ game+0x1644890
	void Request_WorkshopPurchaseWorkshopPack(int32_t Index); // Function Icarus.BackendProxyComponent.Request_WorkshopPurchaseWorkshopPack // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644800
	void Request_WorkshopPacks(); // Function Icarus.BackendProxyComponent.Request_WorkshopPacks // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x16447e0
	void Request_UpdateTrackedStats(); // Function Icarus.BackendProxyComponent.Request_UpdateTrackedStats // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x16447c0
	void Request_UpdateFactionMissionProgress(struct FFactionMissionsRowHandle Mission, int32_t Progress); // Function Icarus.BackendProxyComponent.Request_UpdateFactionMissionProgress // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x16446e0
	void Request_UpdateCharacterProspectLocation(enum class EProspectLocation Location); // Function Icarus.BackendProxyComponent.Request_UpdateCharacterProspectLocation // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644660
	void Request_UpdateCharacterProgress(); // Function Icarus.BackendProxyComponent.Request_UpdateCharacterProgress // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644640
	void Request_UnpackageLoadout(); // Function Icarus.BackendProxyComponent.Request_UnpackageLoadout // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644620
	void Request_UnlockWorkshopItem(struct FTalentsRowHandle TalentsRowHandle); // Function Icarus.BackendProxyComponent.Request_UnlockWorkshopItem // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644570
	void Request_TalentRefund(struct FTalentsRowHandle Talent, int32_t CharacterSlot); // Function Icarus.BackendProxyComponent.Request_TalentRefund // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644490
	void Request_SyncCharacterTalents(); // Function Icarus.BackendProxyComponent.Request_SyncCharacterTalents // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644470
	void Request_SyncAccountTalents(); // Function Icarus.BackendProxyComponent.Request_SyncAccountTalents // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644450
	void Request_ShiftInventoryItem(struct UInventory* SourceInventory, struct UInventory* DestinationInventory, int32_t SourceSlot, int32_t DestinationSlot, int32_t Amount); // Function Icarus.BackendProxyComponent.Request_ShiftInventoryItem // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x16442c0
	void Request_SettleProspect(struct FString ProspectID, bool SettleProspect); // Function Icarus.BackendProxyComponent.Request_SettleProspect // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x16441d0
	void Request_ReplicateWorkshopItem(struct FTalentsRowHandle TalentsRowHandle); // Function Icarus.BackendProxyComponent.Request_ReplicateWorkshopItem // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644120
	void Request_RemovePreparedEnvirosuit(); // Function Icarus.BackendProxyComponent.Request_RemovePreparedEnvirosuit // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1644100
	void Request_RemovePreparedDropship(); // Function Icarus.BackendProxyComponent.Request_RemovePreparedDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x16440e0
	void Request_RemoveMetaItem(struct UInventory* SourceInventory, int32_t SourceSlot, int32_t Amount); // Function Icarus.BackendProxyComponent.Request_RemoveMetaItem // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643fe0
	void Request_ReadNotification(struct FString NotificationID); // Function Icarus.BackendProxyComponent.Request_ReadNotification // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643f30
	void Request_PrepareEnvirosuit(struct UInventory* Inventory, int32_t Slot); // Function Icarus.BackendProxyComponent.Request_PrepareEnvirosuit // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643e40
	void Request_PrepareDropship(int32_t Index); // Function Icarus.BackendProxyComponent.Request_PrepareDropship // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643db0
	void Request_PreparedLoadout(); // Function Icarus.BackendProxyComponent.Request_PreparedLoadout // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643f10
	void Request_PackageLoadout_WithCharacter(struct FOnlineProfileCharacter OnlineProfileCharacter); // Function Icarus.BackendProxyComponent.Request_PackageLoadout_WithCharacter // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643c30
	void Request_PackageLoadout(); // Function Icarus.BackendProxyComponent.Request_PackageLoadout // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643c10
	void Request_ModifyDropship(int32_t Index, struct FDropshipModification Dropship); // Function Icarus.BackendProxyComponent.Request_ModifyDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643ae0
	void Request_MetaResources(); // Function Icarus.BackendProxyComponent.Request_MetaResources // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643ac0
	void Request_MetaInventory(); // Function Icarus.BackendProxyComponent.Request_MetaInventory // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643aa0
	void Request_LoadoutInventory(); // Function Icarus.BackendProxyComponent.Request_LoadoutInventory // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643a80
	void Request_LeaveProspectByDropship(); // Function Icarus.BackendProxyComponent.Request_LeaveProspectByDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643a60
	void Request_GetUserProfile(); // Function Icarus.BackendProxyComponent.Request_GetUserProfile // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643a40
	void Request_GetNotifications(bool RequestCompleteList); // Function Icarus.BackendProxyComponent.Request_GetNotifications // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x16439b0
	void Request_GetCharacterProfile(int32_t CharSlot); // Function Icarus.BackendProxyComponent.Request_GetCharacterProfile // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643920
	void Request_ExchangeCurrency(struct FCurrencyConversionsRowHandle Conversion, int32_t Iterations); // Function Icarus.BackendProxyComponent.Request_ExchangeCurrency // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643830
	void Request_Dropships(); // Function Icarus.BackendProxyComponent.Request_Dropships // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643810
	void Request_DeleteNotification(struct FString NotificationID); // Function Icarus.BackendProxyComponent.Request_DeleteNotification // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643760
	void Request_DeleteDropship(int32_t Index); // Function Icarus.BackendProxyComponent.Request_DeleteDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x16436d0
	void Request_Credits(); // Function Icarus.BackendProxyComponent.Request_Credits // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x16436b0
	void Request_CreateDropship(); // Function Icarus.BackendProxyComponent.Request_CreateDropship // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643690
	void Request_ClaimProspect(struct FProspectInfo ProspectInfo); // Function Icarus.BackendProxyComponent.Request_ClaimProspect // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643510
	void Request_ClaimNotificationAttachements(struct FString NotificationID); // Function Icarus.BackendProxyComponent.Request_ClaimNotificationAttachements // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643460
	void Request_CharacterLoadout(); // Function Icarus.BackendProxyComponent.Request_CharacterLoadout // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1643440
	void Request_AvailableProspects(); // Function Icarus.BackendProxyComponent.Request_AvailableProspects // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1643420
	void RemoveDropship(int32_t DropshipID); // Function Icarus.BackendProxyComponent.RemoveDropship // (Final|Native|Public) // @ game+0x1643310
	bool RateLimitCheck(enum class ERateLimitedRequests RequestType); // Function Icarus.BackendProxyComponent.RateLimitCheck // (Final|Native|Public) // @ game+0x1643260
	void ProcessSwapInventoryDelta(struct FInventoryDelta& InventoryDelta); // Function Icarus.BackendProxyComponent.ProcessSwapInventoryDelta // (Final|Native|Public|HasOutParms) // @ game+0x1643150
	void ProcessResourceDelta(struct TArray<struct FMetaResource> ResourcesDelta); // Function Icarus.BackendProxyComponent.ProcessResourceDelta // (Final|Native|Public) // @ game+0x1642fd0
	void ProcessInventoryDelta(struct FInventoryDelta& InventoryDelta); // Function Icarus.BackendProxyComponent.ProcessInventoryDelta // (Final|Native|Public|HasOutParms) // @ game+0x1642ec0
	void ProcessDropshipDelta(struct FDropshipDelta DropshipDelta); // Function Icarus.BackendProxyComponent.ProcessDropshipDelta // (Final|Native|Public) // @ game+0x1642980
	void PrepareEnvirosuit(struct UInventory* Inventory, int32_t InventorySlot); // Function Icarus.BackendProxyComponent.PrepareEnvirosuit // (Final|Native|Public|BlueprintCallable) // @ game+0x16428b0
	void PrepareDropship(int32_t Index); // Function Icarus.BackendProxyComponent.PrepareDropship // (Final|Native|Public|BlueprintCallable) // @ game+0x1642820
	void OnUpdateCharacterProspectLocationSuccess(struct FResUpdateCharacterProspectLocation& Response); // Function Icarus.BackendProxyComponent.OnUpdateCharacterProspectLocationSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1642790
	void OnUpdateCharacterProspectLocationFailure(struct FResUpdateCharacterProspectLocation& Response); // Function Icarus.BackendProxyComponent.OnUpdateCharacterProspectLocationFailure // (Final|Native|Public|HasOutParms) // @ game+0x1642700
	void OnUpdateCharacterProgressSuccess(struct FResUpdateCharacterProgress& Response); // Function Icarus.BackendProxyComponent.OnUpdateCharacterProgressSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1642670
	void OnUpdateCharacterProgressFailure(struct FResUpdateCharacterProgress& Response); // Function Icarus.BackendProxyComponent.OnUpdateCharacterProgressFailure // (Final|Native|Public|HasOutParms) // @ game+0x16425e0
	void OnUnpackageLoadoutRequestSuccess(struct FResUnpackageLoadout& Response); // Function Icarus.BackendProxyComponent.OnUnpackageLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1642540
	void OnUnpackageLoadoutRequestFailure(struct FResUnpackageLoadout& Response); // Function Icarus.BackendProxyComponent.OnUnpackageLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x16424a0
	void OnUnlockWorkshopItemSuccess(struct FResUnlockWorkshopItem& Response); // Function Icarus.BackendProxyComponent.OnUnlockWorkshopItemSuccess // (Final|Native|Public|HasOutParms) // @ game+0x16423b0
	void OnUnlockWorkshopItemFailure(struct FResUnlockWorkshopItem& Response); // Function Icarus.BackendProxyComponent.OnUnlockWorkshopItemFailure // (Final|Native|Public|HasOutParms) // @ game+0x16422c0
	void OnTrackedStatsUpdatedSuccess(struct FResUpdateTrackedStats& Response); // Function Icarus.BackendProxyComponent.OnTrackedStatsUpdatedSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1642230
	void OnTrackedStatsUpdatedFailure(struct FResUpdateTrackedStats& Response); // Function Icarus.BackendProxyComponent.OnTrackedStatsUpdatedFailure // (Final|Native|Public|HasOutParms) // @ game+0x16421a0
	void OnTalentRefundSuccess(struct FResTalentRefund& Response); // Function Icarus.BackendProxyComponent.OnTalentRefundSuccess // (Final|Native|Public|HasOutParms) // @ game+0x16420b0
	void OnTalentRefundFailure(struct FResTalentRefund& Response); // Function Icarus.BackendProxyComponent.OnTalentRefundFailure // (Final|Native|Public|HasOutParms) // @ game+0x1641fc0
	void OnSyncCharacterTalentsSuccess(struct FResSyncCharacterTalents& Response); // Function Icarus.BackendProxyComponent.OnSyncCharacterTalentsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641ee0
	void OnSyncCharacterTalentsFailure(struct FResSyncCharacterTalents& Response); // Function Icarus.BackendProxyComponent.OnSyncCharacterTalentsFailure // (Final|Native|Public|HasOutParms) // @ game+0x1641e00
	void OnSyncAccountTalentsSuccess(struct FResSyncAccountTalents& Response); // Function Icarus.BackendProxyComponent.OnSyncAccountTalentsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641d20
	void OnSyncAccountTalentsFailure(struct FResSyncAccountTalents& Response); // Function Icarus.BackendProxyComponent.OnSyncAccountTalentsFailure // (Final|Native|Public|HasOutParms) // @ game+0x1641c40
	void OnShiftMetaItemRequestSuccess(struct FResMoveMetaInventoryItem& Response); // Function Icarus.BackendProxyComponent.OnShiftMetaItemRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641b60
	void OnShiftMetaItemRequestFailure(struct FResMoveMetaInventoryItem& Response); // Function Icarus.BackendProxyComponent.OnShiftMetaItemRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x1641a80
	void OnSettleProspectSuccess(struct FResSettleProspect& Response); // Function Icarus.BackendProxyComponent.OnSettleProspectSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641900
	void OnSettleProspectFailure(struct FResSettleProspect& Response); // Function Icarus.BackendProxyComponent.OnSettleProspectFailure // (Final|Native|Public|HasOutParms) // @ game+0x1641780
	void OnReplicateWorkshopItemSuccess(struct FResReplicateWorkshopItem& Response); // Function Icarus.BackendProxyComponent.OnReplicateWorkshopItemSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641620
	void OnReplicateWorkshopItemFailure(struct FResReplicateWorkshopItem& Response); // Function Icarus.BackendProxyComponent.OnReplicateWorkshopItemFailure // (Final|Native|Public|HasOutParms) // @ game+0x16414c0
	void OnRep_WorkshopPacks(); // Function Icarus.BackendProxyComponent.OnRep_WorkshopPacks // (Final|Native|Public) // @ game+0xe3ae30
	void OnRep_PreparedLoadout(); // Function Icarus.BackendProxyComponent.OnRep_PreparedLoadout // (Final|Native|Public) // @ game+0x16414a0
	void OnRep_PreparedEnvirosuit(); // Function Icarus.BackendProxyComponent.OnRep_PreparedEnvirosuit // (Final|Native|Public) // @ game+0x16414a0
	void OnRep_PreparedDropship(); // Function Icarus.BackendProxyComponent.OnRep_PreparedDropship // (Final|Native|Public) // @ game+0x16414a0
	void OnRep_Notifications(); // Function Icarus.BackendProxyComponent.OnRep_Notifications // (Final|Native|Public) // @ game+0x1641480
	void OnRep_MetaResources(); // Function Icarus.BackendProxyComponent.OnRep_MetaResources // (Final|Native|Public) // @ game+0x1641460
	void OnRep_MetaInventory(); // Function Icarus.BackendProxyComponent.OnRep_MetaInventory // (Final|Native|Public) // @ game+0x1641440
	void OnRep_LoadoutInventory(); // Function Icarus.BackendProxyComponent.OnRep_LoadoutInventory // (Final|Native|Public) // @ game+0x1641420
	void OnRep_Dropships(); // Function Icarus.BackendProxyComponent.OnRep_Dropships // (Final|Native|Public) // @ game+0x1641400
	void OnRep_Credits(); // Function Icarus.BackendProxyComponent.OnRep_Credits // (Final|Native|Public) // @ game+0x16413e0
	void OnRep_CharacterLoadout(); // Function Icarus.BackendProxyComponent.OnRep_CharacterLoadout // (Final|Native|Public) // @ game+0x16413c0
	void OnRep_AvailableProspects(); // Function Icarus.BackendProxyComponent.OnRep_AvailableProspects // (Final|Native|Public) // @ game+0x16413a0
	void OnRemovePreparedEnvirosuitRequestSuccess(struct FResRemoveEnvirosuit& Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedEnvirosuitRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641220
	void OnRemovePreparedEnvirosuitRequestFailure(struct FResRemoveEnvirosuit& Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedEnvirosuitRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x16410a0
	void OnRemovePreparedDropshipRequestSuccess(struct FResRemoveSelectedDropship& Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedDropshipRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1641000
	void OnRemovePreparedDropshipRequestFailure(struct FResRemoveSelectedDropship& Response); // Function Icarus.BackendProxyComponent.OnRemovePreparedDropshipRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x1640f60
	void OnRemoveMetaItemRequestSuccess(struct FResRemoveMetaInventoryItem& Response); // Function Icarus.BackendProxyComponent.OnRemoveMetaItemRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640e40
	void OnRemoveMetaItemRequestFailure(struct FResRemoveMetaInventoryItem& Response); // Function Icarus.BackendProxyComponent.OnRemoveMetaItemRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x1640d20
	void OnReadNotificationSuccess(struct FResReadNotification& Response); // Function Icarus.BackendProxyComponent.OnReadNotificationSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640c70
	void OnReadNotificationFailure(struct FResReadNotification& Response); // Function Icarus.BackendProxyComponent.OnReadNotificationFailure // (Final|Native|Public|HasOutParms) // @ game+0x1640bc0
	void OnPrepareEnvirosuitRequestSuccess(struct FResSelectEnvirosuit& Response); // Function Icarus.BackendProxyComponent.OnPrepareEnvirosuitRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640840
	void OnPrepareEnvirosuitRequestFailure(struct FResSelectEnvirosuit& Response); // Function Icarus.BackendProxyComponent.OnPrepareEnvirosuitRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x16406c0
	void OnPrepareDropshipRequestSuccess(struct FResSelectDropship& Response); // Function Icarus.BackendProxyComponent.OnPrepareDropshipRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640620
	void OnPrepareDropshipRequestFailure(struct FResSelectDropship& Response); // Function Icarus.BackendProxyComponent.OnPrepareDropshipRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x1640580
	void OnPreparedLoadoutRequestSuccess(struct FResPreparedLoadout& Response); // Function Icarus.BackendProxyComponent.OnPreparedLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640ac0
	void OnPreparedLoadoutRequestFailure(struct FResPreparedLoadout& Response); // Function Icarus.BackendProxyComponent.OnPreparedLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x16409c0
	void OnPackageLoadoutRequestFailure(struct FResPackageLoadout& Response); // Function Icarus.BackendProxyComponent.OnPackageLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x16403d0
	void OnOnPackageLoadoutRequestSuccess(struct FResPackageLoadout& Response); // Function Icarus.BackendProxyComponent.OnOnPackageLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640220
	void OnModifyDropshipsRequestSuccess(struct FResModifyDropship& Response); // Function Icarus.BackendProxyComponent.OnModifyDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x1640070
	void OnModifyDropshipsRequestFailure(struct FResModifyDropship& Response); // Function Icarus.BackendProxyComponent.OnModifyDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163fec0
	void OnMetaResourcesRequestSuccess(struct FResGetMetaResources& Response); // Function Icarus.BackendProxyComponent.OnMetaResourcesRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163fde0
	void OnMetaResourcesRequestFailure(struct FResGetMetaResources& Response); // Function Icarus.BackendProxyComponent.OnMetaResourcesRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163fd00
	void OnLoadoutInventoryRequest(struct FResLoadoutInventory& Response); // Function Icarus.BackendProxyComponent.OnLoadoutInventoryRequest // (Final|Native|Public|HasOutParms) // @ game+0x163fbf0
	void OnInventoryRequestSuccess(struct FResGetMetaInventory& Response); // Function Icarus.BackendProxyComponent.OnInventoryRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163fad0
	void OnInventoryRequestFailure(struct FResGetMetaInventory& Response); // Function Icarus.BackendProxyComponent.OnInventoryRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163f9b0
	void OnGetUserProfileSuccess(struct FResGetUserProfile& Response); // Function Icarus.BackendProxyComponent.OnGetUserProfileSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163f860
	void OnGetUserProfileFailure(struct FResGetUserProfile& Response); // Function Icarus.BackendProxyComponent.OnGetUserProfileFailure // (Final|Native|Public|HasOutParms) // @ game+0x163f710
	void OnGetNotificationsSuccess(struct FResGetNotifications& Response); // Function Icarus.BackendProxyComponent.OnGetNotificationsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163f5c0
	void OnGetNotificationsFailure(struct FResGetNotifications& Response); // Function Icarus.BackendProxyComponent.OnGetNotificationsFailure // (Final|Native|Public|HasOutParms) // @ game+0x163f470
	void OnGetDropshipsRequestSuccess(struct FResGetDropships& Response); // Function Icarus.BackendProxyComponent.OnGetDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163f2d0
	void OnGetDropshipsRequestFailure(struct FResGetDropships& Response); // Function Icarus.BackendProxyComponent.OnGetDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163f130
	void OnGetCreditsRequestSuccess(struct FResGetCredits& Response); // Function Icarus.BackendProxyComponent.OnGetCreditsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163f090
	void OnGetCreditsRequestFailure(struct FResGetCredits& Response); // Function Icarus.BackendProxyComponent.OnGetCreditsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163eff0
	void OnGetCharacterProfileSuccess(struct FResGetCharacterProfile& Response); // Function Icarus.BackendProxyComponent.OnGetCharacterProfileSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163ee60
	void OnGetCharacterProfileFailure(struct FResGetCharacterProfile& Response); // Function Icarus.BackendProxyComponent.OnGetCharacterProfileFailure // (Final|Native|Public|HasOutParms) // @ game+0x163ecd0
	void OnGetAllProspectsSuccess(struct FResGetAllProspects& Response); // Function Icarus.BackendProxyComponent.OnGetAllProspectsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163ebb0
	void OnGetAllProspectsFailure(struct FResGetAllProspects& Response); // Function Icarus.BackendProxyComponent.OnGetAllProspectsFailure // (Final|Native|Public|HasOutParms) // @ game+0x163ea90
	void OnFactionMissionUpdateSuccess(struct FResUpdateFactionMissionProgress& Response); // Function Icarus.BackendProxyComponent.OnFactionMissionUpdateSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163ea00
	void OnFactionMissionUpdateFailure(struct FResUpdateFactionMissionProgress& Response); // Function Icarus.BackendProxyComponent.OnFactionMissionUpdateFailure // (Final|Native|Public|HasOutParms) // @ game+0x163e970
	void OnExchangeCurrencySuccess(struct FResExchangeCurrency& Response); // Function Icarus.BackendProxyComponent.OnExchangeCurrencySuccess // (Final|Native|Public|HasOutParms) // @ game+0x163e890
	void OnExchangeCurrencyFailure(struct FResExchangeCurrency& Response); // Function Icarus.BackendProxyComponent.OnExchangeCurrencyFailure // (Final|Native|Public|HasOutParms) // @ game+0x163e7b0
	void OnDeleteNotificationSuccess(struct FResDeleteNotification& Response); // Function Icarus.BackendProxyComponent.OnDeleteNotificationSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163e700
	void OnDeleteNotificationFailure(struct FResDeleteNotification& Response); // Function Icarus.BackendProxyComponent.OnDeleteNotificationFailure // (Final|Native|Public|HasOutParms) // @ game+0x163e650
	void OnDeleteDropshipsRequestSuccess(struct FResDeleteDropship& Response); // Function Icarus.BackendProxyComponent.OnDeleteDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163e530
	void OnDeleteDropshipsRequestFailure(struct FResDeleteDropship& Response); // Function Icarus.BackendProxyComponent.OnDeleteDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163e410
	void OnCreateDropshipsRequestSuccess(struct FResCreateDropship& Response); // Function Icarus.BackendProxyComponent.OnCreateDropshipsRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163e260
	void OnCreateDropshipsRequestFailure(struct FResCreateDropship& Response); // Function Icarus.BackendProxyComponent.OnCreateDropshipsRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163e0b0
	void OnClaimProspectSuccess(struct FResClaimProspect& Response); // Function Icarus.BackendProxyComponent.OnClaimProspectSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163df30
	void OnClaimProspectFailure(struct FResClaimProspect& Response); // Function Icarus.BackendProxyComponent.OnClaimProspectFailure // (Final|Native|Public|HasOutParms) // @ game+0x163ddb0
	void OnClaimNotificationAttachmentsSuccess(struct FResClaimNotificationAttachments& Response); // Function Icarus.BackendProxyComponent.OnClaimNotificationAttachmentsSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163dc40
	void OnClaimNotificationAttachmentsFailure(struct FResClaimNotificationAttachments& Response); // Function Icarus.BackendProxyComponent.OnClaimNotificationAttachmentsFailure // (Final|Native|Public|HasOutParms) // @ game+0x163dad0
	void OnCharacterLoadoutRequestSuccess(struct FResGetCharacterLoadout& Response); // Function Icarus.BackendProxyComponent.OnCharacterLoadoutRequestSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163da20
	void OnCharacterLoadoutRequestFailure(struct FResGetCharacterLoadout& Response); // Function Icarus.BackendProxyComponent.OnCharacterLoadoutRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163d970
	void OnBackToHabSuccess(struct FResBackToHab& Response); // Function Icarus.BackendProxyComponent.OnBackToHabSuccess // (Final|Native|Public|HasOutParms) // @ game+0x163d8e0
	void OnBackToHabFailure(struct FResBackToHab& Response); // Function Icarus.BackendProxyComponent.OnBackToHabFailure // (Final|Native|Public|HasOutParms) // @ game+0x163d850
	void LoadoutInventoryRequestFailure(struct FResLoadoutInventory& Response); // Function Icarus.BackendProxyComponent.LoadoutInventoryRequestFailure // (Final|Native|Public|HasOutParms) // @ game+0x163d190
	struct TArray<struct FProspectInfo> GetProspects(); // Function Icarus.BackendProxyComponent.GetProspects // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cfa0
	struct TArray<struct FNotification> GetNotifications(); // Function Icarus.BackendProxyComponent.GetNotifications // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cf60
	struct TArray<struct FMetaResource> GetMetaResources(); // Function Icarus.BackendProxyComponent.GetMetaResources // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cf20
	struct TArray<struct FMetaItem> GetMetaInventory(); // Function Icarus.BackendProxyComponent.GetMetaInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cee0
	struct TArray<struct FMetaItem> GetLoadoutInventory(); // Function Icarus.BackendProxyComponent.GetLoadoutInventory // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cea0
	struct TArray<struct FDropship> GetDropships(); // Function Icarus.BackendProxyComponent.GetDropships // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163ce60
	int32_t GetCredits(); // Function Icarus.BackendProxyComponent.GetCredits // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163ce30
	struct FCharacterLoadout GetCharacterLoadout(); // Function Icarus.BackendProxyComponent.GetCharacterLoadout // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x163cdf0
	bool CanPerformCurrencyConversion(struct FCurrencyConversionsRowHandle Conversion, int32_t Iterations); // Function Icarus.BackendProxyComponent.CanPerformCurrencyConversion // (Final|Native|Public|BlueprintCallable) // @ game+0x163c810
};

// Class Icarus.BallisticComponent
// Size: 0x3f0 (Inherited: 0xd0)
struct UBallisticComponent : UTraitComponent {
	struct FMulticastSparseDelegate OnFireProjectile; // 0xd0(0x01)
	bool bHasBeenFired; // 0xd1(0x01)
	char pad_D2[0x6]; // 0xd2(0x06)
	struct UIcarusProjectileComponent* ProjectileMovementComponent; // 0xd8(0x08)
	struct USphereComponent* CollisionComponent; // 0xe0(0x08)
	struct FMulticastSparseDelegate OnProjectileHit; // 0xe8(0x01)
	bool bIsProjectileActive; // 0xe9(0x01)
	char pad_EA[0x6]; // 0xea(0x06)
	struct FBallisticData CachedBallisticData; // 0xf0(0x1d8)
	struct AActor* FiringActor; // 0x2c8(0x08)
	char pad_2D0[0x120]; // 0x2d0(0x120)

	void SetProjectileActive(bool Active); // Function Icarus.BallisticComponent.SetProjectileActive // (Final|Native|Public|BlueprintCallable) // @ game+0x164b450
	void ProjectileHit(struct FHitResult& Hit); // Function Icarus.BallisticComponent.ProjectileHit // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x164ad50
	void ProjectileBounce(struct FHitResult& Hit, struct FVector& ImpactVelocity); // Function Icarus.BallisticComponent.ProjectileBounce // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x164ac20
	void OnRep_bIsProjectileActive(); // Function Icarus.BallisticComponent.OnRep_bIsProjectileActive // (Final|Native|Protected) // @ game+0x164ac00
	void OnProjectileDeactivated(); // Function Icarus.BallisticComponent.OnProjectileDeactivated // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1613bb0
	void OnProjectileActivated(); // Function Icarus.BallisticComponent.OnProjectileActivated // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1613f90
	struct FStatContainer GetDamageStatContainer(); // Function Icarus.BallisticComponent.GetDamageStatContainer // (Final|Native|Public) // @ game+0x1649bf0
	int32_t GetDamageStat(struct FStatsEnum InStat); // Function Icarus.BallisticComponent.GetDamageStat // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1649b40
	bool GetBallisticData(struct FBallisticData& OutData); // Function Icarus.BallisticComponent.GetBallisticData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16496c0
	void FireProjectile_Internal(struct FVector Impulse, struct FVector InstigatorVelocity, struct FProjectileFireParams AdvancedParameters, struct AActor* FiredBy); // Function Icarus.BallisticComponent.FireProjectile_Internal // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x1649550
	void FireProjectile(struct FVector Impulse, struct FVector InstigatorVelocity, struct FProjectileFireParams AdvancedParameters, struct AActor* Instigator); // Function Icarus.BallisticComponent.FireProjectile // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|BlueprintCallable) // @ game+0x16493e0
	bool CleanupBallistic(); // Function Icarus.BallisticComponent.CleanupBallistic // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1613120
	void CheckWithinCullDistance(); // Function Icarus.BallisticComponent.CheckWithinCullDistance // (Final|Native|Protected) // @ game+0x1648d60
};

// Class Icarus.BallisticLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBallisticLibrary : URowLibrary {

	struct FBallisticRowHandle StructToRowHandle(struct FBallisticEnum EnumValue); // Function Icarus.BallisticLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b760
	struct UE4::FName StructToName(struct FBallisticEnum EnumValue); // Function Icarus.BallisticLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b620
	int32_t StructToInt(struct FBallisticEnum EnumValue); // Function Icarus.BallisticLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b4e0
	struct FBallisticEnum RowHandleToStruct(struct FBallisticRowHandle RowHandle); // Function Icarus.BallisticLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b200
	void RemoveRowFromBallisticTable(struct UE4::FName Name); // Function Icarus.BallisticLibrary.RemoveRowFromBallisticTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x164ae70
	void RefreshConstants(); // Function Icarus.BallisticLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x164ae30
	int32_t NumRows(); // Function Icarus.BallisticLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164aba0
	bool NotEqual_EnumName(struct FBallisticEnum A, struct UE4::FName B); // Function Icarus.BallisticLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a9c0
	bool NotEqual_EnumEnum(struct FBallisticEnum A, struct FBallisticEnum B); // Function Icarus.BallisticLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a7e0
	struct FBallisticEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BallisticLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a6c0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BallisticLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x164a5a0
	struct FBallisticRowHandle MakeLiteralBallistic(struct FBallisticRowHandle RowHandle); // Function Icarus.BallisticLibrary.MakeLiteralBallistic // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a400
	struct FBallisticRowHandle MakeBallisticFromIndex(int32_t Index); // Function Icarus.BallisticLibrary.MakeBallisticFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a130
	struct FBallisticEnum MakeBallisticEnum(struct FBallisticEnum Enum); // Function Icarus.BallisticLibrary.MakeBallisticEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a0b0
	struct FBallisticRowHandle MakeBallistic(struct UE4::FName RowName); // Function Icarus.BallisticLibrary.MakeBallistic // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a010
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BallisticLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1649ef0
	struct FBallisticEnum IntToStruct(int32_t IntValue); // Function Icarus.BallisticLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1649dd0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BallisticLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1649cb0
	void GetBallisticStruct(struct FBallisticRowHandle RowHandle, struct FBallisticData& Ballistic, enum class EValid& Paths); // Function Icarus.BallisticLibrary.GetBallisticStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1649820
	bool EqualEqual_FBallisticRowHandleFBallisticRowHandle(struct FBallisticRowHandle RowHandleA, struct FBallisticRowHandle RowHandleB); // Function Icarus.BallisticLibrary.EqualEqual_FBallisticRowHandleFBallisticRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16490d0
	bool EqualEqual_EnumEnum(struct FBallisticEnum A, struct FBallisticEnum B); // Function Icarus.BallisticLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1648ef0
	struct FBallisticRowHandle CastToBallisticRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BallisticLibrary.CastToBallisticRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1648b20
	void BreakBallisticEnum(struct FBallisticEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BallisticLibrary.BreakBallisticEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1648700
	void AddRowToBallisticTable(struct UE4::FName Name, struct FBallisticData Data, struct FBallisticRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BallisticLibrary.AddRowToBallisticTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16482d0
};

// Class Icarus.BallisticPoolManager
// Size: 0x100 (Inherited: 0xb0)
struct UBallisticPoolManager : UActorComponent {
	char pad_B0[0x50]; // 0xb0(0x50)

	struct AIcarusItem* RequestProjectile(struct FItemData& ProjectileData, struct FTransform& SpawnTransform, struct AActor* Owner); // Function Icarus.BallisticPoolManager.RequestProjectile // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x164af70
	void DestroyProjectile(struct AIcarusItem* InProjectile, bool bSkipPoolRemoval); // Function Icarus.BallisticPoolManager.DestroyProjectile // (Final|Native|Public|BlueprintCallable) // @ game+0x1648e20
	bool DeactivateProjectile(struct AIcarusItem* InProjectile); // Function Icarus.BallisticPoolManager.DeactivateProjectile // (Final|Native|Public|BlueprintCallable) // @ game+0x1648d80
};

// Class Icarus.BallisticTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBallisticTable : UIcarusDataTable {
};

// Class Icarus.StatsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UStatsLibrary : URowLibrary {

	struct FStatsRowHandle StructToRowHandle(struct FStatsEnum EnumValue); // Function Icarus.StatsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1852da0
	struct UE4::FName StructToName(struct FStatsEnum EnumValue); // Function Icarus.StatsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1852c60
	int32_t StructToInt(struct FStatsEnum EnumValue); // Function Icarus.StatsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1852b20
	struct FStatsEnum RowHandleToStruct(struct FStatsRowHandle RowHandle); // Function Icarus.StatsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1852830
	void RemoveRowFromStatsTable(struct UE4::FName Name); // Function Icarus.StatsLibrary.RemoveRowFromStatsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1852640
	void RefreshConstants(); // Function Icarus.StatsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1852600
	int32_t NumRows(); // Function Icarus.StatsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18522c0
	bool NotEqual_EnumName(struct FStatsEnum A, struct UE4::FName B); // Function Icarus.StatsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18520e0
	bool NotEqual_EnumEnum(struct FStatsEnum A, struct FStatsEnum B); // Function Icarus.StatsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1851f00
	struct FStatsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.StatsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1851de0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.StatsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1851cc0
	struct FStatsRowHandle MakeStatsFromIndex(int32_t Index); // Function Icarus.StatsLibrary.MakeStatsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1851910
	struct FStatsEnum MakeStatsEnum(struct FStatsEnum Enum); // Function Icarus.StatsLibrary.MakeStatsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1851890
	struct FStatsRowHandle MakeStats(struct UE4::FName RowName); // Function Icarus.StatsLibrary.MakeStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x18517f0
	struct FStatsRowHandle MakeLiteralStats(struct FStatsRowHandle RowHandle); // Function Icarus.StatsLibrary.MakeLiteralStats // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1851650
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.StatsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1851530
	struct FStatsEnum IntToStruct(int32_t IntValue); // Function Icarus.StatsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1851410
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.StatsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x18512f0
	void GetStatsStruct(struct FStatsRowHandle RowHandle, struct FIcarusStatDescription& Stats, enum class EValid& Paths); // Function Icarus.StatsLibrary.GetStatsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1850c20
	bool EqualEqual_FStatsRowHandleFStatsRowHandle(struct FStatsRowHandle RowHandleA, struct FStatsRowHandle RowHandleB); // Function Icarus.StatsLibrary.EqualEqual_FStatsRowHandleFStatsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1850320
	bool EqualEqual_EnumEnum(struct FStatsEnum A, struct FStatsEnum B); // Function Icarus.StatsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1850140
	struct FStatsRowHandle CastToStatsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.StatsLibrary.CastToStatsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x184fd50
	void BreakStatsEnum(struct FStatsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.StatsLibrary.BreakStatsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x184fa90
	void AddRowToStatsTable(struct UE4::FName Name, struct FIcarusStatDescription Data, struct FStatsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.StatsLibrary.AddRowToStatsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x184f6e0
};

// Class Icarus.BaseStatsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBaseStatsLibrary : UStatsLibrary {

	struct FBaseStatsEnum MakeBaseStatsEnum(struct FBaseStatsEnum Enum); // Function Icarus.BaseStatsLibrary.MakeBaseStatsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a1c0
	bool Filter(int32_t Index); // Function Icarus.BaseStatsLibrary.Filter // (Final|Native|Static|Public) // @ game+0x1649350
	void BreakBaseStatsEnum(struct FBaseStatsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BaseStatsLibrary.BreakBaseStatsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1648860
};

// Class Icarus.BedRecorderInterface
// Size: 0x28 (Inherited: 0x28)
struct UBedRecorderInterface : UInterface {

	void SetPlayerUIDArray(struct TArray<struct FString>& PlayerUIDArray); // Function Icarus.BedRecorderInterface.SetPlayerUIDArray // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x164b380
	struct TArray<struct FString> GetPlayerUIDArray(); // Function Icarus.BedRecorderInterface.GetPlayerUIDArray // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1649c30
};

// Class Icarus.ItemStateRecorderComponent
// Size: 0x1c0 (Inherited: 0x160)
struct UItemStateRecorderComponent : UActorStateRecorderComponent {
	struct UE4::FName StaticItemDataRowName; // 0x158(0x08)
	struct FString DatabaseGUID; // 0x160(0x10)
	struct TArray<struct FItemRecordDynamicData> DynamicData; // 0x170(0x10)
	struct TArray<struct FItemRecordStatData> Stats; // 0x180(0x10)
	enum class EIcarusItemContext SpawnedContext; // 0x190(0x01)
	struct FIcarusItemConstructionParameters ConstructionParameters; // 0x198(0x28)
};

// Class Icarus.DeployableRecorderComponent
// Size: 0x1e0 (Inherited: 0x1c0)
struct UDeployableRecorderComponent : UItemStateRecorderComponent {
	struct FDeployableRecord DeployableRecord; // 0x1c0(0x20)
};

// Class Icarus.BedRecorderComponent
// Size: 0x1f0 (Inherited: 0x1e0)
struct UBedRecorderComponent : UDeployableRecorderComponent {
	struct TArray<struct FString> PlayerUIDArrayRecord; // 0x1e0(0x10)
};

// Class Icarus.BiomeAudioDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBiomeAudioDataLibrary : URowLibrary {

	struct FBiomeAudioDataRowHandle StructToRowHandle(struct FBiomeAudioDataEnum EnumValue); // Function Icarus.BiomeAudioDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b810
	struct UE4::FName StructToName(struct FBiomeAudioDataEnum EnumValue); // Function Icarus.BiomeAudioDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b6c0
	int32_t StructToInt(struct FBiomeAudioDataEnum EnumValue); // Function Icarus.BiomeAudioDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b580
	struct FBiomeAudioDataEnum RowHandleToStruct(struct FBiomeAudioDataRowHandle RowHandle); // Function Icarus.BiomeAudioDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164b2c0
	void RemoveRowFromBiomeAudioDataTable(struct UE4::FName Name); // Function Icarus.BiomeAudioDataLibrary.RemoveRowFromBiomeAudioDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x164aef0
	void RefreshConstants(); // Function Icarus.BiomeAudioDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x164ae50
	int32_t NumRows(); // Function Icarus.BiomeAudioDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164abd0
	bool NotEqual_EnumName(struct FBiomeAudioDataEnum A, struct UE4::FName B); // Function Icarus.BiomeAudioDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164aab0
	bool NotEqual_EnumEnum(struct FBiomeAudioDataEnum A, struct FBiomeAudioDataEnum B); // Function Icarus.BiomeAudioDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a8d0
	struct FBiomeAudioDataEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BiomeAudioDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a750
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BiomeAudioDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x164a630
	struct FBiomeAudioDataRowHandle MakeLiteralBiomeAudioData(struct FBiomeAudioDataRowHandle RowHandle); // Function Icarus.BiomeAudioDataLibrary.MakeLiteralBiomeAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a4d0
	struct FBiomeAudioDataRowHandle MakeBiomeAudioDataFromIndex(int32_t Index); // Function Icarus.BiomeAudioDataLibrary.MakeBiomeAudioDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a370
	struct FBiomeAudioDataEnum MakeBiomeAudioDataEnum(struct FBiomeAudioDataEnum Enum); // Function Icarus.BiomeAudioDataLibrary.MakeBiomeAudioDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a2f0
	struct FBiomeAudioDataRowHandle MakeBiomeAudioData(struct UE4::FName RowName); // Function Icarus.BiomeAudioDataLibrary.MakeBiomeAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x164a250
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BiomeAudioDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1649f80
	struct FBiomeAudioDataEnum IntToStruct(int32_t IntValue); // Function Icarus.BiomeAudioDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1649e60
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BiomeAudioDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1649d40
	void GetBiomeAudioDataStruct(struct FBiomeAudioDataRowHandle RowHandle, struct FBiomeAudioData& BiomeAudioData, enum class EValid& Paths); // Function Icarus.BiomeAudioDataLibrary.GetBiomeAudioDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16499a0
	bool EqualEqual_FBiomeAudioDataRowHandleFBiomeAudioDataRowHandle(struct FBiomeAudioDataRowHandle RowHandleA, struct FBiomeAudioDataRowHandle RowHandleB); // Function Icarus.BiomeAudioDataLibrary.EqualEqual_FBiomeAudioDataRowHandleFBiomeAudioDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1649210
	bool EqualEqual_EnumEnum(struct FBiomeAudioDataEnum A, struct FBiomeAudioDataEnum B); // Function Icarus.BiomeAudioDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1648fe0
	struct FBiomeAudioDataRowHandle CastToBiomeAudioDataRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BiomeAudioDataLibrary.CastToBiomeAudioDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1648c40
	void BreakBiomeAudioDataEnum(struct FBiomeAudioDataEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BiomeAudioDataLibrary.BreakBiomeAudioDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16489c0
	void AddRowToBiomeAudioDataTable(struct UE4::FName Name, struct FBiomeAudioData Data, struct FBiomeAudioDataRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BiomeAudioDataLibrary.AddRowToBiomeAudioDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16484a0
};

// Class Icarus.BiomeAudioDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBiomeAudioDataTable : UIcarusDataTable {
};

// Class Icarus.BiomesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBiomesLibrary : URowLibrary {

	struct FBiomesRowHandle StructToRowHandle(struct FBiomesEnum EnumValue); // Function Icarus.BiomesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652ca0
	struct UE4::FName StructToName(struct FBiomesEnum EnumValue); // Function Icarus.BiomesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652ac0
	int32_t StructToInt(struct FBiomesEnum EnumValue); // Function Icarus.BiomesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16528e0
	struct FBiomesEnum RowHandleToStruct(struct FBiomesRowHandle RowHandle); // Function Icarus.BiomesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16526a0
	void RemoveRowFromBiomesTable(struct UE4::FName Name); // Function Icarus.BiomesLibrary.RemoveRowFromBiomesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1652520
	void RefreshConstants(); // Function Icarus.BiomesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16524c0
	int32_t NumRows(); // Function Icarus.BiomesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652430
	bool NotEqual_EnumName(struct FBiomesEnum A, struct UE4::FName B); // Function Icarus.BiomesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652160
	bool NotEqual_EnumEnum(struct FBiomesEnum A, struct FBiomesEnum B); // Function Icarus.BiomesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651e90
	struct FBiomesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BiomesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651ce0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BiomesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1651b30
	struct FBiomesRowHandle MakeLiteralBiomes(struct FBiomesRowHandle RowHandle); // Function Icarus.BiomesLibrary.MakeLiteralBiomes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16518c0
	struct FBiomesRowHandle MakeBiomesRowFromColor(struct FColor& InColor); // Function Icarus.BiomesLibrary.MakeBiomesRowFromColor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x16514c0
	struct FBiomesRowHandle MakeBiomesFromIndex(int32_t Index); // Function Icarus.BiomesLibrary.MakeBiomesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651430
	struct FBiomesEnum MakeBiomesEnum(struct FBiomesEnum Enum); // Function Icarus.BiomesLibrary.MakeBiomesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16513b0
	struct FBiomesRowHandle MakeBiomes(struct UE4::FName RowName); // Function Icarus.BiomesLibrary.MakeBiomes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651310
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BiomesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1651160
	struct FBiomesEnum IntToStruct(int32_t IntValue); // Function Icarus.BiomesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1650fb0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BiomesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1650e00
	void GetBiomesStruct(struct FBiomesRowHandle RowHandle, struct FIcarusBiome& Biomes, enum class EValid& Paths); // Function Icarus.BiomesLibrary.GetBiomesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1650900
	bool EqualEqual_FBiomesRowHandleFBiomesRowHandle(struct FBiomesRowHandle RowHandleA, struct FBiomesRowHandle RowHandleB); // Function Icarus.BiomesLibrary.EqualEqual_FBiomesRowHandleFBiomesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1650540
	bool EqualEqual_EnumEnum(struct FBiomesEnum A, struct FBiomesEnum B); // Function Icarus.BiomesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1650270
	struct FBiomesRowHandle CastToBiomesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BiomesLibrary.CastToBiomesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x164ff10
	void BreakBiomesEnum(struct FBiomesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BiomesLibrary.BreakBiomesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x164faf0
	void AddRowToBiomesTable(struct UE4::FName Name, struct FIcarusBiome Data, struct FBiomesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BiomesLibrary.AddRowToBiomesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x164f250
};

// Class Icarus.BiomesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBiomesTable : UIcarusDataTable {
};

// Class Icarus.BlockerSpawnerRecorderComponent
// Size: 0x180 (Inherited: 0x160)
struct UBlockerSpawnerRecorderComponent : UActorStateRecorderComponent {
	bool bHasSpawned; // 0x158(0x01)
	struct FPersistentBlockerRecord PersistentBlockerRecord; // 0x160(0x20)
};

// Class Icarus.TalentControllerComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UTalentControllerComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnModelViewChangedEvent; // 0xb8(0x10)
	struct UTalentModelInterface* Model; // 0xc8(0x08)
	struct UTalentViewInterface* View; // 0xd0(0x08)
	char pad_D8[0x20]; // 0xd8(0x20)

	void TriggerModelStateRefresh(); // Function Icarus.TalentControllerComponent.TriggerModelStateRefresh // (Final|Native|Protected) // @ game+0x185ec20
	void Setup(); // Function Icarus.TalentControllerComponent.Setup // (Native|Public) // @ game+0x185ea10
	void OnSessionFlagsUpdated(); // Function Icarus.TalentControllerComponent.OnSessionFlagsUpdated // (Final|Native|Protected) // @ game+0x185e390
	void OnModelViewChanged(struct UTalentModelInterface* InModel, struct UTalentViewInterface* InView); // Function Icarus.TalentControllerComponent.OnModelViewChanged // (Event|Public|BlueprintEvent) // @ game+0x1be0000
	void OnLevelUp(); // Function Icarus.TalentControllerComponent.OnLevelUp // (Final|Native|Protected) // @ game+0x185e3b0
	void OnCharacterFlagsUpdated(); // Function Icarus.TalentControllerComponent.OnCharacterFlagsUpdated // (Final|Native|Protected) // @ game+0x185e390
	void OnAccountFlagsUpdated(); // Function Icarus.TalentControllerComponent.OnAccountFlagsUpdated // (Final|Native|Protected) // @ game+0x185e390
	void NativeModelStateChanged(struct UTalentModelInterface_Const* InModel); // Function Icarus.TalentControllerComponent.NativeModelStateChanged // (Final|Native|Public) // @ game+0x185e0f0
};

// Class Icarus.BlueprintTalentControllerComponent
// Size: 0xf8 (Inherited: 0xf8)
struct UBlueprintTalentControllerComponent : UTalentControllerComponent {
};

// Class Icarus.TalentModelInterface_Const
// Size: 0xe8 (Inherited: 0x28)
struct UTalentModelInterface_Const : UObject {
	struct FMulticastInlineDelegate OnModelStateChanged; // 0x28(0x10)
	struct FMulticastInlineDelegate OnModelTalentStateChanged; // 0x38(0x10)
	char pad_48[0xa0]; // 0x48(0xa0)

	void OnModelViewChanged(struct UTalentModelInterface* InModel, struct UTalentViewInterface* InView); // Function Icarus.TalentModelInterface_Const.OnModelViewChanged // (Event|Public|BlueprintEvent) // @ game+0x1be0000
	bool IsTalentUnlocked(struct FTalentsRowHandle& Talent); // Function Icarus.TalentModelInterface_Const.IsTalentUnlocked // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185dc10
	int32_t GetTotalTalentsForTree(struct FTalentTreesRowHandle& TalentTree); // Function Icarus.TalentModelInterface_Const.GetTotalTalentsForTree // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d8b0
	int32_t GetTotalPoints(); // Function Icarus.TalentModelInterface_Const.GetTotalPoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d880
	struct TArray<struct FTalentTreesRowHandle> GetTalentTreesForArchetype(struct FTalentArchetypesRowHandle Archetype); // Function Icarus.TalentModelInterface_Const.GetTalentTreesForArchetype // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d5e0
	struct TArray<struct FTalentTreesRowHandle> GetTalentTrees(); // Function Icarus.TalentModelInterface_Const.GetTalentTrees // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d540
	bool GetTalentState(struct FTalentsRowHandle& Talent, struct FTalentModelData& OutData); // Function Icarus.TalentModelInterface_Const.GetTalentState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d350
	struct TArray<struct FTalentsRowHandle> GetTalents(); // Function Icarus.TalentModelInterface_Const.GetTalents // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d6e0
	int32_t GetTalentRank(struct FTalentsRowHandle& Talent); // Function Icarus.TalentModelInterface_Const.GetTalentRank // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185d1d0
	int32_t GetSpentPointsForTree(struct FTalentTreesRowHandle& TalentTree); // Function Icarus.TalentModelInterface_Const.GetSpentPointsForTree // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cf70
	int32_t GetSpentPoints(); // Function Icarus.TalentModelInterface_Const.GetSpentPoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cf40
	int32_t GetPointsForLevel(int32_t InLevel); // Function Icarus.TalentModelInterface_Const.GetPointsForLevel // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cdd0
	struct FTalentModelsRowHandle GetModelRowHandle(); // Function Icarus.TalentModelInterface_Const.GetModelRowHandle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cc80
	struct FTalentModelsRowHandle GetModelData(); // Function Icarus.TalentModelInterface_Const.GetModelData // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cc40
	int32_t GetLevel(); // Function Icarus.TalentModelInterface_Const.GetLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cb10
	struct TScriptInterface<ITalentControllerInterface> GetController(); // Function Icarus.TalentModelInterface_Const.GetController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185cad0
	int32_t GetAvailablePoints(); // Function Icarus.TalentModelInterface_Const.GetAvailablePoints // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185caa0
	struct TArray<struct FTalentArchetypesRowHandle> GetArchetypes(); // Function Icarus.TalentModelInterface_Const.GetArchetypes // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x185ca00
	bool DoesModelContainTalent(struct FTalentsRowHandle& Talent); // Function Icarus.TalentModelInterface_Const.DoesModelContainTalent // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185c630
	bool CanUnlockTalent(struct FTalentsRowHandle& Talent, int32_t Rank); // Function Icarus.TalentModelInterface_Const.CanUnlockTalent // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x185c410
};

// Class Icarus.TalentModelInterface
// Size: 0xe8 (Inherited: 0xe8)
struct UTalentModelInterface : UTalentModelInterface_Const {

	void SetLevel(int32_t InLevel); // Function Icarus.TalentModelInterface.SetLevel // (Final|Native|Public|BlueprintCallable) // @ game+0x185e740
	void SetController(struct TScriptInterface<ITalentControllerInterface>& InController); // Function Icarus.TalentModelInterface.SetController // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x185e610
	void ResetTalents(); // Function Icarus.TalentModelInterface.ResetTalents // (Final|Native|Public|BlueprintCallable) // @ game+0x185e530
};

// Class Icarus.BlueprintTalentModel
// Size: 0xe8 (Inherited: 0xe8)
struct UBlueprintTalentModel : UTalentModelInterface {
};

// Class Icarus.BlueprintUnlocksLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintUnlocksLibrary : URowLibrary {

	struct FBlueprintUnlocksRowHandle StructToRowHandle(struct FBlueprintUnlocksEnum EnumValue); // Function Icarus.BlueprintUnlocksLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652d50
	struct UE4::FName StructToName(struct FBlueprintUnlocksEnum EnumValue); // Function Icarus.BlueprintUnlocksLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652b60
	int32_t StructToInt(struct FBlueprintUnlocksEnum EnumValue); // Function Icarus.BlueprintUnlocksLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652980
	struct FBlueprintUnlocksEnum RowHandleToStruct(struct FBlueprintUnlocksRowHandle RowHandle); // Function Icarus.BlueprintUnlocksLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652760
	void RemoveRowFromBlueprintUnlocksTable(struct UE4::FName Name); // Function Icarus.BlueprintUnlocksLibrary.RemoveRowFromBlueprintUnlocksTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16525a0
	void RefreshConstants(); // Function Icarus.BlueprintUnlocksLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16524e0
	int32_t NumRows(); // Function Icarus.BlueprintUnlocksLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652460
	bool NotEqual_EnumName(struct FBlueprintUnlocksEnum A, struct UE4::FName B); // Function Icarus.BlueprintUnlocksLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652250
	bool NotEqual_EnumEnum(struct FBlueprintUnlocksEnum A, struct FBlueprintUnlocksEnum B); // Function Icarus.BlueprintUnlocksLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651f80
	struct FBlueprintUnlocksEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BlueprintUnlocksLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651d70
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BlueprintUnlocksLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1651bc0
	struct FBlueprintUnlocksRowHandle MakeLiteralBlueprintUnlocks(struct FBlueprintUnlocksRowHandle RowHandle); // Function Icarus.BlueprintUnlocksLibrary.MakeLiteralBlueprintUnlocks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651990
	struct FBlueprintUnlocksRowHandle MakeBlueprintUnlocksFromIndex(int32_t Index); // Function Icarus.BlueprintUnlocksLibrary.MakeBlueprintUnlocksFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651680
	struct FBlueprintUnlocksEnum MakeBlueprintUnlocksEnum(struct FBlueprintUnlocksEnum Enum); // Function Icarus.BlueprintUnlocksLibrary.MakeBlueprintUnlocksEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651600
	struct FBlueprintUnlocksRowHandle MakeBlueprintUnlocks(struct UE4::FName RowName); // Function Icarus.BlueprintUnlocksLibrary.MakeBlueprintUnlocks // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651560
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BlueprintUnlocksLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16511f0
	struct FBlueprintUnlocksEnum IntToStruct(int32_t IntValue); // Function Icarus.BlueprintUnlocksLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651040
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BlueprintUnlocksLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1650e90
	void GetBlueprintUnlocksStruct(struct FBlueprintUnlocksRowHandle RowHandle, struct FBlueprintUnlock& BlueprintUnlocks, enum class EValid& Paths); // Function Icarus.BlueprintUnlocksLibrary.GetBlueprintUnlocksStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1650ab0
	bool EqualEqual_FBlueprintUnlocksRowHandleFBlueprintUnlocksRowHandle(struct FBlueprintUnlocksRowHandle RowHandleA, struct FBlueprintUnlocksRowHandle RowHandleB); // Function Icarus.BlueprintUnlocksLibrary.EqualEqual_FBlueprintUnlocksRowHandleFBlueprintUnlocksRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1650680
	bool EqualEqual_EnumEnum(struct FBlueprintUnlocksEnum A, struct FBlueprintUnlocksEnum B); // Function Icarus.BlueprintUnlocksLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1650360
	struct FBlueprintUnlocksRowHandle CastToBlueprintUnlocksRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BlueprintUnlocksLibrary.CastToBlueprintUnlocksRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1650030
	void BreakBlueprintUnlocksEnum(struct FBlueprintUnlocksEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BlueprintUnlocksLibrary.BreakBlueprintUnlocksEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x164fc50
	void AddRowToBlueprintUnlocksTable(struct UE4::FName Name, struct FBlueprintUnlock Data, struct FBlueprintUnlocksRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BlueprintUnlocksLibrary.AddRowToBlueprintUnlocksTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x164f4e0
};

// Class Icarus.BlueprintUnlocksTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBlueprintUnlocksTable : UIcarusDataTable {
};

// Class Icarus.BTComposite_SelectPseudoRandom
// Size: 0xb0 (Inherited: 0x90)
struct UBTComposite_SelectPseudoRandom : UBTCompositeNode {
	bool bAlreadyRan; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct TArray<int32_t> PossibleChildren; // 0x98(0x10)
	int32_t LastChild; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Icarus.BTComposite_SelectRandom
// Size: 0x98 (Inherited: 0x90)
struct UBTComposite_SelectRandom : UBTCompositeNode {
	bool bAlreadyRan; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// Class Icarus.BTComposite_SequenceLoop
// Size: 0xa0 (Inherited: 0x90)
struct UBTComposite_SequenceLoop : UBTComposite_Sequence {
	int32_t LoopCount; // 0x90(0x04)
	int32_t LoopDeviation; // 0x94(0x04)
	int32_t CurrentLoopCount; // 0x98(0x04)
	int32_t ActiveLoopCount; // 0x9c(0x04)
};

// Class Icarus.BTD_CustomTagCooldown
// Size: 0x90 (Inherited: 0x68)
struct UBTD_CustomTagCooldown : UBTDecorator {
	struct FGameplayTag CooldownTag; // 0x68(0x08)
	struct FStatsEnum ActionsPerMinuteStat; // 0x70(0x10)
	float DefaultCooldownDuration; // 0x80(0x04)
	bool bAddToExistingDuration; // 0x84(0x01)
	bool bActivatesCooldown; // 0x85(0x01)
	char pad_86[0xa]; // 0x86(0x0a)
};

// Class Icarus.BTT_ExecuteFunction
// Size: 0xe0 (Inherited: 0x98)
struct UBTT_ExecuteFunction : UBTTask_BlackboardBase {
	struct FFunctionContext FunctionContext; // 0x98(0x18)
	struct FBlackboardKeySelector Target; // 0xb0(0x28)
	bool bReturnSuccessIfInvalid; // 0xd8(0x01)
	char pad_D9[0x7]; // 0xd9(0x07)
};

// Class Icarus.BTTask_IcarusMoveTo
// Size: 0xe0 (Inherited: 0xb0)
struct UBTTask_IcarusMoveTo : UBTTask_MoveTo {
	bool bUseBlackboardDefinedAcceptanceRadius; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FBlackboardKeySelector AcceptableRadiusKey; // 0xb8(0x28)
};

// Class Icarus.BuildableAudioDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuildableAudioDataLibrary : URowLibrary {

	struct FBuildableAudioDataRowHandle StructToRowHandle(struct FBuildableAudioDataEnum EnumValue); // Function Icarus.BuildableAudioDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652e00
	struct UE4::FName StructToName(struct FBuildableAudioDataEnum EnumValue); // Function Icarus.BuildableAudioDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652c00
	int32_t StructToInt(struct FBuildableAudioDataEnum EnumValue); // Function Icarus.BuildableAudioDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652a20
	struct FBuildableAudioDataEnum RowHandleToStruct(struct FBuildableAudioDataRowHandle RowHandle); // Function Icarus.BuildableAudioDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652820
	void RemoveRowFromBuildableAudioDataTable(struct UE4::FName Name); // Function Icarus.BuildableAudioDataLibrary.RemoveRowFromBuildableAudioDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1652620
	void RefreshConstants(); // Function Icarus.BuildableAudioDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1652500
	int32_t NumRows(); // Function Icarus.BuildableAudioDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652490
	bool NotEqual_EnumName(struct FBuildableAudioDataEnum A, struct UE4::FName B); // Function Icarus.BuildableAudioDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652340
	bool NotEqual_EnumEnum(struct FBuildableAudioDataEnum A, struct FBuildableAudioDataEnum B); // Function Icarus.BuildableAudioDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1652070
	struct FBuildableAudioDataEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BuildableAudioDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651e00
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BuildableAudioDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1651c50
	struct FBuildableAudioDataRowHandle MakeLiteralBuildableAudioData(struct FBuildableAudioDataRowHandle RowHandle); // Function Icarus.BuildableAudioDataLibrary.MakeLiteralBuildableAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651a60
	struct FBuildableAudioDataRowHandle MakeBuildableAudioDataFromIndex(int32_t Index); // Function Icarus.BuildableAudioDataLibrary.MakeBuildableAudioDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651830
	struct FBuildableAudioDataEnum MakeBuildableAudioDataEnum(struct FBuildableAudioDataEnum Enum); // Function Icarus.BuildableAudioDataLibrary.MakeBuildableAudioDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16517b0
	struct FBuildableAudioDataRowHandle MakeBuildableAudioData(struct UE4::FName RowName); // Function Icarus.BuildableAudioDataLibrary.MakeBuildableAudioData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1651710
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BuildableAudioDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1651280
	struct FBuildableAudioDataEnum IntToStruct(int32_t IntValue); // Function Icarus.BuildableAudioDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16510d0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BuildableAudioDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1650f20
	void GetBuildableAudioDataStruct(struct FBuildableAudioDataRowHandle RowHandle, struct FBuildableAudioData& BuildableAudioData, enum class EValid& Paths); // Function Icarus.BuildableAudioDataLibrary.GetBuildableAudioDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1650c80
	bool EqualEqual_FBuildableAudioDataRowHandleFBuildableAudioDataRowHandle(struct FBuildableAudioDataRowHandle RowHandleA, struct FBuildableAudioDataRowHandle RowHandleB); // Function Icarus.BuildableAudioDataLibrary.EqualEqual_FBuildableAudioDataRowHandleFBuildableAudioDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16507c0
	bool EqualEqual_EnumEnum(struct FBuildableAudioDataEnum A, struct FBuildableAudioDataEnum B); // Function Icarus.BuildableAudioDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1650450
	struct FBuildableAudioDataRowHandle CastToBuildableAudioDataRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BuildableAudioDataLibrary.CastToBuildableAudioDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1650150
	void BreakBuildableAudioDataEnum(struct FBuildableAudioDataEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BuildableAudioDataLibrary.BreakBuildableAudioDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x164fdb0
	void AddRowToBuildableAudioDataTable(struct UE4::FName Name, struct FBuildableAudioData Data, struct FBuildableAudioDataRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BuildableAudioDataLibrary.AddRowToBuildableAudioDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x164f810
};

// Class Icarus.BuildableAudioDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBuildableAudioDataTable : UIcarusDataTable {
};

// Class Icarus.BuildableComponent
// Size: 0xe0 (Inherited: 0xd0)
struct UBuildableComponent : UTraitComponent {
	struct AIcarusActor* ClassToBuild; // 0xd0(0x08)
	int32_t Variation; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)

	void SetVariation(int32_t NewVariation); // Function Icarus.BuildableComponent.SetVariation // (Final|Native|Public|BlueprintCallable) // @ game+0x16595a0
	bool GetBuildableData(struct FBuildableData& OutData); // Function Icarus.BuildableComponent.GetBuildableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1657d90
};

// Class Icarus.BuildableLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuildableLibrary : URowLibrary {

	struct FBuildableRowHandle StructToRowHandle(struct FBuildableEnum EnumValue); // Function Icarus.BuildableLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16598d0
	struct UE4::FName StructToName(struct FBuildableEnum EnumValue); // Function Icarus.BuildableLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659790
	int32_t StructToInt(struct FBuildableEnum EnumValue); // Function Icarus.BuildableLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659650
	struct FBuildableEnum RowHandleToStruct(struct FBuildableRowHandle RowHandle); // Function Icarus.BuildableLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659420
	void RemoveRowFromBuildableTable(struct UE4::FName Name); // Function Icarus.BuildableLibrary.RemoveRowFromBuildableTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1659320
	void RefreshConstants(); // Function Icarus.BuildableLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16592e0
	int32_t NumRows(); // Function Icarus.BuildableLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659280
	bool NotEqual_EnumName(struct FBuildableEnum A, struct UE4::FName B); // Function Icarus.BuildableLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658f90
	bool NotEqual_EnumEnum(struct FBuildableEnum A, struct FBuildableEnum B); // Function Icarus.BuildableLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658db0
	struct FBuildableEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BuildableLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658c90
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BuildableLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1658b70
	struct FBuildableRowHandle MakeLiteralBuildable(struct FBuildableRowHandle RowHandle); // Function Icarus.BuildableLibrary.MakeLiteralBuildable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16589d0
	struct FBuildableRowHandle MakeBuildableFromIndex(int32_t Index); // Function Icarus.BuildableLibrary.MakeBuildableFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658790
	struct FBuildableEnum MakeBuildableEnum(struct FBuildableEnum Enum); // Function Icarus.BuildableLibrary.MakeBuildableEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658710
	struct FBuildableRowHandle MakeBuildable(struct UE4::FName RowName); // Function Icarus.BuildableLibrary.MakeBuildable // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658670
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BuildableLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1658550
	struct FBuildableEnum IntToStruct(int32_t IntValue); // Function Icarus.BuildableLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658430
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BuildableLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1658310
	void GetBuildableStruct(struct FBuildableRowHandle RowHandle, struct FBuildableData& Buildable, enum class EValid& Paths); // Function Icarus.BuildableLibrary.GetBuildableStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1657f70
	bool EqualEqual_FBuildableRowHandleFBuildableRowHandle(struct FBuildableRowHandle RowHandleA, struct FBuildableRowHandle RowHandleB); // Function Icarus.BuildableLibrary.EqualEqual_FBuildableRowHandleFBuildableRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1657b10
	bool EqualEqual_EnumEnum(struct FBuildableEnum A, struct FBuildableEnum B); // Function Icarus.BuildableLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1657930
	struct FBuildableRowHandle CastToBuildableRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BuildableLibrary.CastToBuildableRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16576c0
	void BreakBuildableEnum(struct FBuildableEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BuildableLibrary.BreakBuildableEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1657400
	void AddRowToBuildableTable(struct UE4::FName Name, struct FBuildableData Data, struct FBuildableRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BuildableLibrary.AddRowToBuildableTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1656e50
};

// Class Icarus.BuildableTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBuildableTable : UIcarusDataTable {
};

// Class Icarus.IcarusActor
// Size: 0x2b0 (Inherited: 0x220)
struct AIcarusActor : AActor {
	char pad_220[0x20]; // 0x220(0x20)
	struct UIcarusStatContainer* StatContainer; // 0x240(0x08)
	struct UActorState* ActorState; // 0x248(0x08)
	enum class EProgressState ProgressState; // 0x250(0x01)
	struct FMulticastSparseDelegate OnActorPreDestroy; // 0x251(0x01)
	char pad_252[0x6]; // 0x252(0x06)
	struct UTerrainAnchorComponent* TerrainAnchor; // 0x258(0x08)
	struct UTerrainAnchorComponent* TerrainAnchorClass; // 0x260(0x08)
	char pad_268[0x8]; // 0x268(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x270(0x20)
	char pad_290[0x8]; // 0x290(0x08)
	struct UIcarusStateRecorderComponent* RecorderClass; // 0x298(0x08)
	bool bSaveModifiersToDatabase; // 0x2a0(0x01)
	char pad_2A1[0x7]; // 0x2a1(0x07)
	struct UIcarusStateRecorderComponent* Recorder; // 0x2a8(0x08)

	void SetRecorderShouldRetainOnDestroy(bool bShouldRetain); // Function Icarus.IcarusActor.SetRecorderShouldRetainOnDestroy // (Final|Native|Public|BlueprintCallable) // @ game+0x1724190
	void SetIcarusUID(int32_t ForcedUID); // Function Icarus.IcarusActor.SetIcarusUID // (Native|Public|BlueprintCallable) // @ game+0x1724070
	void RepairObject(); // Function Icarus.IcarusActor.RepairObject // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x88b920
	void RecorderEndRecording(); // Function Icarus.IcarusActor.RecorderEndRecording // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1723b10
	void RecorderBeginRecording(); // Function Icarus.IcarusActor.RecorderBeginRecording // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1723af0
	void RaiseTheCurtain(); // Function Icarus.IcarusActor.RaiseTheCurtain // (Native|Event|Public|BlueprintEvent) // @ game+0x9108f0
	void OnTerrainAnchorStateChanged(); // Function Icarus.IcarusActor.OnTerrainAnchorStateChanged // (Native|Event|Public|BlueprintEvent) // @ game+0x1625720
	void OnDatabaseLoadComplete(); // Function Icarus.IcarusActor.OnDatabaseLoadComplete // (Native|Event|Public|BlueprintEvent) // @ game+0x17238d0
	void IcarusBeginPlay(); // Function Icarus.IcarusActor.IcarusBeginPlay // (Native|Event|Public|BlueprintEvent) // @ game+0x1723300
	bool HasRecorder(); // Function Icarus.IcarusActor.HasRecorder // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x17232d0
	int32_t GetIcarusUID(); // Function Icarus.IcarusActor.GetIcarusUID // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1722760
	void ClaimUniqueIcarusUIDFromLibrary(int32_t SuggestedUID); // Function Icarus.IcarusActor.ClaimUniqueIcarusUIDFromLibrary // (Final|Native|Public|BlueprintCallable) // @ game+0x1722130
};

// Class Icarus.IcarusItem
// Size: 0x3f0 (Inherited: 0x2b0)
struct AIcarusItem : AIcarusActor {
	struct UInventory* ItemInventory; // 0x2b0(0x08)
	int32_t ItemInventoryLocation; // 0x2b8(0x04)
	bool HasLink; // 0x2bc(0x01)
	struct FMulticastSparseDelegate PickedUp; // 0x2bd(0x01)
	char pad_2BE[0x2]; // 0x2be(0x02)
	struct TArray<struct UTraitComponent*> TraitComponents; // 0x2c0(0x10)
	struct FItemData ItemData; // 0x2d0(0xa0)
	struct FIcarusItemConstructionParameters ConstructionParameters; // 0x370(0x28)
	enum class EIcarusItemContext SpawnedContext; // 0x398(0x01)
	char pad_399[0x3]; // 0x399(0x03)
	struct FItemTemplateRowHandle OverrideInstanceItemTemplate; // 0x39c(0x18)
	char pad_3B4[0x4]; // 0x3b4(0x04)
	struct USmoothSync* SmoothSyncComponent; // 0x3b8(0x08)
	struct FTransform ConstructionTransfrom; // 0x3c0(0x30)

	bool WorldPickup(struct UItemableComponent* ItemIn, struct AActor* Interactor, struct FHitResult& HitResult); // Function Icarus.IcarusItem.WorldPickup // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x174bd00
	void StackUpdated(); // Function Icarus.IcarusItem.StackUpdated // (Final|Native|Private) // @ game+0x174b890
	void SetItemVisible(bool bVisible); // Function Icarus.IcarusItem.SetItemVisible // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xef85e0
	bool ServerSetupTraitComponents(); // Function Icarus.IcarusItem.ServerSetupTraitComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x174b720
	void ServerSetItemData(struct FItemData& InItemData); // Function Icarus.IcarusItem.ServerSetItemData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x174b580
	bool ServerLoadItemData(struct FItemTemplateRowHandle ItemTemplate); // Function Icarus.IcarusItem.ServerLoadItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x174b4c0
	void SerializeItemData(struct FItemData& OutItemData); // Function Icarus.IcarusItem.SerializeItemData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x174b320
	void ResetDecaySpoilTime(); // Function Icarus.IcarusItem.ResetDecaySpoilTime // (Final|Native|Public|BlueprintCallable) // @ game+0x174b2e0
	void ReconstructItem(struct FIcarusItemConstructionParameters& NewConstructionParameters); // Function Icarus.IcarusItem.ReconstructItem // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x174b210
	void OverwriteInventoryItemDynamicProperty(enum class EDynamicItemProperties Property, int32_t Value); // Function Icarus.IcarusItem.OverwriteInventoryItemDynamicProperty // (Final|Native|Private) // @ game+0x174aff0
	void OnWorldPickup(struct UItemableComponent* ItemIn, struct AActor* Interactor, struct FHitResult& HitResult); // Function Icarus.IcarusItem.OnWorldPickup // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x174ae60
	void OnRep_ItemData(); // Function Icarus.IcarusItem.OnRep_ItemData // (Final|Native|Protected) // @ game+0x174ae40
	void OnRep_ConstructionParameters(); // Function Icarus.IcarusItem.OnRep_ConstructionParameters // (Native|Protected) // @ game+0x88bb80
	bool OnPickedUp(); // Function Icarus.IcarusItem.OnPickedUp // (Final|Native|Public|BlueprintCallable) // @ game+0x174ae10
	void OnItemDataChanged(); // Function Icarus.IcarusItem.OnItemDataChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x88bba0
	void OnDynamicDataUpdated(); // Function Icarus.IcarusItem.OnDynamicDataUpdated // (Final|Native|Private) // @ game+0x174ac30
	bool OnDropped(); // Function Icarus.IcarusItem.OnDropped // (Final|Native|Public|BlueprintCallable) // @ game+0x174ac10
	void ItemContainerDataUpdated(); // Function Icarus.IcarusItem.ItemContainerDataUpdated // (Final|Native|Private) // @ game+0x174abb0
	bool HasInventoryItemLink(); // Function Icarus.IcarusItem.HasInventoryItemLink // (Final|Native|Public|BlueprintCallable) // @ game+0x174a940
	struct FItemData GetSerialisedItemData(); // Function Icarus.IcarusItem.GetSerialisedItemData // (Final|Native|Public|BlueprintCallable) // @ game+0x174a870
	struct UMeshComponent* GetRootMeshComponent(); // Function Icarus.IcarusItem.GetRootMeshComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x174a840
	struct AIcarusPlayerCharacter* GetOwningIcarusPlayerCharacter(); // Function Icarus.IcarusItem.GetOwningIcarusPlayerCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x174a810
	struct TArray<struct FItemDynamicData> GetMutableItemDynamicData(); // Function Icarus.IcarusItem.GetMutableItemDynamicData // (Final|Native|Public) // @ game+0x174a7d0
	struct FItemData GetItemData(); // Function Icarus.IcarusItem.GetItemData // (Final|Native|Public|Const) // @ game+0x174a470
	void FillableUpdated(); // Function Icarus.IcarusItem.FillableUpdated // (Final|Native|Private) // @ game+0x1749990
	void EstablishLink(struct UInventory* Inventory, int32_t Location); // Function Icarus.IcarusItem.EstablishLink // (Final|Native|Public|BlueprintCallable) // @ game+0x1749740
	void DurabilityUpdated(); // Function Icarus.IcarusItem.DurabilityUpdated // (Final|Native|Private) // @ game+0x1749720
	void DestroyLinkedInventoryItem(); // Function Icarus.IcarusItem.DestroyLinkedInventoryItem // (Final|Native|Public|BlueprintCallable) // @ game+0x1749700
	void DestroyLink(); // Function Icarus.IcarusItem.DestroyLink // (Final|Native|Public|BlueprintCallable) // @ game+0x17496e0
	void DeserializeItemData(struct FItemData& InItemData); // Function Icarus.IcarusItem.DeserializeItemData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1749540
	void DecayableDataUpdated(); // Function Icarus.IcarusItem.DecayableDataUpdated // (Final|Native|Private) // @ game+0x1749520
	void ActionableUpdated(); // Function Icarus.IcarusItem.ActionableUpdated // (Final|Native|Private) // @ game+0x17492c0
};

// Class Icarus.BuildingBase
// Size: 0x420 (Inherited: 0x3f0)
struct ABuildingBase : AIcarusItem {
	struct UIcarusNavigationDirtier* NavigationDirtier; // 0x3f0(0x08)
	struct FMulticastInlineDelegate OnBuildingDestroyed; // 0x3f8(0x10)
	struct FMulticastInlineDelegate OnBuildingReplaced; // 0x408(0x10)
	char pad_418[0x8]; // 0x418(0x08)

	void StartDestruction(struct AIcarusPlayerController* TriggeringPlayer, enum class EBuildingDestroyReason DestroyReason); // Function Icarus.BuildingBase.StartDestruction // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void NotifyBuildingReplaced(struct ABuildingBase* NewBuilding); // Function Icarus.BuildingBase.NotifyBuildingReplaced // (Final|Native|Protected|BlueprintCallable) // @ game+0x16591f0
	void NotifyBuildingDestroyed(enum class EBuildingDestroyReason Reason); // Function Icarus.BuildingBase.NotifyBuildingDestroyed // (Final|Native|Protected|BlueprintCallable) // @ game+0x1659170
	bool IsBuildingOutside(); // Function Icarus.BuildingBase.IsBuildingOutside // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	bool IsBuildingDestroyed(); // Function Icarus.BuildingBase.IsBuildingDestroyed // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
	struct ABuildingGridBase* GetParentGrid(); // Function Icarus.BuildingBase.GetParentGrid // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
	struct USceneComponent* GetCenterComponent(); // Function Icarus.BuildingBase.GetCenterComponent // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
	struct UDestructibleComponent* CreateDestructibleMeshComponent(); // Function Icarus.BuildingBase.CreateDestructibleMeshComponent // (Final|Native|Protected|BlueprintCallable) // @ game+0x1657900
	void CalculateStabilityState(); // Function Icarus.BuildingBase.CalculateStabilityState // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
};

// Class Icarus.BuildingGridBase
// Size: 0x2c8 (Inherited: 0x2b0)
struct ABuildingGridBase : AIcarusActor {
	struct TArray<struct ABuildingBase*> BuildingsRequiringNavUpdate; // 0x2b0(0x10)
	char pad_2C0[0x8]; // 0x2c0(0x08)

	bool TryAddNewBuildingFromWorldSpace(struct FTransform WorldSpaceTransform, struct ABuildingBase* DesiredClass, bool bAlternateRotation, struct FItemData Item, struct ABuildingBase*& Building); // Function Icarus.BuildingGridBase.TryAddNewBuildingFromWorldSpace // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void StartDirtyingBuildingNavigation(); // Function Icarus.BuildingGridBase.StartDirtyingBuildingNavigation // (Final|Native|Public|BlueprintCallable) // @ game+0x1659630
	void SetQueued(bool bQueued); // Function Icarus.BuildingGridBase.SetQueued // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void SetAutomaticResumingDestructionEnabled(bool bEnabled); // Function Icarus.BuildingGridBase.SetAutomaticResumingDestructionEnabled // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	struct FSerializedGrid SerializeForSaveGame(); // Function Icarus.BuildingGridBase.SerializeForSaveGame // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void LoadGridAndBuildingsFromRecord(struct UBuildingGridRecorderComponent* RecorderComponent); // Function Icarus.BuildingGridBase.LoadGridAndBuildingsFromRecord // (Event|Public|BlueprintEvent) // @ game+0x1be0000
	bool GetIsQueued(); // Function Icarus.BuildingGridBase.GetIsQueued // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1be0000
	void GetGridBuildingDataForRecord(struct UBuildingGridRecorderComponent* RecorderComponent); // Function Icarus.BuildingGridBase.GetGridBuildingDataForRecord // (Event|Public|BlueprintEvent) // @ game+0x1be0000
	void AddChildBuildingToDestroy(struct ABuildingBase* BuildingToDestroy); // Function Icarus.BuildingGridBase.AddChildBuildingToDestroy // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
};

// Class Icarus.BuildingGridRecorderComponent
// Size: 0x1b0 (Inherited: 0x160)
struct UBuildingGridRecorderComponent : UActorStateRecorderComponent {
	struct FBuildingGridSaveData BuildingGridRecord; // 0x160(0x50)

	void AddBuildingToGrid(struct FTransform& GridTransform, struct FName& BuildableRowName, struct FName& BuildingItemName, struct FItemData& BuildingItemData, struct FBuildingInfo BuildingInfo); // Function Icarus.BuildingGridRecorderComponent.AddBuildingToGrid // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x16569d0
};

// Class Icarus.BuildingStabilityLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuildingStabilityLibrary : URowLibrary {

	struct FBuildingStabilityRowHandle StructToRowHandle(struct FBuildingStabilityEnum EnumValue); // Function Icarus.BuildingStabilityLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659980
	struct UE4::FName StructToName(struct FBuildingStabilityEnum EnumValue); // Function Icarus.BuildingStabilityLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659830
	int32_t StructToInt(struct FBuildingStabilityEnum EnumValue); // Function Icarus.BuildingStabilityLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16596f0
	struct FBuildingStabilityEnum RowHandleToStruct(struct FBuildingStabilityRowHandle RowHandle); // Function Icarus.BuildingStabilityLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16594e0
	void RemoveRowFromBuildingStabilityTable(struct UE4::FName Name); // Function Icarus.BuildingStabilityLibrary.RemoveRowFromBuildingStabilityTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16593a0
	void RefreshConstants(); // Function Icarus.BuildingStabilityLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1659300
	int32_t NumRows(); // Function Icarus.BuildingStabilityLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16592b0
	bool NotEqual_EnumName(struct FBuildingStabilityEnum A, struct UE4::FName B); // Function Icarus.BuildingStabilityLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1659080
	bool NotEqual_EnumEnum(struct FBuildingStabilityEnum A, struct FBuildingStabilityEnum B); // Function Icarus.BuildingStabilityLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658ea0
	struct FBuildingStabilityEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BuildingStabilityLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658d20
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BuildingStabilityLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1658c00
	struct FBuildingStabilityRowHandle MakeLiteralBuildingStability(struct FBuildingStabilityRowHandle RowHandle); // Function Icarus.BuildingStabilityLibrary.MakeLiteralBuildingStability // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658aa0
	struct FBuildingStabilityRowHandle MakeBuildingStabilityFromIndex(int32_t Index); // Function Icarus.BuildingStabilityLibrary.MakeBuildingStabilityFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658940
	struct FBuildingStabilityEnum MakeBuildingStabilityEnum(struct FBuildingStabilityEnum Enum); // Function Icarus.BuildingStabilityLibrary.MakeBuildingStabilityEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16588c0
	struct FBuildingStabilityRowHandle MakeBuildingStability(struct UE4::FName RowName); // Function Icarus.BuildingStabilityLibrary.MakeBuildingStability // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1658820
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BuildingStabilityLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x16585e0
	struct FBuildingStabilityEnum IntToStruct(int32_t IntValue); // Function Icarus.BuildingStabilityLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16584c0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BuildingStabilityLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x16583a0
	void GetBuildingStabilityStruct(struct FBuildingStabilityRowHandle RowHandle, struct FBuildingStability& BuildingStability, enum class EValid& Paths); // Function Icarus.BuildingStabilityLibrary.GetBuildingStabilityStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1658150
	bool EqualEqual_FBuildingStabilityRowHandleFBuildingStabilityRowHandle(struct FBuildingStabilityRowHandle RowHandleA, struct FBuildingStabilityRowHandle RowHandleB); // Function Icarus.BuildingStabilityLibrary.EqualEqual_FBuildingStabilityRowHandleFBuildingStabilityRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1657c50
	bool EqualEqual_EnumEnum(struct FBuildingStabilityEnum A, struct FBuildingStabilityEnum B); // Function Icarus.BuildingStabilityLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1657a20
	struct FBuildingStabilityRowHandle CastToBuildingStabilityRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BuildingStabilityLibrary.CastToBuildingStabilityRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16577e0
	void BreakBuildingStabilityEnum(struct FBuildingStabilityEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BuildingStabilityLibrary.BreakBuildingStabilityEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1657560
	void AddRowToBuildingStabilityTable(struct UE4::FName Name, struct FBuildingStability Data, struct FBuildingStabilityRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BuildingStabilityLibrary.AddRowToBuildingStabilityTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1657170
};

// Class Icarus.BuildingStabilityTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBuildingStabilityTable : UIcarusDataTable {
};

// Class Icarus.BuildingSubsystem
// Size: 0x50 (Inherited: 0x30)
struct UBuildingSubsystem : UWorldSubsystem {
	struct FMulticastInlineDelegate OnBuildingPiecePlacedNotify; // 0x30(0x10)
	struct FMulticastInlineDelegate OnBuildingPieceRemovedNotify; // 0x40(0x10)

	void BroadcastBuildingPieceRemovedDelegate(struct AIcarusPlayerCharacter* Player, struct ABuildingBase* Building); // Function Icarus.BuildingSubsystem.BroadcastBuildingPieceRemovedDelegate // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x165d660
	void BroadcastBuildingPiecePlacedDelegate(struct AIcarusPlayerCharacter* Player, struct ABuildingBase* Building); // Function Icarus.BuildingSubsystem.BroadcastBuildingPiecePlacedDelegate // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x165d580
};

// Class Icarus.BuildingTypesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuildingTypesLibrary : URowLibrary {

	struct FBuildingTypesRowHandle StructToRowHandle(struct FBuildingTypesEnum EnumValue); // Function Icarus.BuildingTypesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165ef70
	struct UE4::FName StructToName(struct FBuildingTypesEnum EnumValue); // Function Icarus.BuildingTypesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165eed0
	int32_t StructToInt(struct FBuildingTypesEnum EnumValue); // Function Icarus.BuildingTypesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165ee30
	struct FBuildingTypesEnum RowHandleToStruct(struct FBuildingTypesRowHandle RowHandle); // Function Icarus.BuildingTypesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e840
	void RemoveRowFromBuildingTypesTable(struct UE4::FName Name); // Function Icarus.BuildingTypesLibrary.RemoveRowFromBuildingTypesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x165e7c0
	void RefreshConstants(); // Function Icarus.BuildingTypesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x165e7a0
	int32_t NumRows(); // Function Icarus.BuildingTypesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e770
	bool NotEqual_EnumName(struct FBuildingTypesEnum A, struct UE4::FName B); // Function Icarus.BuildingTypesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e680
	bool NotEqual_EnumEnum(struct FBuildingTypesEnum A, struct FBuildingTypesEnum B); // Function Icarus.BuildingTypesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e590
	struct FBuildingTypesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.BuildingTypesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e500
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.BuildingTypesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x165e470
	struct FBuildingTypesRowHandle MakeLiteralBuildingTypes(struct FBuildingTypesRowHandle RowHandle); // Function Icarus.BuildingTypesLibrary.MakeLiteralBuildingTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e3a0
	struct FBuildingTypesRowHandle MakeBuildingTypesFromIndex(int32_t Index); // Function Icarus.BuildingTypesLibrary.MakeBuildingTypesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e310
	struct FBuildingTypesEnum MakeBuildingTypesEnum(struct FBuildingTypesEnum Enum); // Function Icarus.BuildingTypesLibrary.MakeBuildingTypesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e290
	struct FBuildingTypesRowHandle MakeBuildingTypes(struct UE4::FName RowName); // Function Icarus.BuildingTypesLibrary.MakeBuildingTypes // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e1f0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.BuildingTypesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x165e160
	struct FBuildingTypesEnum IntToStruct(int32_t IntValue); // Function Icarus.BuildingTypesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165e0d0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.BuildingTypesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x165e040
	void GetBuildingTypesStruct(struct FBuildingTypesRowHandle RowHandle, struct FIcarusBuildingType& BuildingTypes, enum class EValid& Paths); // Function Icarus.BuildingTypesLibrary.GetBuildingTypesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x165dc90
	bool EqualEqual_FBuildingTypesRowHandleFBuildingTypesRowHandle(struct FBuildingTypesRowHandle RowHandleA, struct FBuildingTypesRowHandle RowHandleB); // Function Icarus.BuildingTypesLibrary.EqualEqual_FBuildingTypesRowHandleFBuildingTypesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165db20
	bool EqualEqual_EnumEnum(struct FBuildingTypesEnum A, struct FBuildingTypesEnum B); // Function Icarus.BuildingTypesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x165da30
	struct FBuildingTypesRowHandle CastToBuildingTypesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.BuildingTypesLibrary.CastToBuildingTypesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x165d740
	void BreakBuildingTypesEnum(struct FBuildingTypesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.BuildingTypesLibrary.BreakBuildingTypesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x165d420
	void AddRowToBuildingTypesTable(struct UE4::FName Name, struct FIcarusBuildingType Data, struct FBuildingTypesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.BuildingTypesLibrary.AddRowToBuildingTypesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x165d110
};

// Class Icarus.BuildingTypesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UBuildingTypesTable : UIcarusDataTable {
};

// Class Icarus.FloatableComponent
// Size: 0xe8 (Inherited: 0xd0)
struct UFloatableComponent : UTraitComponent {
	struct TArray<struct UPrimitiveComponent*> OverlappedComponents; // 0xd0(0x10)
	struct FMulticastSparseDelegate OnFloatableUpdated; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)

	void UpdateOverlappedState(); // Function Icarus.FloatableComponent.UpdateOverlappedState // (Native|Event|Public|BlueprintEvent) // @ game+0x16e42d0
	void RemoveOverlap(struct UPrimitiveComponent* Component); // Function Icarus.FloatableComponent.RemoveOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x16e3840
	bool GetFloatableData(struct FFloatableData& OutData); // Function Icarus.FloatableComponent.GetFloatableData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16e22d0
	void FloatableUpdated(bool bNewFloating); // Function Icarus.FloatableComponent.FloatableUpdated // (Native|Public|BlueprintCallable) // @ game+0x1645030
	void CheckOverlapArray(); // Function Icarus.FloatableComponent.CheckOverlapArray // (Final|Native|Public|BlueprintCallable) // @ game+0x16e1aa0
	void AddOverlap(struct UPrimitiveComponent* Component); // Function Icarus.FloatableComponent.AddOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x16e10d0
};

// Class Icarus.BuoyancyBehaviour
// Size: 0x118 (Inherited: 0xe8)
struct UBuoyancyBehaviour : UFloatableComponent {
	struct FVector VelocityDamper; // 0xe8(0x0c)
	bool bBuoyancyEnabled; // 0xf4(0x01)
	bool bAutoGenerateFloatingPoints; // 0xf5(0x01)
	char pad_F6[0x2]; // 0xf6(0x02)
	float FloatingPointRadius; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct FVector> FloatingPoints; // 0x100(0x10)
	char pad_110[0x8]; // 0x110(0x08)

	void GenerateFloatingPoints(); // Function Icarus.BuoyancyBehaviour.GenerateFloatingPoints // (Native|Event|Public|BlueprintEvent) // @ game+0x1613f90
	float FindWaterHeight(); // Function Icarus.BuoyancyBehaviour.FindWaterHeight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x165dc60
};

// Class Icarus.BW3ObjectiveRecorderInterface
// Size: 0x28 (Inherited: 0x28)
struct UBW3ObjectiveRecorderInterface : UInterface {

	void SetObjectiveState(int32_t State); // Function Icarus.BW3ObjectiveRecorderInterface.SetObjectiveState // (Native|Event|Public|BlueprintEvent) // @ game+0x165ecf0
	void GetObjectiveState(int32_t& State); // Function Icarus.BW3ObjectiveRecorderInterface.GetObjectiveState // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x165dee0
};

// Class Icarus.BW3ObjectiveRecorderComponent
// Size: 0xe0 (Inherited: 0xd8)
struct UBW3ObjectiveRecorderComponent : UIcarusStateRecorderComponent {
	int32_t SavedState; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
};

// Class Icarus.CaveInterface
// Size: 0x28 (Inherited: 0x28)
struct UCaveInterface : UInterface {

	float GetSpelunkingDepthFromLocation(struct FVector Location); // Function Icarus.CaveInterface.GetSpelunkingDepthFromLocation // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x165df70
	float GetCurrentSpelunkingDepth(); // Function Icarus.CaveInterface.GetCurrentSpelunkingDepth // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x165deb0
};

// Class Icarus.Cave
// Size: 0x220 (Inherited: 0x220)
struct ACave : AActor {
};

// Class Icarus.CaveEntranceRecorderInterface
// Size: 0x28 (Inherited: 0x28)
struct UCaveEntranceRecorderInterface : UInterface {

	void SetVoxelBlockerSaveData(struct TArray<struct FVoxelMinedSphere>& VoxelBlockerSaveData); // Function Icarus.CaveEntranceRecorderInterface.SetVoxelBlockerSaveData // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x165ed80
	struct AVoxelResource* GetVoxelActor(); // Function Icarus.CaveEntranceRecorderInterface.GetVoxelActor // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x165e010
};

// Class Icarus.CaveEntranceRecorderComponent
// Size: 0x190 (Inherited: 0x160)
struct UCaveEntranceRecorderComponent : UActorStateRecorderComponent {
	struct FVoxelSaveData VoxelBlockerSaveData; // 0x158(0x30)
};

// Class Icarus.CaveTemplateAsset
// Size: 0x120 (Inherited: 0x30)
struct UCaveTemplateAsset : UDataAsset {
	struct TArray<struct FCaveMesh> Meshes; // 0x30(0x10)
	struct TArray<struct FCaveVoid> Voids; // 0x40(0x10)
	struct TArray<struct FCaveVolume> Volumes; // 0x50(0x10)
	struct TArray<struct FCaveEntrance> Entrances; // 0x60(0x10)
	struct TArray<struct FCaveLake> Lakes; // 0x70(0x10)
	struct TArray<struct FCaveFoliage> Foliage; // 0x80(0x10)
	struct TArray<struct FCaveLight> CaveLights; // 0x90(0x10)
	struct TArray<struct FCaveEntranceActor> EntranceActors; // 0xa0(0x10)
	struct TArray<struct FCaveExoticVoxel> ExoticVoxels; // 0xb0(0x10)
	struct TArray<struct FCaveDeepMiningOreDeposit> DeepMiningOreDeposit; // 0xc0(0x10)
	struct TMap<struct AActor*, struct FCaveSpawnConfig> CaveActorSpawnMap; // 0xd0(0x50)
};

// Class Icarus.CaveTemplateFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCaveTemplateFunctionLibrary : UBlueprintFunctionLibrary {

	void SetLightUseTemperature(struct ULightComponent* Light, bool bUseTemperature); // Function Icarus.CaveTemplateFunctionLibrary.SetLightUseTemperature // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x165ec30
	void SetLightMaxDrawDistance(struct ULightComponent* Light, float MaxDrawDistance); // Function Icarus.CaveTemplateFunctionLibrary.SetLightMaxDrawDistance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x165eb70
	struct TArray<struct FCaveFoliage> SerializeCaveFoliage(struct AInstancedFoliageActor* InFoliageActor, struct FTransform& Origin, struct TArray<struct AActor*> WorldMeshes); // Function Icarus.CaveTemplateFunctionLibrary.SerializeCaveFoliage // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x165e900
	bool DeserializeCaveFoliage(struct AActor* CaveTemplateActor, struct TArray<struct FCaveFoliage>& CaveFoliageData, bool bAttachToMeshes, struct TArray<struct AActor*>& MeshActorArray); // Function Icarus.CaveTemplateFunctionLibrary.DeserializeCaveFoliage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x165d860
};

// Class Icarus.ChallengesLibrary
// Size: 0x28 (Inherited: 0x28)
struct UChallengesLibrary : URowLibrary {

	struct FChallengesRowHandle StructToRowHandle(struct FChallengesEnum EnumValue); // Function Icarus.ChallengesLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16648d0
	struct UE4::FName StructToName(struct FChallengesEnum EnumValue); // Function Icarus.ChallengesLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16646f0
	int32_t StructToInt(struct FChallengesEnum EnumValue); // Function Icarus.ChallengesLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664510
	struct FChallengesEnum RowHandleToStruct(struct FChallengesRowHandle RowHandle); // Function Icarus.ChallengesLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16642d0
	void RemoveRowFromChallengesTable(struct UE4::FName Name); // Function Icarus.ChallengesLibrary.RemoveRowFromChallengesTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1664150
	void RefreshConstants(); // Function Icarus.ChallengesLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x16640f0
	int32_t NumRows(); // Function Icarus.ChallengesLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664060
	bool NotEqual_EnumName(struct FChallengesEnum A, struct UE4::FName B); // Function Icarus.ChallengesLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663d90
	bool NotEqual_EnumEnum(struct FChallengesEnum A, struct FChallengesEnum B); // Function Icarus.ChallengesLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663ac0
	struct FChallengesEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.ChallengesLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663910
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.ChallengesLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1663760
	struct FChallengesRowHandle MakeLiteralChallenges(struct FChallengesRowHandle RowHandle); // Function Icarus.ChallengesLibrary.MakeLiteralChallenges // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16634f0
	struct FChallengesRowHandle MakeChallengesFromIndex(int32_t Index); // Function Icarus.ChallengesLibrary.MakeChallengesFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663100
	struct FChallengesEnum MakeChallengesEnum(struct FChallengesEnum Enum); // Function Icarus.ChallengesLibrary.MakeChallengesEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663080
	struct FChallengesRowHandle MakeChallenges(struct UE4::FName RowName); // Function Icarus.ChallengesLibrary.MakeChallenges // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662fe0
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.ChallengesLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1662e30
	struct FChallengesEnum IntToStruct(int32_t IntValue); // Function Icarus.ChallengesLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662c80
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.ChallengesLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1662ad0
	void GetChallengesStruct(struct FChallengesRowHandle RowHandle, struct FChallenge& Challenges, enum class EValid& Paths); // Function Icarus.ChallengesLibrary.GetChallengesStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16625f0
	bool EqualEqual_FChallengesRowHandleFChallengesRowHandle(struct FChallengesRowHandle RowHandleA, struct FChallengesRowHandle RowHandleB); // Function Icarus.ChallengesLibrary.EqualEqual_FChallengesRowHandleFChallengesRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662230
	bool EqualEqual_EnumEnum(struct FChallengesEnum A, struct FChallengesEnum B); // Function Icarus.ChallengesLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1661f60
	struct FChallengesRowHandle CastToChallengesRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.ChallengesLibrary.CastToChallengesRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1661c00
	void BreakChallengesEnum(struct FChallengesEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.ChallengesLibrary.BreakChallengesEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16617e0
	void AddRowToChallengesTable(struct UE4::FName Name, struct FChallenge Data, struct FChallengesRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.ChallengesLibrary.AddRowToChallengesTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1661100
};

// Class Icarus.ChallengesTable
// Size: 0xb8 (Inherited: 0xb8)
struct UChallengesTable : UIcarusDataTable {
};

// Class Icarus.CharacterCreationDataLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterCreationDataLibrary : URowLibrary {

	struct FCharacterCreationDataRowHandle StructToRowHandle(struct FCharacterCreationDataEnum EnumValue); // Function Icarus.CharacterCreationDataLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664980
	struct UE4::FName StructToName(struct FCharacterCreationDataEnum EnumValue); // Function Icarus.CharacterCreationDataLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664790
	int32_t StructToInt(struct FCharacterCreationDataEnum EnumValue); // Function Icarus.CharacterCreationDataLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16645b0
	struct FCharacterCreationDataEnum RowHandleToStruct(struct FCharacterCreationDataRowHandle RowHandle); // Function Icarus.CharacterCreationDataLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664390
	void RemoveRowFromCharacterCreationDataTable(struct UE4::FName Name); // Function Icarus.CharacterCreationDataLibrary.RemoveRowFromCharacterCreationDataTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x16641d0
	void RefreshConstants(); // Function Icarus.CharacterCreationDataLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1664110
	int32_t NumRows(); // Function Icarus.CharacterCreationDataLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664090
	bool NotEqual_EnumName(struct FCharacterCreationDataEnum A, struct UE4::FName B); // Function Icarus.CharacterCreationDataLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663e80
	bool NotEqual_EnumEnum(struct FCharacterCreationDataEnum A, struct FCharacterCreationDataEnum B); // Function Icarus.CharacterCreationDataLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663bb0
	struct FCharacterCreationDataEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.CharacterCreationDataLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16639a0
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.CharacterCreationDataLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16637f0
	struct FCharacterCreationDataRowHandle MakeLiteralCharacterCreationData(struct FCharacterCreationDataRowHandle RowHandle); // Function Icarus.CharacterCreationDataLibrary.MakeLiteralCharacterCreationData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16635c0
	struct FCharacterCreationDataRowHandle MakeCharacterCreationDataFromIndex(int32_t Index); // Function Icarus.CharacterCreationDataLibrary.MakeCharacterCreationDataFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16632b0
	struct FCharacterCreationDataEnum MakeCharacterCreationDataEnum(struct FCharacterCreationDataEnum Enum); // Function Icarus.CharacterCreationDataLibrary.MakeCharacterCreationDataEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663230
	struct FCharacterCreationDataRowHandle MakeCharacterCreationData(struct UE4::FName RowName); // Function Icarus.CharacterCreationDataLibrary.MakeCharacterCreationData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663190
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.CharacterCreationDataLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1662ec0
	struct FCharacterCreationDataEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterCreationDataLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662d10
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.CharacterCreationDataLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1662b60
	void GetCharacterCreationDataStruct(struct FCharacterCreationDataRowHandle RowHandle, struct FCharacterCreationData& CharacterCreationData, enum class EValid& Paths); // Function Icarus.CharacterCreationDataLibrary.GetCharacterCreationDataStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1662770
	bool EqualEqual_FCharacterCreationDataRowHandleFCharacterCreationDataRowHandle(struct FCharacterCreationDataRowHandle RowHandleA, struct FCharacterCreationDataRowHandle RowHandleB); // Function Icarus.CharacterCreationDataLibrary.EqualEqual_FCharacterCreationDataRowHandleFCharacterCreationDataRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662370
	bool EqualEqual_EnumEnum(struct FCharacterCreationDataEnum A, struct FCharacterCreationDataEnum B); // Function Icarus.CharacterCreationDataLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662050
	struct FCharacterCreationDataRowHandle CastToCharacterCreationDataRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.CharacterCreationDataLibrary.CastToCharacterCreationDataRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1661d20
	void BreakCharacterCreationDataEnum(struct FCharacterCreationDataEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.CharacterCreationDataLibrary.BreakCharacterCreationDataEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1661940
	void AddRowToCharacterCreationDataTable(struct UE4::FName Name, struct FCharacterCreationData Data, struct FCharacterCreationDataRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.CharacterCreationDataLibrary.AddRowToCharacterCreationDataTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1661390
};

// Class Icarus.CharacterCreationDataTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterCreationDataTable : UIcarusDataTable {
};

// Class Icarus.CharacterFlagsLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterFlagsLibrary : URowLibrary {

	struct FCharacterFlagsRowHandle StructToRowHandle(struct FCharacterFlagsEnum EnumValue); // Function Icarus.CharacterFlagsLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664a30
	struct UE4::FName StructToName(struct FCharacterFlagsEnum EnumValue); // Function Icarus.CharacterFlagsLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664830
	int32_t StructToInt(struct FCharacterFlagsEnum EnumValue); // Function Icarus.CharacterFlagsLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664650
	struct FCharacterFlagsEnum RowHandleToStruct(struct FCharacterFlagsRowHandle RowHandle); // Function Icarus.CharacterFlagsLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1664450
	void RemoveRowFromCharacterFlagsTable(struct UE4::FName Name); // Function Icarus.CharacterFlagsLibrary.RemoveRowFromCharacterFlagsTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1664250
	void RefreshConstants(); // Function Icarus.CharacterFlagsLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1664130
	int32_t NumRows(); // Function Icarus.CharacterFlagsLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16640c0
	bool NotEqual_EnumName(struct FCharacterFlagsEnum A, struct UE4::FName B); // Function Icarus.CharacterFlagsLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663f70
	bool NotEqual_EnumEnum(struct FCharacterFlagsEnum A, struct FCharacterFlagsEnum B); // Function Icarus.CharacterFlagsLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663ca0
	struct FCharacterFlagsEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.CharacterFlagsLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663a30
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.CharacterFlagsLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x1663880
	struct FCharacterFlagsRowHandle MakeLiteralCharacterFlags(struct FCharacterFlagsRowHandle RowHandle); // Function Icarus.CharacterFlagsLibrary.MakeLiteralCharacterFlags // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663690
	struct FCharacterFlagsRowHandle MakeCharacterFlagsFromIndex(int32_t Index); // Function Icarus.CharacterFlagsLibrary.MakeCharacterFlagsFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663460
	struct FCharacterFlagsEnum MakeCharacterFlagsEnum(struct FCharacterFlagsEnum Enum); // Function Icarus.CharacterFlagsLibrary.MakeCharacterFlagsEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16633e0
	struct FCharacterFlagsRowHandle MakeCharacterFlags(struct UE4::FName RowName); // Function Icarus.CharacterFlagsLibrary.MakeCharacterFlags // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1663340
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.CharacterFlagsLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1662f50
	struct FCharacterFlagsEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterFlagsLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662da0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.CharacterFlagsLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1662bf0
	void GetCharacterFlagsStruct(struct FCharacterFlagsRowHandle RowHandle, struct FCharacterFlag& CharacterFlags, enum class EValid& Paths); // Function Icarus.CharacterFlagsLibrary.GetCharacterFlagsStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1662910
	bool EqualEqual_FCharacterFlagsRowHandleFCharacterFlagsRowHandle(struct FCharacterFlagsRowHandle RowHandleA, struct FCharacterFlagsRowHandle RowHandleB); // Function Icarus.CharacterFlagsLibrary.EqualEqual_FCharacterFlagsRowHandleFCharacterFlagsRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16624b0
	bool EqualEqual_EnumEnum(struct FCharacterFlagsEnum A, struct FCharacterFlagsEnum B); // Function Icarus.CharacterFlagsLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1662140
	struct FCharacterFlagsRowHandle CastToCharacterFlagsRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.CharacterFlagsLibrary.CastToCharacterFlagsRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1661e40
	void BreakCharacterFlagsEnum(struct FCharacterFlagsEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.CharacterFlagsLibrary.BreakCharacterFlagsEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1661aa0
	void AddRowToCharacterFlagsTable(struct UE4::FName Name, struct FCharacterFlag Data, struct FCharacterFlagsRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.CharacterFlagsLibrary.AddRowToCharacterFlagsTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1661570
};

// Class Icarus.CharacterFlagsTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterFlagsTable : UIcarusDataTable {
};

// Class Icarus.CharacterGrowthLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterGrowthLibrary : URowLibrary {

	struct FCharacterGrowthRowHandle StructToRowHandle(struct FCharacterGrowthEnum EnumValue); // Function Icarus.CharacterGrowthLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x166a420
	struct UE4::FName StructToName(struct FCharacterGrowthEnum EnumValue); // Function Icarus.CharacterGrowthLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x166a240
	int32_t StructToInt(struct FCharacterGrowthEnum EnumValue); // Function Icarus.CharacterGrowthLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x166a060
	struct FCharacterGrowthEnum RowHandleToStruct(struct FCharacterGrowthRowHandle RowHandle); // Function Icarus.CharacterGrowthLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669e20
	void RemoveRowFromCharacterGrowthTable(struct UE4::FName Name); // Function Icarus.CharacterGrowthLibrary.RemoveRowFromCharacterGrowthTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1669ca0
	void RefreshConstants(); // Function Icarus.CharacterGrowthLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1669c40
	int32_t NumRows(); // Function Icarus.CharacterGrowthLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669bb0
	bool NotEqual_EnumName(struct FCharacterGrowthEnum A, struct UE4::FName B); // Function Icarus.CharacterGrowthLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16698e0
	bool NotEqual_EnumEnum(struct FCharacterGrowthEnum A, struct FCharacterGrowthEnum B); // Function Icarus.CharacterGrowthLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669610
	struct FCharacterGrowthEnum NameToStruct(struct UE4::FName NameValue); // Function Icarus.CharacterGrowthLibrary.NameToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669460
	int32_t NameToInt(struct UE4::FName NameValue); // Function Icarus.CharacterGrowthLibrary.NameToInt // (Final|Native|Static|Public) // @ game+0x16692b0
	struct FCharacterGrowthRowHandle MakeLiteralCharacterGrowth(struct FCharacterGrowthRowHandle RowHandle); // Function Icarus.CharacterGrowthLibrary.MakeLiteralCharacterGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669040
	struct FCharacterGrowthRowHandle MakeCharacterGrowthFromIndex(int32_t Index); // Function Icarus.CharacterGrowthLibrary.MakeCharacterGrowthFromIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1668c50
	struct FCharacterGrowthEnum MakeCharacterGrowthEnum(struct FCharacterGrowthEnum Enum); // Function Icarus.CharacterGrowthLibrary.MakeCharacterGrowthEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1668bd0
	struct FCharacterGrowthRowHandle MakeCharacterGrowth(struct UE4::FName RowName); // Function Icarus.CharacterGrowthLibrary.MakeCharacterGrowth // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1668b30
	bool IsValidName(struct UE4::FName NameValue); // Function Icarus.CharacterGrowthLibrary.IsValidName // (Final|Native|Static|Public) // @ game+0x1668980
	struct FCharacterGrowthEnum IntToStruct(int32_t IntValue); // Function Icarus.CharacterGrowthLibrary.IntToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16687d0
	struct UE4::FName IntToName(int32_t IntValue); // Function Icarus.CharacterGrowthLibrary.IntToName // (Final|Native|Static|Public) // @ game+0x1668620
	void GetCharacterGrowthStruct(struct FCharacterGrowthRowHandle RowHandle, struct FCharacterGrowth& CharacterGrowth, enum class EValid& Paths); // Function Icarus.CharacterGrowthLibrary.GetCharacterGrowthStruct // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16680e0
	bool EqualEqual_FCharacterGrowthRowHandleFCharacterGrowthRowHandle(struct FCharacterGrowthRowHandle RowHandleA, struct FCharacterGrowthRowHandle RowHandleB); // Function Icarus.CharacterGrowthLibrary.EqualEqual_FCharacterGrowthRowHandleFCharacterGrowthRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1667d20
	bool EqualEqual_EnumEnum(struct FCharacterGrowthEnum A, struct FCharacterGrowthEnum B); // Function Icarus.CharacterGrowthLibrary.EqualEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1667a50
	struct FCharacterGrowthRowHandle CastToCharacterGrowthRowHandle(struct FRowHandle RowHandle, enum class EValid& Paths); // Function Icarus.CharacterGrowthLibrary.CastToCharacterGrowthRowHandle // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x16676f0
	void BreakCharacterGrowthEnum(struct FCharacterGrowthEnum Enum, struct FName& Name, int32_t& Index); // Function Icarus.CharacterGrowthLibrary.BreakCharacterGrowthEnum // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x16672d0
	void AddRowToCharacterGrowthTable(struct UE4::FName Name, struct FCharacterGrowth Data, struct FCharacterGrowthRowHandle& NewRow, bool bOverrideExistingRow); // Function Icarus.CharacterGrowthLibrary.AddRowToCharacterGrowthTable // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1666bb0
};

// Class Icarus.CharacterGrowthTable
// Size: 0xb8 (Inherited: 0xb8)
struct UCharacterGrowthTable : UIcarusDataTable {
};

// Class Icarus.CharacterPerksLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCharacterPerksLibrary : URowLibrary {

	struct FCharacterPerksRowHandle StructToRowHandle(struct FCharacterPerksEnum EnumValue); // Function Icarus.CharacterPerksLibrary.StructToRowHandle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x166a4d0
	struct UE4::FName StructToName(struct FCharacterPerksEnum EnumValue); // Function Icarus.CharacterPerksLibrary.StructToName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x166a2e0
	int32_t StructToInt(struct FCharacterPerksEnum EnumValue); // Function Icarus.CharacterPerksLibrary.StructToInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x166a100
	struct FCharacterPerksEnum RowHandleToStruct(struct FCharacterPerksRowHandle RowHandle); // Function Icarus.CharacterPerksLibrary.RowHandleToStruct // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669ee0
	void RemoveRowFromCharacterPerksTable(struct UE4::FName Name); // Function Icarus.CharacterPerksLibrary.RemoveRowFromCharacterPerksTable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1669d20
	void RefreshConstants(); // Function Icarus.CharacterPerksLibrary.RefreshConstants // (Final|Native|Static|Public) // @ game+0x1669c60
	int32_t NumRows(); // Function Icarus.CharacterPerksLibrary.NumRows // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669be0
	bool NotEqual_EnumName(struct FCharacterPerksEnum A, struct UE4::FName B); // Function Icarus.CharacterPerksLibrary.NotEqual_EnumName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x16699d0
	bool NotEqual_EnumEnum(struct FCharacterPerksEnum A, struct FCharacterPerksEnum B); // Function Icarus.CharacterPerksLibrary.NotEqual_EnumEnum // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1669700
