// WidgetBlueprintGeneratedClass UMG_TitleScreenTrailerButton.UMG_TitleScreenTrailerButton_C
// Size: 0x2a0 (Inherited: 0x260)
struct UUMG_TitleScreenTrailerButton_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* HoverAnimation; // 0x268(0x08)
	struct UButton* BaseButton; // 0x270(0x08)
	struct UImage* FrameDetail; // 0x278(0x08)
	struct UImage* glow; // 0x280(0x08)
	struct UImage* HoveredSol; // 0x288(0x08)
	struct UBorder* OuterFrame; // 0x290(0x08)
	struct UImage* PlayIcon; // 0x298(0x08)

	void BndEvt__UMG_TitleScreenTrailerButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function UMG_TitleScreenTrailerButton.UMG_TitleScreenTrailerButton_C.BndEvt__UMG_TitleScreenTrailerButton_BaseButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void BndEvt__UMG_TitleScreenTrailerButton_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UMG_TitleScreenTrailerButton.UMG_TitleScreenTrailerButton_C.BndEvt__UMG_TitleScreenTrailerButton_BaseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void BndEvt__UMG_TitleScreenTrailerButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UMG_TitleScreenTrailerButton.UMG_TitleScreenTrailerButton_C.BndEvt__UMG_TitleScreenTrailerButton_BaseButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void ExecuteUbergraph_UMG_TitleScreenTrailerButton(int32_t EntryPoint); // Function UMG_TitleScreenTrailerButton.UMG_TitleScreenTrailerButton_C.ExecuteUbergraph_UMG_TitleScreenTrailerButton // (Final|UbergraphFunction) // @ game+0x1be0000
};

