// WidgetBlueprintGeneratedClass UMG_NotificationAttachmentsReturnedItems.UMG_NotificationAttachmentsReturnedItems_C
// Size: 0x2a8 (Inherited: 0x260)
struct UUMG_NotificationAttachmentsReturnedItems_C : UUserWidget {
	struct UHorizontalBox* CurrencyList; // 0x260(0x08)
	struct UImage* divider; // 0x268(0x08)
	struct UImage* divider_2; // 0x270(0x08)
	struct UHorizontalBox* ItemList; // 0x278(0x08)
	struct UUMG_InventoryItem_C* UMG_InventoryItem; // 0x280(0x08)
	struct UUMG_InventoryItem_C* UMG_InventoryItem_2; // 0x288(0x08)
	struct UUMG_InventoryItem_C* UMG_InventoryItem_3; // 0x290(0x08)
	struct UUMG_InventoryItem_C* UMG_InventoryItem_4; // 0x298(0x08)
	struct UUMG_MetaResourceDisplay_C* UMG_MetaResourceDisplay; // 0x2a0(0x08)

	void UpdateAttachments(struct FNotification& Notification); // Function UMG_NotificationAttachmentsReturnedItems.UMG_NotificationAttachmentsReturnedItems_C.UpdateAttachments // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
};

