// WidgetBlueprintGeneratedClass UMG_RepairBenchIcon.UMG_RepairBenchIcon_C
// Size: 0x2b0 (Inherited: 0x260)
struct UUMG_RepairBenchIcon_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UImage* divider; // 0x268(0x08)
	struct UImage* divider_2; // 0x270(0x08)
	struct UImage* FailIcon; // 0x278(0x08)
	struct UImage* Icon; // 0x280(0x08)
	struct UImage* NoShelterIcon; // 0x288(0x08)
	struct UImage* SuccessIcon; // 0x290(0x08)
	struct FRecipeSetsRowHandle RecipeSet; // 0x298(0x18)

	void OnLoaded_C712882247D2AB4653885092C87494BA(struct UObject* Loaded); // Function UMG_RepairBenchIcon.UMG_RepairBenchIcon_C.OnLoaded_C712882247D2AB4653885092C87494BA // (BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void Construct(); // Function UMG_RepairBenchIcon.UMG_RepairBenchIcon_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1be0000
	void ExecuteUbergraph_UMG_RepairBenchIcon(int32_t EntryPoint); // Function UMG_RepairBenchIcon.UMG_RepairBenchIcon_C.ExecuteUbergraph_UMG_RepairBenchIcon // (Final|UbergraphFunction|HasDefaults) // @ game+0x1be0000
};

