// WidgetBlueprintGeneratedClass UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C
// Size: 0xa29 (Inherited: 0x260)
struct UUMG_FriendTutorialProspect_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* HoverAnimation; // 0x268(0x08)
	struct UTextBlock* ActiveInsessiontext; // 0x270(0x08)
	struct UBorder* ActivePlayers; // 0x278(0x08)
	struct UBorder* AssignedPlayers; // 0x280(0x08)
	struct UTextBlock* AssignedPlayersText; // 0x288(0x08)
	struct UBorder* BackgroundHostName; // 0x290(0x08)
	struct UBorder* BackgroundHostStatus; // 0x298(0x08)
	struct UBorder* BackgroundProspectPin; // 0x2a0(0x08)
	struct UBorder* BackgroundSlot; // 0x2a8(0x08)
	struct UBorder* BackgroundSlot_2; // 0x2b0(0x08)
	struct UButton* ButtonBase; // 0x2b8(0x08)
	struct UTextBlock* Days; // 0x2c0(0x08)
	struct UTextBlock* Days_2; // 0x2c8(0x08)
	struct UTextBlock* Days_3; // 0x2d0(0x08)
	struct UTextBlock* Days_4; // 0x2d8(0x08)
	struct UTextBlock* Days_5; // 0x2e0(0x08)
	struct UVerticalBox* DifficultyExoticsVbox; // 0x2e8(0x08)
	struct UHorizontalBox* DifficultyHbox; // 0x2f0(0x08)
	struct UTextBlock* DifficultyText; // 0x2f8(0x08)
	struct UImage* DifficutlyIcon; // 0x300(0x08)
	struct UTextBlock* DropStatusText; // 0x308(0x08)
	struct UBorder* FrameHostName; // 0x310(0x08)
	struct UBorder* FrameProspectPin; // 0x318(0x08)
	struct UTextBlock* HostName; // 0x320(0x08)
	struct UOverlay* HostNameOverlay; // 0x328(0x08)
	struct UTextBlock* HostStatus; // 0x330(0x08)
	struct UTextBlock* Hours; // 0x338(0x08)
	struct UImage* HoveredLines; // 0x340(0x08)
	struct UOverlay* HoverEffects; // 0x348(0x08)
	struct UImage* Icon; // 0x350(0x08)
	struct UTextBlock* Minutes; // 0x358(0x08)
	struct UTextBlock* PersistantText; // 0x360(0x08)
	struct UHorizontalBox* PlayerSlots; // 0x368(0x08)
	struct UTextBlock* ProspectName; // 0x370(0x08)
	struct UOverlay* ProspectStatus; // 0x378(0x08)
	struct UBorder* ProspectTitleBackground; // 0x380(0x08)
	struct UTextBlock* Seconds; // 0x388(0x08)
	struct UImage* SlotsIcon; // 0x390(0x08)
	struct UImage* SlotsIcon_2; // 0x398(0x08)
	struct UTextBlock* SlotsTitle; // 0x3a0(0x08)
	struct UTextBlock* SlotsTitle_2; // 0x3a8(0x08)
	struct UTextBlock* TextBlock_122; // 0x3b0(0x08)
	struct UHorizontalBox* Time; // 0x3b8(0x08)
	struct UBorder* TimeBorder; // 0x3c0(0x08)
	struct UOverlay* VersionMismatch; // 0x3c8(0x08)
	struct UBorder* VersionNumber; // 0x3d0(0x08)
	struct UTextBlock* VersionText; // 0x3d8(0x08)
	struct FSlateColor TitleText_Hovered; // 0x3e0(0x28)
	struct FSlateColor TitleText_Default; // 0x408(0x28)
	struct FSlateColor DetailTitleText_Default; // 0x430(0x28)
	struct FFProspectServerInfo ProspectInfo; // 0x458(0x198)
	enum class E_ProspectState ProspectState; // 0x5f0(0x01)
	char pad_5F1[0x7]; // 0x5f1(0x07)
	struct FMulticastInlineDelegate ProspectSelected; // 0x5f8(0x10)
	struct FSlateColor DifficultyText_Easy; // 0x608(0x28)
	struct FSlateColor DifficultyText_Normal; // 0x630(0x28)
	struct FSlateColor DifficultyText_Hard; // 0x658(0x28)
	struct FSlateColor DifficultyText_Extreme; // 0x680(0x28)
	struct FSlateColor DifficultyTextColor; // 0x6a8(0x28)
	struct FSlateColor SlotsText_Hover; // 0x6d0(0x28)
	bool Hovered; // 0x6f8(0x01)
	bool Pressed; // 0x6f9(0x01)
	char pad_6FA[0x6]; // 0x6fa(0x06)
	struct FSlateColor TitleText_Pressed; // 0x700(0x28)
	struct FLinearColor Frame_Default; // 0x728(0x10)
	struct FLinearColor Frame_Hovered; // 0x738(0x10)
	struct FLinearColor Frame_Pressed; // 0x748(0x10)
	enum class E_PinState Pin State; // 0x758(0x01)
	char pad_759[0x3]; // 0x759(0x03)
	struct FLinearColor Title; // 0x75c(0x10)
	struct FLinearColor TitleBackground_Default; // 0x76c(0x10)
	struct FLinearColor TitleBackground_Hover; // 0x77c(0x10)
	struct FLinearColor TitleBackground_Pressed; // 0x78c(0x10)
	struct FLinearColor Background_Hovered; // 0x79c(0x10)
	struct FLinearColor Background_Pressed; // 0x7ac(0x10)
	struct FLinearColor Background_Default; // 0x7bc(0x10)
	char pad_7CC[0x4]; // 0x7cc(0x04)
	struct FSlateColor Black; // 0x7d0(0x28)
	struct FLinearColor Claimed_Default; // 0x7f8(0x10)
	struct FLinearColor Claimed_Hover; // 0x808(0x10)
	struct FLinearColor Claimed_Pressed; // 0x818(0x10)
	struct FLinearColor Claimable_Default; // 0x828(0x10)
	struct FLinearColor Claimable_Hover; // 0x838(0x10)
	struct FLinearColor Claimable_Pressed; // 0x848(0x10)
	struct FSlateColor Detail Title Text Default; // 0x858(0x28)
	struct FLinearColor OpenDefault; // 0x880(0x10)
	struct FLinearColor Open_Hover; // 0x890(0x10)
	struct FLinearColor Open_Pressed; // 0x8a0(0x10)
	struct FLinearColor Joined Default; // 0x8b0(0x10)
	struct FLinearColor Joined_Hover; // 0x8c0(0x10)
	struct FLinearColor Joined Pressed; // 0x8d0(0x10)
	struct FLinearColor CalimableFrame Default; // 0x8e0(0x10)
	struct FSlateColor ClaimableTitle; // 0x8f0(0x28)
	struct TMap<enum class EIcarusProspectDifficulty, struct FColor> DifficultyColourMap; // 0x918(0x50)
	struct FSlateColor CoinDefault; // 0x968(0x28)
	struct FSlateColor CoinHovered; // 0x990(0x28)
	struct FSlateColor CoinPressed; // 0x9b8(0x28)
	struct FLinearColor Occupied Default; // 0x9e0(0x10)
	struct FLinearColor Occupied Hovered; // 0x9f0(0x10)
	struct FLinearColor Occupied Pressed; // 0xa00(0x10)
	bool Active; // 0xa10(0x01)
	char pad_A11[0x7]; // 0xa11(0x07)
	struct FMulticastInlineDelegate ProspectExpired; // 0xa18(0x10)
	bool Is Persistent; // 0xa28(0x01)

	void SetHasClaimedProspect(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.SetHasClaimedProspect // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void SetTime(struct TArray<struct FString>& Time); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.SetTime // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void SetState(enum class E_ProspectState NewState); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.SetState // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void Update Pin Visuals(enum class E_PinState PinState); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.Update Pin Visuals // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void SetProspectInfo(struct FFProspectServerInfo Prospect); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.SetProspectInfo // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1be0000
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_5_OnButtonReleasedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void BndEvt__ButtonBase_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.BndEvt__ButtonBase_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1be0000
	void ExecuteUbergraph_UMG_FriendTutorialProspect(int32_t EntryPoint); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.ExecuteUbergraph_UMG_FriendTutorialProspect // (Final|UbergraphFunction|HasDefaults) // @ game+0x1be0000
	void ProspectExpired__DelegateSignature(); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.ProspectExpired__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void ProspectSelected__DelegateSignature(struct FFProspectServerInfo Prospect, bool Active); // Function UMG_FriendTutorialProspect.UMG_FriendTutorialProspect_C.ProspectSelected__DelegateSignature // (Public|Delegate|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
};

