// WidgetBlueprintGeneratedClass UMG_CreditsPage.UMG_CreditsPage_C
// Size: 0x3cc (Inherited: 0x260)
struct UUMG_CreditsPage_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* CreditsOpen; // 0x268(0x08)
	struct UUMG_Credits_Section_C* AddArt; // 0x270(0x08)
	struct UUMG_Credits_Section_C* AddArtandAnim; // 0x278(0x08)
	struct UUMG_Credits_Section_C* AddAudio; // 0x280(0x08)
	struct UUMG_Credits_Section_C* AddCinematicArt; // 0x288(0x08)
	struct UUMG_Credits_Section_C* AddDesign; // 0x290(0x08)
	struct UUMG_Credits_Section_C* AdditionalMarketing; // 0x298(0x08)
	struct UUMG_Credits_Section_C* AddProduction; // 0x2a0(0x08)
	struct UUMG_Credits_Section_C* AddProgramming; // 0x2a8(0x08)
	struct UUMG_Credits_Section_C* AddTech; // 0x2b0(0x08)
	struct UUMG_Credits_Section_C* AddWorldBuilders; // 0x2b8(0x08)
	struct UUMG_Credits_Section_C* Animation; // 0x2c0(0x08)
	struct UUMG_Credits_Section_C* Art; // 0x2c8(0x08)
	struct UUMG_Credits_Section_C* Audio; // 0x2d0(0x08)
	struct UUMG_BasicButton_2_C* BackButton; // 0x2d8(0x08)
	struct UUMG_Credits_Section_C* BigSpecialThanks; // 0x2e0(0x08)
	struct UUMG_Credits_Section_C* BigSpecialThanks_2; // 0x2e8(0x08)
	struct UUMG_Credits_Section_C* Concept; // 0x2f0(0x08)
	struct UUMG_Credits_Section_C* Corporate; // 0x2f8(0x08)
	struct UUMG_Credits_Section_C* CorporateSpecialThanks; // 0x300(0x08)
	struct UScrollBox* CreditsScroll; // 0x308(0x08)
	struct UUMG_Credits_Section_C* Design; // 0x310(0x08)
	struct UUMG_Credits_Section_C* ExecProducer; // 0x318(0x08)
	struct UUMG_Credits_Section_C* Gamerunner; // 0x320(0x08)
	struct UImage* Gradient; // 0x328(0x08)
	struct UUMG_Credits_Section_C* Keywords; // 0x330(0x08)
	struct UUMG_Credits_Section_C* Localization; // 0x338(0x08)
	struct UUMG_Credits_Section_C* Marketing; // 0x340(0x08)
	struct UUMG_Credits_Section_C* Modelling; // 0x348(0x08)
	struct UUMG_Credits_Section_C* Production; // 0x350(0x08)
	struct UUMG_Credits_Section_C* Programming; // 0x358(0x08)
	struct UUMG_Credits_Section_C* QualityAssurance; // 0x360(0x08)
	struct UUMG_Credits_Section_C* Rigging; // 0x368(0x08)
	struct UUMG_Credits_Section_C* Software; // 0x370(0x08)
	struct UUMG_Credits_Section_C* SpecialThanks; // 0x378(0x08)
	struct UUMG_Credits_Section_C* SysEngineers; // 0x380(0x08)
	struct UUMG_Credits_Section_C* Talent; // 0x388(0x08)
	struct UUMG_Credits_Section_C* Tech; // 0x390(0x08)
	struct UUMG_Credits_Section_C* TENCENT; // 0x398(0x08)
	struct UUMG_Credits_Section_C* Thanks; // 0x3a0(0x08)
	struct UUMG_Credits_Section_C* UI; // 0x3a8(0x08)
	struct UUMG_Credits_Section_C* WorldBuilder; // 0x3b0(0x08)
	struct UUMG_Credits_Section_C* WorldBuilderthanks; // 0x3b8(0x08)
	struct UUMG_Credits_Section_C* Writer; // 0x3c0(0x08)
	float ScrollSpeed; // 0x3c8(0x04)

	void Initialise(); // Function UMG_CreditsPage.UMG_CreditsPage_C.Initialise // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
	void Construct(); // Function UMG_CreditsPage.UMG_CreditsPage_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1be0000
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function UMG_CreditsPage.UMG_CreditsPage_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1be0000
	void ExecuteUbergraph_UMG_CreditsPage(int32_t EntryPoint); // Function UMG_CreditsPage.UMG_CreditsPage_C.ExecuteUbergraph_UMG_CreditsPage // (Final|UbergraphFunction|HasDefaults) // @ game+0x1be0000
};

