// WidgetBlueprintGeneratedClass UMG_MissionDifficulty.UMG_MissionDifficulty_C
// Size: 0x2f0 (Inherited: 0x260)
struct UUMG_MissionDifficulty_C : UUserWidget {
	struct UImage* DifficultyIcon; // 0x260(0x08)
	struct UImage* DifficultyIcon_2; // 0x268(0x08)
	struct UImage* DifficultyIcon_3; // 0x270(0x08)
	struct UImage* DifficultyIcon_4; // 0x278(0x08)
	struct UImage* DifficultyIcon_5; // 0x280(0x08)
	struct UImage* DifficultyIcon_6; // 0x288(0x08)
	struct UImage* DifficultyIcon_7; // 0x290(0x08)
	struct UImage* DifficultyIcon_8; // 0x298(0x08)
	struct FLinearColor EmptyColour; // 0x2a0(0x10)
	struct FLinearColor EasyStyle; // 0x2b0(0x10)
	struct FLinearColor HardStyle; // 0x2c0(0x10)
	struct FLinearColor ExtremeStyle; // 0x2d0(0x10)
	struct FLinearColor NormalStyle; // 0x2e0(0x10)

	void SetDifficulty(enum class EIcarusProspectDifficulty Difficulty); // Function UMG_MissionDifficulty.UMG_MissionDifficulty_C.SetDifficulty // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1be0000
};

